#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: AssetCollection

#include "Basic.hpp"

#include "GolfItSteam_structs.hpp"
#include "ByteStruct_structs.hpp"
#include "RawByteStruct_structs.hpp"
#include "GolfIt_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AssetCollection.AssetCollection_C
// 0x0030 (0x0088 - 0x0058)
class UAssetCollection_C final : public UGolfItCustomAssetCollectionSaveGame
{
public:
	TArray<struct FByteStruct>                    TexturePool;                                       // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRawByteStruct>                 PreviewPics;                                       // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         OriginalFileSize;                                  // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewFileSize;                                       // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamWorkshopItemHandle               WorkshopItemHandle;                                // 0x0080(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AssetCollection_C">();
	}
	static class UAssetCollection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetCollection_C>();
	}
};

}

