#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: BI_VR_Interface

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_VR_Interface.BI_VR_Interface_C.SetVRBall_Server
// 0x0010 (0x0010 - 0x0000)
struct BI_VR_Interface_C_SetVRBall_Server final
{
public:
	class AGolfBall_C*                            GolfBall;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHoleSpawnPoint_C*                      SpawnPoint;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BI_VR_Interface.BI_VR_Interface_C.SetVRConnonReference
// 0x0008 (0x0008 - 0x0000)
struct BI_VR_Interface_C_SetVRConnonReference final
{
public:
	class ACanon_C*                               CannonReference;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BI_VR_Interface.BI_VR_Interface_C.IsVRPawn
// 0x0001 (0x0001 - 0x0000)
struct BI_VR_Interface_C_IsVRPawn final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BI_VR_Interface.BI_VR_Interface_C.GetActiveVRController
// 0x0008 (0x0008 - 0x0000)
struct BI_VR_Interface_C_GetActiveVRController final
{
public:
	class USceneComponent*                        Controller;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BI_VR_Interface.BI_VR_Interface_C.GetVRBall
// 0x0008 (0x0008 - 0x0000)
struct BI_VR_Interface_C_GetVRBall final
{
public:
	class AGolfBall_C*                            Ball;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

