#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: BP_EditorInstanceObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_Editor_Categories_structs.hpp"
#include "InstancedWithPlaceableActors_structs.hpp"
#include "S_SimpleTransformStruct_structs.hpp"
#include "HirarchialObjects_structs.hpp"
#include "E_Editor_Themes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_InstancedMeshArray_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EditorInstanceObject.BP_EditorInstanceObject_C
// 0x0148 (0x0368 - 0x0220)
class ABP_EditorInstanceObject_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         ViewDistanceOriginal;                              // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseHInstances;                                     // 0x0234(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ClusterSize;                                       // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstancedWithPlaceableActors>  InstancedWithPlaceableActors;                      // 0x0240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UInstancedStaticMeshComponent*          DummyInstances;                                    // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 DummyTempList;                                     // 0x0258(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         TempIndex;                                         // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FHirarchialObjects, struct FS_InstancedMeshArray> Hirarchial_ObjectsInstances;                       // 0x0270(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FHirarchialObjects                     CurrentCombo;                                      // 0x02C0(0x0028)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UInstancedStaticMeshComponent*, struct FS_SimpleTransformStruct> FrameSave;                                         // 0x02E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FTransform>                     Temp;                                              // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UInstancedStaticMeshComponent*>  InstanceArray;                                     // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             SectionCompleted;                                  // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Remove_Foliage_From_Selection_Area(const struct FVector2D& LocalPositionStart, const struct FVector2D& LocalPositionEnd, bool ServerEvent, TArray<class ASimpleEditorActor_C*>* ConvertedFoliage);
	void RemoveFoliageWithThemeSelection(class FName DataKey, E_Editor_Themes Theme);
	void RemoveFoliageFromSphereWithThemeSelection(const struct FVector& Origin, float Sphere, TArray<class FName>& DataKeys, TArray<E_Editor_Themes>& Themes);
	void DefaultInstanceMaterialInstance(class UInstancedStaticMeshComponent* InstancedMesh);
	void ChangeMaterialOnInstance(E_Editor_Themes Theme, class UInstancedStaticMeshComponent* InstancedMesh);
	void RemoveFoliageFromSphere(const struct FVector& Origin, float Sphere);
	void AddSimpleInstancedObjectForClients(class UStaticMesh* Mesh, bool NoCollision, const struct FTransform& ObjectsTransform, E_Editor_Themes Theme);
	void RedoInstanceFromFrame(const TMap<class UInstancedStaticMeshComponent*, struct FS_SimpleTransformStruct>& InstanceToAdd);
	void AddInstancesFromLoad(const struct FS_EditorInstancedMeshes& InstanceToAdd);
	void GatherInstancesForSaving(TArray<struct FS_EditorInstancedMeshes>* InstancedObjects, bool* Failure_Occured);
	void AddInstanceObject(class UStaticMesh* Mesh, bool NoCollision, const struct FTransform& ObjectsTransform, E_Editor_Themes Theme, class FName DataKey, class UInstancedStaticMeshComponent** InstancedMesh, class UHierarchicalInstancedStaticMeshComponent** HierarchicalInstancedMesh, struct FTransform* ObjectTransform, struct FHirarchialObjects* Combo);
	bool CheckClusterSize(class UInstancedStaticMeshComponent* InstancedStaticMesh, class AActor* Actor);
	void RemoveInstacesFromSavedFrame(const TMap<class UInstancedStaticMeshComponent*, struct FS_SimpleTransformStruct>& SavedFrameToRemove);
	void Check_If_Mesh_In_Global_Object_List(bool* Exist, struct FS_InstancedMeshArray* OutputInstances);
	void ClearAll();
	void ChangeCull(int32 ViewDistance);
	void SetOriginalViewDistance(int32 ViewDistanceSetting);
	void SetAllInstancesToStatic();
	void RememberPlaceableObjects(const TArray<class AActor*>& PlaceableActors, const class UInstancedStaticMeshComponent* InstancedMesh, const class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedMesh, const int32 InstancedID);
	void RemovePlacableObjects(const class UInstancedStaticMeshComponent* InstancedMesh, const class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedMesh, const int32 InstancedID);
	void ServerAddInstance(class UStaticMesh* StaticMesh, bool NoCollision, const struct FTransform& ObjectTransform, bool CalledByServer, E_Editor_Themes Theme, class FName DataKey);
	void LoadObjectsFromSave(TArray<struct FS_EditorInstancedMeshes>& ObjectList);
	void MulticastAddInstanceToClients(class UInstancedStaticMeshComponent* InstancedMesh, const struct FTransform& Transform, bool NoCollision, class UStaticMesh* Mesh, const E_Editor_Themes Area);
	void MulticastRemoveInstances(const TMap<class UInstancedStaticMeshComponent*, struct FS_SimpleTransformStruct>& InstancesToRemove);
	void RemoveInstance(const struct FVector& StartTrace, const struct FVector& EndTrace);
	void MulticastRedoInstance(const TMap<class UInstancedStaticMeshComponent*, struct FS_SimpleTransformStruct>& InstanceToRedo);
	void MulticastAddInstance(class UStaticMesh* StaticMesh, bool NoCollision, const struct FTransform& ObjectTransform, bool CalledByServer, E_Editor_Themes Theme, class FName DataKey);
	void MulticastAddInstancesToClientsInitialLoad(const TArray<struct FTransform>& Transform, bool NoCollision, class UStaticMesh* Mesh, E_Editor_Themes Area, class APlayerController* PlayerController);
	void CloseClientLoad();
	void OpenClientLoad();
	void RemoveInstancesFromLocalData(const struct FVector2D& StartTrace, const struct FVector2D& EndTrace);
	void Server_RemoveInstancesFromLocalData(const struct FVector2D& StartTrace, const struct FVector2D& EndTrace);
	void ExecuteUbergraph_BP_EditorInstanceObject(int32 EntryPoint);
	void SectionCompleted__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EditorInstanceObject_C">();
	}
	static class ABP_EditorInstanceObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EditorInstanceObject_C>();
	}
};

}

