#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: BP_SplineMeshBuilder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Struct_RiverNode_structs.hpp"
#include "RiverVisualData_structs.hpp"
#include "RiverData_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SplineMeshBuilder.BP_SplineMeshBuilder_C
// 0x0240 (0x0460 - 0x0220)
class ABP_SplineMeshBuilder_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<class ABP_SplineMeshController_C*, int32> ControlMeshes;                                     // 0x0238(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class USplineMeshComponent*>           VisibleMeshList;                                   // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UMaterialInstance*                      MaterialToUse;                                     // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterTriggerThickness;                             // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterTriggerHeightOffset;                          // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BuoyancyTriggerLength;                             // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USplineMeshComponent*, struct FStruct_RiverNode> NodeList;                                          // 0x02B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class AGolfBall_C*, struct FStruct_RiverNode> GolfballNodemap;                                   // 0x0300(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	float                                         CorrectionForce;                                   // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RiverForce;                                        // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GravityForce;                                      // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Counter;                                           // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSplinePoint>                   DefaultSplinePoints;                               // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSplinePoint>                   CurrentSplinePoints;                               // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         WaterDepthScale;                                   // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Inside;                                            // 0x0384(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPostProcessComponent*>          PostProcessComponents;                             // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class ABP_SplineMeshController_C*>     TempRefControlPoints;                              // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<struct FSplinePoint>                   TempControlPoints;                                 // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRiverData                             NewRiverData;                                      // 0x03B8(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       MaterialList;                                      // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         RiverCutLength;                                    // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBillboardComponent*                    MeshBillboard;                                     // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRiverVisualData                       VisualRiverData;                                   // 0x0420(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SplineMeshController_C*             CurrentPoint;                                      // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SplineMeshController_C*             LastPoint;                                         // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            MeshToUse;                                         // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetRiverData(struct FRiverData* RiverData);
	void GetVisualParameters(struct FRiverVisualData* VisualData);
	void SetVisualParameters(const struct FRiverVisualData& Param_VisualRiverData);
	void BuildMesh();
	void RebuildSpline();
	void ReceiveBeginPlay();
	void DeleteAndResetRiverSettings();
	void SpawnControlPoints();
	void ReAttachControlPoints();
	void RescaleSplineAtPoint(float NewScale, class ABP_SplineMeshController_C* ControlRef);
	void UpdateNodeList();
	void AddNewControlPoint(class ABP_SplineMeshController_C* LastControlPoint);
	void ReceiveDestroyed();
	void RemoveControlPoint();
	void SetNewDataServer(const struct FRiverData& Param_NewRiverData);
	void RebuildSplines();
	void DisplayBillboard();
	void SetSplineData(const TArray<struct FSplinePoint>& SplinePoints);
	void SetNewDataMulticast(const struct FRiverData& Param_NewRiverData);
	void ServerSetVisualParas(const struct FRiverVisualData& Param_VisualRiverData);
	void MulticastSetVisualParas(const struct FRiverVisualData& NewVisualRiverData);
	void MulticastSpawnedSplineMeshControlPoints(const TArray<class ABP_SplineMeshController_C*>& ControlMesh, const TArray<int32>& IndexValues);
	void MulticastRebuildSpline();
	void MulticastNewControlPointContinue(class ABP_SplineMeshController_C* NewControlPoint, class ABP_SplineMeshController_C* LastControlPoint);
	void EnableCollision();
	void ExecuteUbergraph_BP_SplineMeshBuilder(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SplineMeshBuilder_C">();
	}
	static class ABP_SplineMeshBuilder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SplineMeshBuilder_C>();
	}
};

}

