#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: BP_UnderwaterBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GolfIt_structs.hpp"
#include "GolfIt_classes.hpp"
#include "E_StatusEffect_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UnderwaterBox.BP_UnderwaterBox_C
// 0x0038 (0x02C8 - 0x0290)
class ABP_UnderwaterBox_C final : public AGolfItUnderwaterBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  WaterPostProcess;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  AirPostProcess;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   OutsideCube;                                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   InnereCube;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDeepBlue;                                        // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_UnderwaterBox(int32 EntryPoint);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void ResetCameraChanges();
	void OnCameraInside();
	void OnVisualsChanged();
	void OnShapeChanged(TSubclassOf<class UShapeComponent> ShapeType);
	void SetWaterColor();
	void GetWaterColor();
	void UseBuoyancy(bool Buoyancy);
	void SetWaterVisibility(bool NewVisibility, int32 MaterialIndex);
	void UserConstructionScript();
	bool IsInside(const struct FVector& Location);
	void CheckIfInsideOtherWaterObjects(bool* FoundOthers, float* NewGravityZ);
	void ChangeVisibility(bool Inside);
	void GetBuoyancy(bool* Buoyancy);
	void GetIsCameraInUnderwaterEffectSphere(bool* Yes);
	void GetWaterVisibility(bool* IsVisible, int32* MaterialIndex);
	void IsWaterObject(class AGolfBall_C* Ball, class UPrimitiveComponent* HitComponent, int32 ElementIndex, bool* WaterObject, bool* UseNewWaterNormal, struct FVector* NewWaterEffectNormal, bool* ShouldResultInReset_, bool* NoFX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UnderwaterBox_C">();
	}
	static class ABP_UnderwaterBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_UnderwaterBox_C>();
	}
};

}

