#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: BP_UnderwaterSphere

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GolfIt_structs.hpp"
#include "GolfIt_classes.hpp"
#include "E_StatusEffect_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UnderwaterSphere.BP_UnderwaterSphere_C
// 0x0040 (0x02D0 - 0x0290)
class ABP_UnderwaterSphere_C final : public AGolfItUnderwaterBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  AirPostProcess;                                    // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  WaterPostProcess;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   OutsideSphere;                                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   InnereSphere;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDeepBlue;                                        // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RelativeDeepBlueMeshLocation;                      // 0x02C4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UnderwaterSphere(int32 EntryPoint);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void CustomEvent();
	void OnCameraInside();
	void ReceiveBeginPlay();
	void OnVisualsChanged();
	void OnShapeChanged(TSubclassOf<class UShapeComponent> ShapeType);
	void SetWaterColor();
	void GetWaterColor();
	void UseBuoyancy(bool Buoyancy);
	void SetWaterVisibility(bool NewVisibility, int32 MaterialIndex);
	void UserConstructionScript();
	bool IsInside(const struct FVector& Location);
	void CheckIfInsideOtherWaterObjects(bool* FoundOthers, float* NewGravityZ);
	void CheckOverlappingDeepBlue(const class AActor* Other, bool* Overlapping);
	void ChangeVisibility(bool Inside);
	void GetBuoyancy(bool* Buoyancy);
	void GetIsCameraInUnderwaterEffectSphere(bool* Yes);
	void GetWaterVisibility(bool* IsVisible, int32* MaterialIndex);
	void IsWaterObject(class AGolfBall_C* Ball, class UPrimitiveComponent* HitComponent, int32 ElementIndex, bool* WaterObject, bool* UseNewWaterNormal, struct FVector* NewWaterEffectNormal, bool* ShouldResultInReset_, bool* NoFX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UnderwaterSphere_C">();
	}
	static class ABP_UnderwaterSphere_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_UnderwaterSphere_C>();
	}
};

}

