#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: BP_Waterfall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GolfIt_structs.hpp"
#include "GolfIt_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Waterfall.BP_Waterfall_C
// 0x0070 (0x02E0 - 0x0270)
class ABP_Waterfall_C final : public AGolfItBaseWaterfall
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   WaterfallMesh;                                     // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<EWaterfallType, TSoftObjectPtr<class UStaticMesh>> WaterfallMeshMap;                                  // 0x0288(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               WaterfallMaterial;                                 // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Waterfall(int32 EntryPoint);
	void OnColorChanged();
	void OnSettingsChanged();
	void ReceiveBeginPlay();
	void SetWaterColor();
	void GetWaterColor();
	void UseBuoyancy(bool Buoyancy);
	void SetWaterVisibility(bool NewVisibility, int32 MaterialIndex);
	void UpdateMaterialScalarSettings();
	void UpdateMaterialColorSettings();
	void GetBuoyancy(bool* Buoyancy);
	void GetIsCameraInUnderwaterEffectSphere(bool* Yes);
	void GetWaterVisibility(bool* IsVisible, int32* MaterialIndex);
	void IsWaterObject(class AGolfBall_C* Ball, class UPrimitiveComponent* HitComponent, int32 ElementIndex, bool* WaterObject, bool* UseNewWaterNormal, struct FVector* NewWaterEffectNormal, bool* ShouldResultInReset_, bool* NoFX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Waterfall_C">();
	}
	static class ABP_Waterfall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Waterfall_C>();
	}
};

}

