#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: ByteMeshStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ByteMeshStruct.ByteMeshStruct
// 0x0050 (0x0050 - 0x0000)
struct FByteMeshStruct final
{
public:
	TArray<uint8>                                 Vector_3_55C86745490A8C3FF1973887E27ADD7C;         // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<uint8>                                 Tris_5_08DA685B4A29FF65910F12AC443592F1;           // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<uint8>                                 Normal_8_2964BDBD40E4A46D018547A0E1C50BF6;         // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<uint8>                                 TexCord_10_A6318F8F49053379998507AD21C00D4B;       // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<uint8>                                 TangentArray_14_1F3FAFDC4F1A4BC2450F0DB65A9CA8A1;  // 0x0040(0x0010)(Edit, BlueprintVisible)
};

}

