#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: CustomSettings

#include "Basic.hpp"

#include "E_Ball_BouncyPhysics_structs.hpp"
#include "E_Ball_RollPhysics_structs.hpp"


namespace SDK
{

// UserDefinedStruct CustomSettings.CustomSettings
// 0x000A (0x000A - 0x0000)
struct FCustomSettings final
{
public:
	bool                                          Jumping_2_F1D651834B6E8DD967D777AFCFC46725;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HardMode_4_50FD94DD4BB505A624B5F68AD0B71F32;       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          BanAlternativeShooting_6_592DDD3C4F52346C961363925009C766; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NoResetPenalty_8_56BB95974D6F2815AC549AB9F7131C0C; // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AllowgolfClubs_10_5C9459D9423E1ED804A243B3C9A57DE5; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_Ball_BouncyPhysics                          BallBouncy_14_3ADD88C642DDB111921C6B9D099719C1;    // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Ball_RollPhysics                            BallFriction_16_F9C9853144A0EC998EDFF2B44CEFA62B;  // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Simulation_18_436B42D143606B423FB2CC9B895750C7;    // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AllowReset_20_47023B7249733DC6FD72C4A7FE2DDD14;    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HIO_22_70DC41DE4360243DE6BE7BA0387F9405;           // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

