#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: CustomModel

#include "Basic.hpp"

#include "DynamicMeshData_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CustomModel.CustomModel_C
// 0x0170 (0x0198 - 0x0028)
class UCustomModel_C final : public USaveGame
{
public:
	TArray<struct FDynamicMeshData>               MeshData;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Texture1;                                          // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Texture2;                                          // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Texture3;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Texture4;                                          // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Texture5;                                          // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Texture6;                                          // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Texture7;                                          // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Texture8;                                          // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Normal1;                                           // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Normal2;                                           // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Normal3;                                           // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Normal4;                                           // 0x00E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Normal5;                                           // 0x00F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Normal6;                                           // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Normal7;                                           // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 Normal8;                                           // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  WorldAlign;                                        // 0x0138(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  UseNormal;                                         // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  UseAlpha;                                          // 0x0158(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  DefaultTextures;                                   // 0x0168(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         TextureNames;                                      // 0x0178(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         PhysicalMaterials;                                 // 0x0188(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomModel_C">();
	}
	static class UCustomModel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomModel_C>();
	}
};

}

