#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: CustomLevel

#include "Basic.hpp"

#include "EventMaster_structs.hpp"
#include "Engine_structs.hpp"
#include "FlyTrapSettingsStruct_structs.hpp"
#include "E_Editor_Themes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LobbySettings_0_structs.hpp"
#include "RiverData_structs.hpp"
#include "EditorTransformStruct_structs.hpp"
#include "DynamicSplineStruct_structs.hpp"
#include "LightStruct_structs.hpp"
#include "RawByteStruct_structs.hpp"
#include "CustomObjectTexturePoolIDStruct_structs.hpp"
#include "ImportedObjectStruct_structs.hpp"
#include "ImportedObjTransforms_structs.hpp"
#include "CustomAssetSettings_structs.hpp"
#include "EventDefaultValues_structs.hpp"
#include "PostProcess_Struct_structs.hpp"
#include "CustomMapGeneralStruct_structs.hpp"
#include "PlanetStruct_structs.hpp"
#include "E_TerrainType_structs.hpp"
#include "AudioSoundStruct_structs.hpp"
#include "S_RecommendedSettings_structs.hpp"
#include "S_EditorInstancedMeshes_structs.hpp"
#include "S_FullLaneComposition_structs.hpp"
#include "S_AdditionalObjectInfo_Master_structs.hpp"
#include "S_CustomMaterials_structs.hpp"
#include "S_CustomTexture_structs.hpp"
#include "S_VoxelSaveData_structs.hpp"
#include "S_MasterLight_structs.hpp"
#include "GolfIt_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CustomLevel.CustomLevel_C
// 0x0458 (0x04D0 - 0x0078)
class UCustomLevel_C final : public UGolfItCustomMapSaveGame
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<TSoftObjectPtr<class UStaticMesh>>     MeshesList;                                        // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTransform>                     Transforms;                                        // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 HoleNumber;                                        // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 HolePar;                                           // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 LevelName;                                         // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, HasGetValueTypeHash)
	TArray<bool>                                  IsPlayArea_;                                       // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  IsSpawnPoint;                                      // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                    RotatorMeshes;                                     // 0x00F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        RotatorVectors;                                    // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTransform>                     RotatorTransform;                                  // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         TimeOfDay;                                         // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLightStruct>                   LightStruct;                                       // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<E_Editor_Themes>                       Categorie;                                         // 0x0138(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 CreatorName;                                       // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          ListHasBeenModified_;                              // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 SkipIndexes;                                       // 0x0160(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                    RotationalMeshes;                                  // 0x0170(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRotator>                       StartRotation;                                     // 0x0180(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRotator>                       EndRotation;                                       // 0x0190(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        VectorRotation;                                    // 0x01A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTransform>                     TransformRotation;                                 // 0x01B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FEditorTransformStruct>         TransformerSettings;                               // 0x01C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         TextArray;                                         // 0x01D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLinearColor>                   TextColorArray;                                    // 0x01E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FDynamicSplineStruct>           DynamicSplineStruct;                               // 0x01F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FImportedObjectStruct>          CustomObjects;                                     // 0x0200(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          NeedsSubscription;                                 // 0x0210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Savingdone;                                        // 0x0211(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FImportedObjTransforms>         CustomMeshTransforms;                              // 0x0218(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 Rotator3UniqueID;                                  // 0x0228(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FEventMaster>                   EventMasterArray;                                  // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTransform>                     EventMasterTransform;                              // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FEventDefaultValues>            EventActorArray;                                   // 0x0258(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FTransform>                     EventActorTransform;                               // 0x0268(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          TerrainUsed;                                       // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 GravitationalForceValues;                          // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCustomMapGeneralStruct                CustomSettings;                                    // 0x0290(0x0090)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FPlanetStruct>                  PlanetStructArray;                                 // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FCustomObjectTexturePoolIDStruct> CustomMeshPool;                                    // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HasCustomSettings;                                 // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAudioSoundStruct>              AudioSettings;                                     // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FCustomAssetSettings>           CustomObjectSettings;                              // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRiverData>                     RiverData;                                         // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        RotatorsOffset;                                    // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLobbySettings                         RecommendedSettings;                               // 0x0388(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FS_RecommendedSettings>         ForcedRecommended;                                 // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UseRecommended;                                    // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPostProcess_Struct>            PostProcessData;                                   // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FFlyTrapSettingsStruct>         FlyTraps;                                          // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         TerrainVersion;                                    // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_AdditionalObjectInfo_Master> AdditionalObjectInfo;                              // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_FullLaneComposition>         LaneComposition;                                   // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_CustomMaterials>             CustomLaneMaterials;                               // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_CustomTexture>               CustomLaneTextures;                                // 0x0440(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FS_VoxelSaveData                       VoxelWorld;                                        // 0x0450(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	E_TerrainType                                 WorldType;                                         // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_EditorInstancedMeshes>       EditorInstancedObjects;                            // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         TextVersion;                                       // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_AdditionalObjectInfo_Master> RotatorAdditionalData;                             // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_MasterLight>                 LightData;                                         // 0x04B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRawByteStruct>                 NewMeshes;                                         // 0x04C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void GetCustomMusic(bool* Valid, TArray<uint8>* RawMusic);
	void CheckIfTerrainUsed(bool* Used);
	void CheckforDuplicates(bool* Finished);
	void LoadLevel(TArray<TSoftObjectPtr<class UStaticMesh>>* Meshes, TArray<struct FTransform>* MeshesTransform, TArray<int32>* Param_HoleNumber, TArray<int32>* Param_HolePar, TArray<bool>* Param_IsPlayArea_, TArray<bool>* IsSpawnPoint_, TArray<class UStaticMesh*>* Param_RotatorMeshes, TArray<struct FVector>* Param_RotatorVectors, TArray<struct FTransform>* Param_RotatorTransform, float* Param_TimeOfDay, TArray<struct FLightStruct>* LightProperies, TArray<E_Editor_Themes>* Area_Categorie, TArray<class UStaticMesh*>* Param_RotationalMeshes, TArray<struct FRotator>* Param_StartRotation, TArray<struct FRotator>* Param_EndRotation, TArray<struct FVector>* Param_VectorRotation, TArray<struct FTransform>* Param_TransformRotation, TArray<struct FEditorTransformStruct>* Param_TransformerSettings, TArray<class FString>* Param_TextArray, TArray<struct FLinearColor>* Param_TextColorArray, TArray<struct FDynamicSplineStruct>* DynamicSplines, TArray<struct FImportedObjectStruct>* DynamicMesh, TArray<struct FImportedObjTransforms>* DynamicMeshTransforms, TArray<int32>* RotatorUniqeID, TArray<struct FEventMaster>* Param_EventMasterArray, TArray<struct FTransform>* Param_EventMasterTransform, TArray<struct FEventDefaultValues>* Param_EventActorArray, TArray<struct FTransform>* Param_EventActorTransform, TArray<float>* Param_GravitationalForceValues, TArray<struct FPlanetStruct>* Planets, TArray<struct FCustomObjectTexturePoolIDStruct>* TexturePoolIDs, TArray<struct FAudioSoundStruct>* AudioStruct, TArray<struct FRiverData>* Param_RiverData, TArray<struct FVector>* RotatorOffset, TArray<struct FPostProcess_Struct>* Param_PostProcessData, TArray<struct FFlyTrapSettingsStruct>* FlyTrapData, TArray<struct FS_AdditionalObjectInfo_Master>* AdditionalObjectParameter, TArray<struct FS_FullLaneComposition>* Param_LaneComposition);
	void SetDeletedGround(bool Used);
	void ExecuteUbergraph_CustomLevel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomLevel_C">();
	}
	static class UCustomLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomLevel_C>();
	}
};

}

