#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: CustomLevel

#include "Basic.hpp"

#include "CustomObjectTexturePoolIDStruct_structs.hpp"
#include "RawByteStruct_structs.hpp"
#include "ImportedObjectStruct_structs.hpp"
#include "FlyTrapSettingsStruct_structs.hpp"
#include "E_Editor_Themes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EventMaster_structs.hpp"
#include "RiverData_structs.hpp"
#include "EditorTransformStruct_structs.hpp"
#include "DynamicSplineStruct_structs.hpp"
#include "LightStruct_structs.hpp"
#include "ImportedObjTransforms_structs.hpp"
#include "EventDefaultValues_structs.hpp"
#include "PlanetStruct_structs.hpp"
#include "AudioSoundStruct_structs.hpp"
#include "PostProcess_Struct_structs.hpp"
#include "S_FullLaneComposition_structs.hpp"
#include "S_AdditionalObjectInfo_Master_structs.hpp"


namespace SDK::Params
{

// Function CustomLevel.CustomLevel_C.GetCustomMusic
// 0x0068 (0x0068 - 0x0000)
struct CustomLevel_C_GetCustomMusic final
{
public:
	bool                                          Valid;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 RawMusic;                                          // 0x0008(0x0010)(Parm, OutParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRawByteStruct                         CallFunc_Array_Get_Item;                           // 0x0040(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function CustomLevel.CustomLevel_C.CheckIfTerrainUsed
// 0x0001 (0x0001 - 0x0000)
struct CustomLevel_C_CheckIfTerrainUsed final
{
public:
	bool                                          Used;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function CustomLevel.CustomLevel_C.CheckforDuplicates
// 0x0160 (0x0160 - 0x0000)
struct CustomLevel_C_CheckforDuplicates final
{
public:
	bool                                          Finished;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            StaticMeshRotatorRef;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 MarkedForDeletion;                                 // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<struct FTransform>                     LocalTrans;                                        // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         Current;                                           // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Counter;                                           // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0088(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             CallFunc_Array_Get_Item_2;                         // 0x00D8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_SoftObjectReference_ReturnValue; // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue; // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0xC];                                      // 0x0114(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item_3;                         // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TransformTransform_ReturnValue; // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_157[0x1];                                      // 0x0157(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CustomLevel.CustomLevel_C.LoadLevel
// 0x0258 (0x0258 - 0x0000)
struct CustomLevel_C_LoadLevel final
{
public:
	TArray<TSoftObjectPtr<class UStaticMesh>>     Meshes;                                            // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FTransform>                     MeshesTransform;                                   // 0x0010(0x0010)(Parm, OutParm)
	TArray<int32>                                 Param_HoleNumber;                                  // 0x0020(0x0010)(Parm, OutParm)
	TArray<int32>                                 Param_HolePar;                                     // 0x0030(0x0010)(Parm, OutParm)
	TArray<bool>                                  Param_IsPlayArea_;                                 // 0x0040(0x0010)(Parm, OutParm)
	TArray<bool>                                  IsSpawnPoint_;                                     // 0x0050(0x0010)(Parm, OutParm)
	TArray<class UStaticMesh*>                    Param_RotatorMeshes;                               // 0x0060(0x0010)(Parm, OutParm)
	TArray<struct FVector>                        Param_RotatorVectors;                              // 0x0070(0x0010)(Parm, OutParm)
	TArray<struct FTransform>                     Param_RotatorTransform;                            // 0x0080(0x0010)(Parm, OutParm)
	float                                         Param_TimeOfDay;                                   // 0x0090(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLightStruct>                   LightProperies;                                    // 0x0098(0x0010)(Parm, OutParm)
	TArray<E_Editor_Themes>                       Area_Categorie;                                    // 0x00A8(0x0010)(Parm, OutParm)
	TArray<class UStaticMesh*>                    Param_RotationalMeshes;                            // 0x00B8(0x0010)(Parm, OutParm)
	TArray<struct FRotator>                       Param_StartRotation;                               // 0x00C8(0x0010)(Parm, OutParm)
	TArray<struct FRotator>                       Param_EndRotation;                                 // 0x00D8(0x0010)(Parm, OutParm)
	TArray<struct FVector>                        Param_VectorRotation;                              // 0x00E8(0x0010)(Parm, OutParm)
	TArray<struct FTransform>                     Param_TransformRotation;                           // 0x00F8(0x0010)(Parm, OutParm)
	TArray<struct FEditorTransformStruct>         Param_TransformerSettings;                         // 0x0108(0x0010)(Parm, OutParm)
	TArray<class FString>                         Param_TextArray;                                   // 0x0118(0x0010)(Parm, OutParm)
	TArray<struct FLinearColor>                   Param_TextColorArray;                              // 0x0128(0x0010)(Parm, OutParm)
	TArray<struct FDynamicSplineStruct>           DynamicSplines;                                    // 0x0138(0x0010)(Parm, OutParm)
	TArray<struct FImportedObjectStruct>          DynamicMesh;                                       // 0x0148(0x0010)(Parm, OutParm)
	TArray<struct FImportedObjTransforms>         DynamicMeshTransforms;                             // 0x0158(0x0010)(Parm, OutParm)
	TArray<int32>                                 RotatorUniqeID;                                    // 0x0168(0x0010)(Parm, OutParm)
	TArray<struct FEventMaster>                   Param_EventMasterArray;                            // 0x0178(0x0010)(Parm, OutParm)
	TArray<struct FTransform>                     Param_EventMasterTransform;                        // 0x0188(0x0010)(Parm, OutParm)
	TArray<struct FEventDefaultValues>            Param_EventActorArray;                             // 0x0198(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<struct FTransform>                     Param_EventActorTransform;                         // 0x01A8(0x0010)(Parm, OutParm)
	TArray<float>                                 Param_GravitationalForceValues;                    // 0x01B8(0x0010)(Parm, OutParm)
	TArray<struct FPlanetStruct>                  Planets;                                           // 0x01C8(0x0010)(Parm, OutParm)
	TArray<struct FCustomObjectTexturePoolIDStruct> TexturePoolIDs;                                    // 0x01D8(0x0010)(Parm, OutParm)
	TArray<struct FAudioSoundStruct>              AudioStruct;                                       // 0x01E8(0x0010)(Parm, OutParm)
	TArray<struct FRiverData>                     Param_RiverData;                                   // 0x01F8(0x0010)(Parm, OutParm)
	TArray<struct FVector>                        RotatorOffset;                                     // 0x0208(0x0010)(Parm, OutParm)
	TArray<struct FPostProcess_Struct>            Param_PostProcessData;                             // 0x0218(0x0010)(Parm, OutParm)
	TArray<struct FFlyTrapSettingsStruct>         FlyTrapData;                                       // 0x0228(0x0010)(Parm, OutParm)
	TArray<struct FS_AdditionalObjectInfo_Master> AdditionalObjectParameter;                         // 0x0238(0x0010)(Parm, OutParm)
	TArray<struct FS_FullLaneComposition>         Param_LaneComposition;                             // 0x0248(0x0010)(Parm, OutParm)
};

// Function CustomLevel.CustomLevel_C.SetDeletedGround
// 0x0001 (0x0001 - 0x0000)
struct CustomLevel_C_SetDeletedGround final
{
public:
	bool                                          Used;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function CustomLevel.CustomLevel_C.ExecuteUbergraph_CustomLevel
// 0x0008 (0x0008 - 0x0000)
struct CustomLevel_C_ExecuteUbergraph_CustomLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Used;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

