#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: CustomAssetExtraSettings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CustomAssetExtraSettings.CustomAssetExtraSettings_C
// 0x00A0 (0x00C8 - 0x0028)
class UCustomAssetExtraSettings_C final : public USaveGame
{
public:
	TArray<struct FTransform>                     SnapPoints;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  Roughness;                                         // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 RoughnessValues;                                   // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  Specular;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 SpecularValues;                                    // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  Metallic;                                          // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 MetallicValues;                                    // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 TextureScale;                                      // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 SpeedX;                                            // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 SpeedY;                                            // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomAssetExtraSettings_C">();
	}
	static class UCustomAssetExtraSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomAssetExtraSettings_C>();
	}
};

}

