#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: CustomVoxelWorld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_TerrainType_structs.hpp"
#include "Voxel_structs.hpp"
#include "Voxel_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CustomVoxelWorld.CustomVoxelWorld_C
// 0x0078 (0x0908 - 0x0890)
class ACustomVoxelWorld_C final : public AVoxelWorld
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0890(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         WorldSize;                                         // 0x0898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TerrainType                                 TerrainType;                                       // 0x089C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89D[0x3];                                      // 0x089D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentSelectionIndex;                             // 0x08A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentRadius;                                     // 0x08A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVoxelCompressedWorldSave              SaveFile;                                          // 0x08A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UVoxelInstancedMaterialCollection> VoxelWorldMaterial;                                // 0x08C8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          EditorWorldLoaded;                                 // 0x08F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F1[0x7];                                      // 0x08F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             StartDataTransfer;                                 // 0x08F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UserConstructionScript();
	void VoxelTypeChanged(const class FString& SelectedItem, ESelectInfo SelectionType, int32 Param_Index);
	void VoxelTypeChangedServer(const class FString& SelectedItem, ESelectInfo SelectionType, int32 Param_Index);
	void VoxelSizeChangedMulticast(float Value);
	void VoxelWorldScaleChangedMulticast(float Value);
	void VoxelSizeChangedServer(float Value);
	void VoxelWorldScaleChangedServer(float Value);
	void ServerChangeTerrainType(E_TerrainType Param_TerrainType);
	void MulticastChangeTerrainType(E_TerrainType NewTerrainType);
	void VoxelWorldSaveFrame();
	void VoxelWorldUndo();
	void VoxelWorldRedo();
	void StartEditing();
	void StopEditing();
	void RecreateWorldIfEditor();
	void Recreate();
	void LoadWorldFromCompressedSavve(const struct FVoxelCompressedWorldSave& Param_SaveFile, float Param_VoxelSize, float Param_WorldSize, EVoxelRenderType Param_RenderType);
	void RecieveWorldSize(float Param_VoxelSize, float Param_WorldSize, EVoxelRenderType Param_RenderType);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_CustomVoxelWorld(int32 EntryPoint);
	void StartDataTransfer__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomVoxelWorld_C">();
	}
	static class ACustomVoxelWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACustomVoxelWorld_C>();
	}
};

}

