#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: DefaultSoundStruct

#include "Basic.hpp"

#include "DefaultSoundCategorieEnum_structs.hpp"


namespace SDK
{

// UserDefinedStruct DefaultSoundStruct.DefaultSoundStruct
// 0x0078 (0x0078 - 0x0000)
struct FDefaultSoundStruct final
{
public:
	class FString                                 InternalName_2_9878D69345F08E5525605A92279D04FA;   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DisplayName_4_6982B0EA43B0F0C899E9AE95DFC6C887;    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               SoundFile_13_6576126A4E254780C9DFCD89A336C7A7;     // 0x0020(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Looping_9_CE2A6E4843452C9527C806A51EE00794;        // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EDefaultSoundCategorieEnum                    SoundArea_12_C5FC269F4B3344C7A5F61A889DF293DB;     // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFMODEvent>              FMODSoundEvent_16_BCF370A74B4DE017638A48B47B24691A; // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};

}

