#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: DemoSpectator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_DemoSimpleData_structs.hpp"
#include "S_DemoEventData_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DemoSpectator.DemoSpectator_C
// 0x0138 (0x03E0 - 0x02A8)
class ADemoSpectator_C final : public ASpectatorPawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       Camera;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Stop;                                              // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeDilation;                                      // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerFollow;                                      // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADebugBall_C*                           CurrentlyFollowing;                                // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDemo_IngameUI_C*                       DemoUI;                                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_DemoSimpleData>              Demo_Data;                                         // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         TotalTime;                                         // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentBallIndex;                                  // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentHole;                                       // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_DemoEventData>               Event_Data;                                        // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentEventIndex;                                 // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Seconds;                                     // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastLocation;                                      // 0x0318(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADebugBall_C*                           DemoBall;                                          // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SavedAngularVelocity;                              // 0x0330(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SavedLinearVelocity;                               // 0x033C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 DemoName;                                          // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          NextHitIsBallHit;                                  // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Freecam;                                           // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35A[0x2];                                      // 0x035A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SavedTargetArmLength;                              // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartTime;                                         // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultSpeed;                                      // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultAcceleration;                               // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultDeceleration;                               // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultTurningBoost;                               // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, float>                            HoleTimes;                                         // 0x0378(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 Strokes;                                           // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         TotalStrokes;                                      // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetStrokes();
	void Hide_Widget_Used();
	void Demo_Timeline_Clicked(float ClickValue);
	void ReturnToPhysical();
	void MakeArrowVisible();
	void ChangeFreeCamModes(bool Param_Freecam);
	void UpdateSpeedX(const class FString& NewSpeed);
	void ResetToSpawn();
	void SpawnGoalEffect(int32 HoleNumberr);
	void StartObjectSyncForHole(int32 Hole);
	void InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_8(const struct FKey& Key);
	void InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_7(const struct FKey& Key);
	void InpActEvt_One_K2Node_InputKeyEvent_6(const struct FKey& Key);
	void InpActEvt_Two_K2Node_InputKeyEvent_5(const struct FKey& Key);
	void InpActEvt_Three_K2Node_InputKeyEvent_4(const struct FKey& Key);
	void InpActEvt_Four_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_P_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_Zero_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_Editor_FreeMouse_K2Node_InputActionEvent_0(const struct FKey& Key);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveDestroyed();
	void InpAxisEvt_Backwards_K2Node_InputAxisEvent_22(float AxisValue);
	void InpAxisEvt_Down_K2Node_InputAxisEvent_63(float AxisValue);
	void InpAxisEvt_Up_K2Node_InputAxisEvent_46(float AxisValue);
	void InpAxisEvt_Forward_K2Node_InputAxisEvent_20(float AxisValue);
	void InpAxisEvt_Left_K2Node_InputAxisEvent_0(float AxisValue);
	void InpAxisEvt_Right_K2Node_InputAxisEvent_1(float AxisValue);
	void EscapeUsed();
	void PauseMenuClosed();
	void TimelineClicked(float ClickValue);
	void OpenScoreboard();
	void DemoUIIconPressed(float Time);
	void PlaySpeed_1();
	void PlaySpeed_2();
	void PlaySpeed_5();
	void Pause();
	void ExecuteUbergraph_DemoSpectator(int32 EntryPoint);
	void PlaySpeed_SloMo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DemoSpectator_C">();
	}
	static class ADemoSpectator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADemoSpectator_C>();
	}
};

}

