#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: Demo_IngameUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GolfIt_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Demo_IngameUI.Demo_IngameUI_C
// 0x00A0 (0x03D8 - 0x0338)
class UDemo_IngameUI_C final : public UGolfItActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               EventOverlay;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Options;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Speed;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Timeline;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TimelineClickZone;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Icon_Only_C*                 WB_Button_Collapse;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Icon_Only_C*                 WB_Button_Icon_Play;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Icon_Only_C*                 WB_Button_Icon_Play_2;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Icon_Only_C*                 WB_Button_Icon_Play_5;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Icon_Only_C*                 WB_Button_Icon_SlowMo;                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Icon_Only_C*                 WB_Button_Pause;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           WB_SettingsEntry_Arrow;                            // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           WB_SettingsEntry_Holes;                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           WB_SettingsEntry_Resets;                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           WB_SettingsEntry_Shots;                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           WB_SettingsEntry_Start;                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           WB_SettingsEntry_Trail;                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             TimelineClicked;                                   // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	struct FEventReply On_TimelineClickZone_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BndEvt__Demo_IngameUI_WB_SettingsEntry_Shots_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__Demo_IngameUI_WB_SettingsEntry_Resets_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__Demo_IngameUI_WB_SettingsEntry_Holes_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__Demo_IngameUI_WB_SettingsEntry_Trail_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__Demo_IngameUI_WB_SettingsEntry_Start_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__Demo_IngameUI_WB_Button_Collapse_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Demo_IngameUI_WB_Button_Icon_SlowMo_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Demo_IngameUI_WB_Button_Icon_Play_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Demo_IngameUI_WB_Button_Icon_Play_2_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Demo_IngameUI_WB_Button_Icon_Play_5_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Demo_IngameUI_WB_Button_Pause_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Demo_IngameUI_WB_SettingsEntry_Trail_1_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature(bool Value);
	void ExecuteUbergraph_Demo_IngameUI(int32 EntryPoint);
	void TimelineClicked__DelegateSignature(float ClickValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Demo_IngameUI_C">();
	}
	static class UDemo_IngameUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemo_IngameUI_C>();
	}
};

}

