#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: Demo_Simple

#include "Basic.hpp"

#include "GolfIt_structs.hpp"
#include "S_DemoSimpleData_structs.hpp"
#include "S_DemoEventData_structs.hpp"
#include "GolfItSteam_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Demo_Simple.Demo_Simple_C
// 0x0040 (0x0068 - 0x0028)
class UDemo_Simple_C final : public USaveGame
{
public:
	TArray<struct FS_DemoSimpleData>              DemoData;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_DemoEventData>               EventData;                                         // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	EGolfItMapType                                MapType;                                           // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MapHandle;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSteamWorkshopItemHandle               SteamWorkshopItemHandle;                           // 0x0060(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Demo_Simple_C">();
	}
	static class UDemo_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemo_Simple_C>();
	}
};

}

