#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: DynamicMesh

#include "Basic.hpp"

#include "ProceduralMeshComponent_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DynamicMeshData_structs.hpp"
#include "RuntimeMeshComponent_structs.hpp"
#include "ImportedObjectStruct_structs.hpp"
#include "DynamicMeshDataMain_structs.hpp"
#include "ImporterTangentStruct_structs.hpp"
#include "ByteMeshStruct_structs.hpp"
#include "CustomAssetSettings_structs.hpp"
#include "ByteStruct_structs.hpp"
#include "GolfIt_structs.hpp"
#include "A_DynamicMeshBase_classes.hpp"
#include "ModifyEnum_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DynamicMesh.DynamicMesh_C
// 0x0BF8 (0x0E28 - 0x0230)
class ADynamicMesh_C final : public AA_DynamicMeshBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   TestStaticMesh;                                    // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URuntimeMeshComponentStatic*            RuntimeMesh;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Tris;                                              // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        Verts;                                             // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        Normals;                                           // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      UVs;                                               // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 TrisCord;                                          // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 TrisNorm;                                          // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Render;                                            // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 UsedVerts;                                         // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        DoubleVerts;                                       // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Additions;                                         // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 NewTris;                                           // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      NewCords;                                          // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        NewNorm;                                           // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Dir;                                               // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material;                                          // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlwaysActive;                                      // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Tris3;                                             // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstance*                      Material2;                                         // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 MaterialLength;                                    // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         MaterialNames;                                     // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        DoubleVerts2;                                      // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 NewTris2;                                          // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      NewCords2;                                         // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        NewNorm2;                                          // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        DoubleVerts1;                                      // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        NewNorm1;                                          // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 NewTris1;                                          // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      NewCords1;                                         // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        DoubleVerts3;                                      // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        DoubleVerts4;                                      // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        DoubleVerts5;                                      // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        DoubleVerts6;                                      // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        DoubleVerts7;                                      // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        DoubleVerts8;                                      // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 NewTris3;                                          // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 NewTris4;                                          // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 NewTris5;                                          // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 NewTris6;                                          // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 NewTris7;                                          // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 NewTris8;                                          // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      NewCords3;                                         // 0x04A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      NewCords4;                                         // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      NewCords5;                                         // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      NewCords6;                                         // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      NewCords7;                                         // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      NewCords8;                                         // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        NewNorm3;                                          // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        NewNorm4;                                          // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        NewNorm5;                                          // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        NewNorm6;                                          // 0x0538(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        NewNorm7;                                          // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        NewNorm8;                                          // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstance*                      Material3;                                         // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material4;                                         // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material5;                                         // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material6;                                         // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material7;                                         // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material8;                                         // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         FileData;                                          // 0x0598(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UsingBinary;                                       // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRuntimeMeshTangent>            NewTangent1;                                       // 0x05B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRuntimeMeshTangent>            NewTangent2;                                       // 0x05C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRuntimeMeshTangent>            NewTangent3;                                       // 0x05D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRuntimeMeshTangent>            NewTangent4;                                       // 0x05E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRuntimeMeshTangent>            NewTangent5;                                       // 0x05F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRuntimeMeshTangent>            NewTangent6;                                       // 0x0600(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRuntimeMeshTangent>            NewTangent7;                                       // 0x0610(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRuntimeMeshTangent>            NewTangent8;                                       // 0x0620(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         ObjLines;                                          // 0x0630(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureDiffuse1;                                   // 0x0640(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureDiffuse2;                                   // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureDiffuse3;                                   // 0x0660(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureDiffuse4;                                   // 0x0670(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureDiffuse5;                                   // 0x0680(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureDiffuse6;                                   // 0x0690(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureDiffuse7;                                   // 0x06A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureDiffuse8;                                   // 0x06B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureNormal1;                                    // 0x06C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureNormal2;                                    // 0x06D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureNormal3;                                    // 0x06E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureNormal4;                                    // 0x06F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureNormal5;                                    // 0x0700(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureNormal6;                                    // 0x0710(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureNormal7;                                    // 0x0720(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TextureNormal8;                                    // 0x0730(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  WorldAlign;                                        // 0x0740(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  UseNormal;                                         // 0x0750(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  UseAlpha;                                          // 0x0760(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  UseDefault;                                        // 0x0770(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         DefaultNames;                                      // 0x0780(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Playing;                                           // 0x0790(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_791[0x7];                                      // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UniqueName;                                        // 0x0798(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          AlreadyExist;                                      // 0x07A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         PhysicalMaterials;                                 // 0x07B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          MaterialLoaded;                                    // 0x07C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  HasCollision;                                      // 0x07C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Scale;                                             // 0x07D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UniqueSet;                                         // 0x07DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Loaded;                                            // 0x07DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DE[0x2];                                      // 0x07DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FImportedObjectStruct                  Struct;                                            // 0x07E0(0x02A0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FDynamicMeshDataMain                   DynamicMeshData;                                   // 0x0A80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FProcMeshTangent>               Tangents;                                          // 0x0A90(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRuntimeMeshTangent>            NewTangents;                                       // 0x0AA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRuntimeMeshTangent>            Tangents2;                                         // 0x0AB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FDynamicMeshData>               MeshData;                                          // 0x0AC0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CalculateTangent;                                  // 0x0AD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD1[0x7];                                      // 0x0AD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FImporterTangentStruct>         TangentArray;                                      // 0x0AD8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  FlipArray;                                         // 0x0AE8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Name_DynamicMesh_C;                                // 0x0AF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<bool>                                  Translucent;                                       // 0x0B08(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 TranslucentValue;                                  // 0x0B18(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  Emissive;                                          // 0x0B28(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 EmissiveValue;                                     // 0x0B38(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Found;                                             // 0x0B48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B49[0x7];                                      // 0x0B49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADynamicMesh_C*                         FoundActor;                                        // 0x0B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FByteMeshStruct>                ByteVector;                                        // 0x0B58(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MaterialCounterIndex;                              // 0x0B68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsingTexturePool;                                  // 0x0B6C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6D[0x3];                                      // 0x0B6D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 DiffuseTextureIDs;                                 // 0x0B70(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 NormalTextureIDs;                                  // 0x0B80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          FoundID;                                           // 0x0B90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B91[0x7];                                      // 0x0B91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 TempDiffuse;                                       // 0x0B98(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<uint8>                                 TempNormal;                                        // 0x0BA8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 HistoryName;                                       // 0x0BB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          UsingTextures;                                     // 0x0BC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC9[0x7];                                      // 0x0BC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             DiffuseRef;                                        // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             NormalRef;                                         // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  Roughness;                                         // 0x0BE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 RoughnessValue;                                    // 0x0BF0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  Metallic;                                          // 0x0C00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 MetallicValue;                                     // 0x0C10(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  Specular;                                          // 0x0C20(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 SpecularValue;                                     // 0x0C30(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 TextureScale;                                      // 0x0C40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 SpeedX;                                            // 0x0C50(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 SpeedY;                                            // 0x0C60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCustomAssetSettings                   SnapReference;                                     // 0x0C70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          SkippingTextures;                                  // 0x0C90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C91[0x7];                                      // 0x0C91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASimpleGizmos_C*                        TransformGizmo;                                    // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InTransformMode;                                   // 0x0CA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA1[0x7];                                      // 0x0CA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASimpleGizmos_C*                        GizmoTemp;                                         // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          World_;                                            // 0x0CB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HiddenGizmo_;                                      // 0x0CB1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB2[0x6];                                      // 0x0CB2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ActorOwner;                                        // 0x0CB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CurrentCollection;                                 // 0x0CC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          OutputVar;                                         // 0x0CD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD1[0x7];                                      // 0x0CD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 TrisLength;                                        // 0x0CD8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FByteStruct>                    Temp;                                              // 0x0CE8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          NeedsFixing;                                       // 0x0CF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CF9[0x7];                                      // 0x0CF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorkshopID                            WorkshopID;                                        // 0x0D00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RefreshWorkshopTimer;                              // 0x0D08(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         RefreshTimerAutoDestroy;                           // 0x0D10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D14[0x4];                                      // 0x0D14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   ErrorMesh;                                         // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeMeshRenderableMeshData         RenderableMeshData;                                // 0x0D20(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRuntimeMeshTangent>            TempTangentArray;                                  // 0x0DA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          WorkshopIDUnknown;                                 // 0x0DB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB1[0x3];                                      // 0x0DB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Cull;                                              // 0x0DB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             TangentsDone;                                      // 0x0DB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             BuildDone;                                         // 0x0DC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HasElementsWithNoCollision;                        // 0x0DD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD9[0x7];                                      // 0x0DD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             Editor_NoCollisionPlaytest;                        // 0x0DE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Editor_NoCollisionRevert;                          // 0x0DF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             GizmoChanged;                                      // 0x0E00(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGuid                                  Guid;                                              // 0x0E10(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGolfItCustomMeshSaveGame*              CustomMeshSave;                                    // 0x0E20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TangentsDone__DelegateSignature();
	void BuildDone__DelegateSignature();
	void Editor_NoCollisionPlaytest__DelegateSignature();
	void Editor_NoCollisionRevert__DelegateSignature();
	void GizmoChanged__DelegateSignature(class ASimpleGizmos_C* Gizmo);
	void ExecuteUbergraph_DynamicMesh(int32 EntryPoint);
	void LoadMesh(class UGolfItCustomMeshSaveGame* CustomMesh);
	void LoadExistingMesh(class ADynamicMesh_C* DynamicMesh);
	void InstalledWorkshopAndTryToSpawn();
	void FailedSubscriptionAskServerAgain();
	void RequestingUpdatesOnMeshSubscription();
	void SetDynamicMeshMaterial(int32 Param_Index, class UMaterialInterface* Param_Material);
	void StartPlay();
	void NoCollisionRevert();
	void NoCollisionPlaytest();
	void Rebuild();
