#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: DynamicLaneBP

#include "Basic.hpp"

#include "S_FullLaneComposition_structs.hpp"
#include "PackedMeshStruct_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DynamicSplineStruct_structs.hpp"
#include "E_Editor_Themes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DynamicLaneBP.DynamicLaneBP_C
// 0x0250 (0x0470 - 0x0220)
class ADynamicLaneBP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URuntimeMeshComponentStatic*            RMC_Static;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   VisibilityMesh;                                    // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   EndTangent2;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   EndTanget1;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StartTangent1;                                     // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StartTangent2;                                     // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   SplineMesh;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   EndHedra;                                          // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StartHedra;                                        // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         StartTangentDistance;                              // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndTangentDistance;                                // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartTangentRotation;                              // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASimplePlaceableDummy_C*>        Dummys;                                            // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          StopTick;                                          // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ActorScaleBegin;                                   // 0x0294(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ActorBeginTransform;                               // 0x02A0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_Editor_Themes                               Categorie;                                         // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             MaterialSaved;                                     // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          MaterialFound;                                     // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MeshFound;                                         // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Finished;                                          // 0x02EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EB[0x5];                                      // 0x02EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDynamicSplineStruct                   Struct;                                            // 0x02F0(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasBeenUpdatesOnce;                                // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Verts;                                             // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 Tris;                                              // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Done;                                              // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UniqueName;                                        // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FPackedMeshStruct>              MeshData;                                          // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FVector, struct FVector>          VertMap;                                           // 0x03E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ChangingStyle;                                     // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Cull;                                              // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        VertsSection;                                      // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLinearColor>                   VertexColors;                                      // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FS_FullLaneComposition                 LaneComposition;                                   // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RevertObjectMaterials();
	void PipeChange(class UStaticMeshComponent* MeshToChange);
	void WallChange(class UStaticMeshComponent* MeshToChange);
	void LaneChange(class UStaticMeshComponent* MeshToChange);
	void ChangeLaneMaterials(class UStaticMeshComponent* MeshToChange);
	void UserConstructionScript();
	void ReceiveTick(float DeltaSeconds);
	void UpdateTangents();
	void ShowObjects();
	void HideObjects();
	void SetCategorie(E_Editor_Themes NewCategorie, const struct FS_FullLaneComposition& Param_LaneComposition);
	void ReceiveDestroyed();
	void FromServerUpdatetoAll(const struct FDynamicSplineStruct& Struc);
	void ReceiveBeginPlay();
	void ServerUpdate(const struct FDynamicSplineStruct& Struc);
	void Playing();
	void UpdateCollisionMulticast();
	void SetStaticMeshAll(class UStaticMesh* Mesh);
	void SetStaticMesh(class UStaticMesh* Mesh);
	void UpdateCollision();
	void SetCategorieSingle(E_Editor_Themes NewCategorie, const struct FS_FullLaneComposition& Param_LaneComposition);
	void PlayingSingle();
	void SetOrGenerateName(const class FString& NewName, bool Generate);
	void ToAll(const struct FDynamicSplineStruct& Struc);
	void DestroyForAllClients();
	void CollisionUpdateAll();
	void SetDrawDistance();
	void Convert();
	void ExecuteUbergraph_DynamicLaneBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DynamicLaneBP_C">();
	}
	static class ADynamicLaneBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADynamicLaneBP_C>();
	}
};

}

