#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: EditorObjectStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct EditorObjectStruct.EditorObjectStruct
// 0x0028 (0x0028 - 0x0000)
struct FEditorObjectStruct final
{
public:
	float                                         Pitch_2_273D9A794949A550FE2E3DBEA382A657;          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw_4_7C7AF28C403F9889C52E29BE3A741387;            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Roll_6_340AEEAE4C3AACAD7A0E81852F74AD60;           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            StaticMesh_11_3A23B14044516EFB72D81280D31E1016;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HoleNumber_14_A607BFE947164D54369548A4AA61F61B;    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HolePar_16_B657130A4F1B46A2753F8FB4443FDDD8;       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Boost_19_4F40AC70486BFBCEF7CA4D8E4CA00010;         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

