#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: EditorTransformer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EventValues_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EventDefaults_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EditorTransformer.EditorTransformer_C
// 0x0180 (0x03A0 - 0x0220)
class AEditorTransformer_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   TransformMesh;                                     // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         StartDelay;                                        // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PauseDelay;                                        // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             StartLocalTransform;                               // 0x0240(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             EndLocalTransform;                                 // 0x0270(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	float                                         DurationForward;                                   // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DurationAlpha;                                     // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayedMovementtimer;                              // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FinishedDelay;                                     // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DurationBackward;                                  // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEasingFunc                                   EaseIn;                                            // 0x02B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEasingFunc                                   EaseOut;                                           // 0x02B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Restarting;                                        // 0x02B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B7[0x1];                                      // 0x02B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Hole;                                              // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Started;                                           // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UniqueId;                                          // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EventDefaults>                         EventTypeQue;                                      // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FEventValues>                   EventValuesQue;                                    // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentQueIndex;                                   // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Forward;                                           // 0x02EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AEditorWater_C*                         WaterRef;                                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Offset;                                            // 0x0300(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	float                                         Duration;                                          // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DurationDone;                                      // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TransformOrigin;                                   // 0x0340(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             TransformTarget;                                   // 0x0370(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_EditorTransformer(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void StartDurationTransform(float Param_Duration, const struct FTransform& TargetTransform);
	void CheckWater();
	void ContinueEvent();
	void NextEvent();
	void AddEvent(const struct FEventSingle& Event);
	void StopDynamicEvent();
	void ReStartDynamicEvent();
	void ReceiveDestroyed();
	void SetUniqueID(int32 Param_UniqueId);
	void StartFunction(int32 Param_Hole);
	void EndFunction(int32 Param_Hole);
	void DestroyAttachedComponent(class UActorComponent* ComponentToDestroy);
	void SetIntegerEventID(int32 Param_UniqueId);
	void StartAddRotation(const struct FRotatorStruct& RotationAdd, float Delay);
	void SetDefaults();
	void ResetToDefault();
	void SetNewTransformerSettings(const struct FEditorTransformStruct& NewSettings);
	void TransformActorInDuration(const struct FTransform& Target, float Tick);
	void StartEvent(EventDefaults EventDefaults, const struct FEventValues& EventValues, float* Delay);
	void CheckIfUniqueID(int32 UnqieID, bool* HasID);
	void GetUniqueID(int32* UniqeID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EditorTransformer_C">();
	}
	static class AEditorTransformer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEditorTransformer_C>();
	}
};

}

