#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: EventSingle

#include "Basic.hpp"

#include "EventValues_structs.hpp"
#include "EventDefaults_structs.hpp"


namespace SDK
{

// UserDefinedStruct EventSingle.EventSingle
// 0x0048 (0x0048 - 0x0000)
struct FEventSingle final
{
public:
	TArray<EventDefaults>                         EventType_15_8C681C514AC3E941C661398E4EB97898;     // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FEventValues>                   EventValues_16_B671B4974367935F781D569933618C94;   // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         UniqueID_6_E19EA18E4E14DF2BDBA6A1BC193DE3CE;       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ObjectName_19_4BCE751246EBD757DCDD45B9AC890976;    // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           ObjectTags_25_A20F049E413DAEA76793DDBCF1A364AE;    // 0x0038(0x0010)(Edit, BlueprintVisible)
};

}

