#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: EventInterface

#include "Basic.hpp"

#include "EventSingle_structs.hpp"
#include "RotatorStruct_structs.hpp"
#include "EventValues_structs.hpp"
#include "EventDefaults_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EventInterface.EventInterface_C.DestroyAttachedComponent
// 0x0008 (0x0008 - 0x0000)
struct EventInterface_C_DestroyAttachedComponent final
{
public:
	class UActorComponent*                        ComponentToDestroy;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EventInterface.EventInterface_C.SetIntegerEventID
// 0x0004 (0x0004 - 0x0000)
struct EventInterface_C_SetIntegerEventID final
{
public:
	int32                                         UniqueId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EventInterface.EventInterface_C.StartAddRotation
// 0x001C (0x001C - 0x0000)
struct EventInterface_C_StartAddRotation final
{
public:
	struct FRotatorStruct                         RotationAdd;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delay;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EventInterface.EventInterface_C.StartDurationTransform
// 0x0040 (0x0040 - 0x0000)
struct EventInterface_C_StartDurationTransform final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TargetTransform;                                   // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};

// Function EventInterface.EventInterface_C.StartEvent
// 0x01C0 (0x01C0 - 0x0000)
struct EventInterface_C_StartEvent final
{
public:
	EventDefaults                                 EventDefaults;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventValues                           EventValues;                                       // 0x0010(0x01A0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         Delay;                                             // 0x01B0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EventInterface.EventInterface_C.AddEvent
// 0x0048 (0x0048 - 0x0000)
struct EventInterface_C_AddEvent final
{
public:
	struct FEventSingle                           Event;                                             // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function EventInterface.EventInterface_C.CheckIfUniqueID
// 0x0008 (0x0008 - 0x0000)
struct EventInterface_C_CheckIfUniqueID final
{
public:
	int32                                         UnqieID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasID;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function EventInterface.EventInterface_C.GetUniqueID
// 0x0004 (0x0004 - 0x0000)
struct EventInterface_C_GetUniqueID final
{
public:
	int32                                         UniqeID;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

