#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: EventMaster

#include "Basic.hpp"

#include "EventSingle_structs.hpp"
#include "Enum_EventActivationType_structs.hpp"
#include "Enum_EventExecutionType_structs.hpp"
#include "Enum_EventObjectType_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct EventMaster.EventMaster
// 0x0050 (0x0050 - 0x0000)
struct FEventMaster final
{
public:
	TArray<struct FEventSingle>                   StartEvents_4_F9A0E14B4BA2DE0F12D1BEA5B37CA8F2;    // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FEventSingle>                   EndEvents_8_5C7BCF06473A1E98465442A6AB345FF0;      // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         UniqueID_12_FE8B13124A237065C2DF258CEEE138E7;      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OneTime_15_9A9350CC4913853D055FF78720B9ECF7;       // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UniqueForEachPlayer_18_A6B36F6441017BF653D804B4A446BB0C; // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Visibility_21_BD53EB424A189A531CF5889E2755E7D9;    // 0x0026(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ActiveFromStart_23_F02A4F0F4B21B755D22E8099FDC5F2FD; // 0x0027(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Autostart_27_A183C45E4587234FBB43649C949B6084;     // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Autoend_31_0CB8848D4147A224ECEAB7A66509C369;       // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_EventObjectType                          EventObjectType_34_DD1AAF554187E18ECA576EAC6BADF836; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_EventActivationType                      EventActivationType_37_BC15EEAB40C0324974AC77B538C11DCA; // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           ActivationKeys_44_15E0158E4DBB3E35219C3C82DD4B8F9B; // 0x0038(0x0010)(Edit, BlueprintVisible)
	Enum_EventExecutionType                       EventExecutionType_47_114DE10A46A6A18FC6A62FA0D93C1042; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

