#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: EventValues

#include "Basic.hpp"

#include "AudioSoundStruct_structs.hpp"
#include "Requirements_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FogSettings_structs.hpp"
#include "EditorTransformStruct_structs.hpp"
#include "RotatorStruct_structs.hpp"


namespace SDK
{

// UserDefinedStruct EventValues.EventValues
// 0x01A0 (0x01A0 - 0x0000)
struct FEventValues final
{
public:
	struct FVector                                Vectors_23_5DE6CC8345119484C595119625871CCE;       // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ints_24_A6CAB83E4F664695ADCF86BE9A1CCCB3;          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Floats_25_03EF4AA940A278334EDEC784BE10B59F;        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Bools_26_099854B046DD3D1C0097F09C35137A1E;         // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0xB];                                       // 0x0015(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transforms_27_7B75895B470072A5AF4E3C9B3292F98C;    // 0x0020(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class FString                                 Texts_28_BBEA7016456093CE020E22BE4AA0C6DF;         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_31_3F67689149DDF528D00CA880698AA00F;         // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotatorStruct                         RotatorSettings_36_B5C3CCCF4950263A1DEBDBA4784669F8; // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditorTransformStruct                 TransformerSettings_37_6B7DDE9649FDF7D851E17C9E34F01541; // 0x0090(0x0090)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAudioSoundStruct                      SoundSettings_40_BB55E5A448BD39FE0402C9A9DB034768; // 0x0120(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FFogSettings                           FogSettings_45_2EAEA4964D69CB4D6A2D038807954688;   // 0x0160(0x0024)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRequirements                          Requirements_48_A3CA39744EA8C4D04979CC8896AE5AA0;  // 0x0184(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           Text_52_8517FD2447E1CC64E20C28A35521B29C;          // 0x0190(0x0010)(Edit, BlueprintVisible)
};

}

