#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: EventTrigger

#include "Basic.hpp"

#include "EventMaster_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EventValues_structs.hpp"
#include "EventDefaults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RawByteStruct_structs.hpp"
#include "EventSingle_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EventTrigger.EventTrigger_C
// 0x0220 (0x0440 - 0x0220)
class AEventTrigger_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Capsule;                                           // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          OverlapCollision;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FEventMaster                           EventMasterArray;                                  // 0x0240(0x0050)(Edit, BlueprintVisible, Net, RepNotify, HasGetValueTypeHash)
	bool                                          DoneOnce;                                          // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DoneOnceEnd;                                       // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGolfBall_C*>                    AffectedGolfballs;                                 // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<EventDefaults>                         EventTypeQue;                                      // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FEventValues>                   EventValuesQue;                                    // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentQueIndex;                                   // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x02CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Visibility;                                        // 0x02CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OneTime;                                           // 0x02CE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CF[0x1];                                      // 0x02CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRawByteStruct>                 RawByteStruct;                                     // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Autostart;                                         // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeUntilDone;                                     // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TransformOrigin;                                   // 0x02F0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             TransformTarget;                                   // 0x0320(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FEventSingle                           TempCurrent;                                       // 0x0350(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FEventSingle                           TempBall;                                          // 0x0398(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          CalledOutside;                                     // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class AActor*>                    IDRefActor;                                        // 0x03E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 CurrentBall;                                       // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetUniqueID(int32* UniqeID);
	void CheckIfUniqueID(int32 UnqieID, bool* HasID);
	void StartEvent(EventDefaults EventDefaults, const struct FEventValues& EventValues, float* Delay);
	void CheckIfEventAndBallValid(class AActor* Actor, class UPrimitiveComponent* Component, bool* Valid);
	void TransformActorInDuration(const struct FTransform& Target, float Tick);
	void OnRep_EventMasterArray();
	void ShareEventWithParent();
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void ReStartDynamicEvent();
	void StopDynamicEvent();
	void ResetToDefault();
	void SetDefaults();
	void ContinueEvent();
	void StartAddRotation(const struct FRotatorStruct& RotationAdd, float Delay);
	void SetIntegerEventID(int32 UniqueId);
	void DestroyAttachedComponent(class UActorComponent* ComponentToDestroy);
	void BndEvt__OverlapCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__OverlapCollision_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ResetAllStatesToBeginning();
	void AddEvent(const struct FEventSingle& Event);
	void NextEvent();
	void StartFunction(int32 Hole);
	void StartDurationTransform(float Param_Duration, const struct FTransform& TargetTransform);
	void ReceiveTick(float DeltaSeconds);
	void StartAllEvents();
	void EndFunction(int32 Hole);
	void DoAllBeginEvents();
	void DoAllEndEvents();
	void BndEvt__EventTrigger_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__EventTrigger_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__EventTrigger_Capsule_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__EventTrigger_Capsule_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void DoAllEndEventsOberlap(class AActor* GolfballActor);
	void DoAllBeginEventsOverlap(class AActor* GolfballActor);
	void ExecuteUbergraph_EventTrigger(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventTrigger_C">();
	}
	static class AEventTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEventTrigger_C>();
	}
};

}

