#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: FlyTrapSettingsStruct

#include "Basic.hpp"

#include "AttackPattern_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FlyTrapSettingsStruct.FlyTrapSettingsStruct
// 0x0060 (0x0060 - 0x0000)
struct FFlyTrapSettingsStruct final
{
public:
	bool                                          ClientSided_1_DC375D75496537133BAB4FA5A3B25C69;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EAttackPattern                                AttackPattern_4_67475D1C422B1D17CBEE0591875D6EDA;  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinVelocity_7_3F1551494FA9F09717A78FBE114FF99C;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxVelocity_9_BF16FA5E4697B133BAF357A48C4DC1A5;    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinConeRadius_11_96BF7044425B8C00BBF15BA2ACDEF152; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxConeRadius_13_E66D06B74820E5BC1776648144317AD0; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotationTarget_18_843978C44BA5989CE375A3BA73CC9E16; // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             Transform_21_C788528A4993C5108322C9999A79A03B;     // 0x0020(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	float                                         IdleRotationSpeed_24_0A51D8C447B97FB45313F1A343AB1FB9; // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpitOutRotationSpeed_26_032FDFDE4ED8255E241058A338167F02; // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EatToSpitDelay_28_7C796B8C47C7F9A6FD0E6B946FA5C663; // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

