#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: FMODStudio

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FMODStudio_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class FMODStudio.FMODAmbientSound
// 0x0008 (0x0228 - 0x0220)
class AFMODAmbientSound final : public AActor
{
public:
	class UFMODAudioComponent*                    AudioComponent;                                    // 0x0220(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODAmbientSound">();
	}
	static class AFMODAmbientSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFMODAmbientSound>();
	}
};

// Class FMODStudio.FMODAnimNotifyPlay
// 0x0020 (0x0058 - 0x0038)
class UFMODAnimNotifyPlay final : public UAnimNotify
{
public:
	uint8                                         bFollow : 1;                                       // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AttachName;                                        // 0x0040(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODEvent*                             Event;                                             // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODAnimNotifyPlay">();
	}
	static class UFMODAnimNotifyPlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODAnimNotifyPlay>();
	}
};

// Class FMODStudio.FMODAsset
// 0x0010 (0x0038 - 0x0028)
class UFMODAsset : public UObject
{
public:
	struct FGuid                                  AssetGuid;                                         // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODAsset">();
	}
	static class UFMODAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODAsset>();
	}
};

// Class FMODStudio.FMODAudioComponent
// 0x0190 (0x0390 - 0x0200)
class UFMODAudioComponent final : public USceneComponent
{
public:
	class UFMODEvent*                             Event;                                             // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      ParameterCache;                                    // 0x0200(0x0050)(Edit, BlueprintVisible, SimpleDisplay, NativeAccessSpecifierPublic)
	class FString                                 ProgrammerSoundName;                               // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableTimelineCallbacks : 1;                      // 0x0260(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAutoDestroy : 1;                                  // 0x0260(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStopWhenOwnerDestroyed : 1;                       // 0x0260(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnEventStopped;                                    // 0x0268(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnSoundStopped;                                    // 0x0278(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnTimelineMarker;                                  // 0x0288(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnTimelineBeat;                                    // 0x0298(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FFMODAttenuationDetails                AttenuationDetails;                                // 0x02A8(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FFMODOcclusionDetails                  OcclusionDetails;                                  // 0x02B4(0x0003)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B7[0xD9];                                     // 0x02B7(0x00D9)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetParameter(class FName Param_Name);
	void GetParameterValue(class FName Param_Name, float* UserValue, float* FinalValue);
	float GetProperty(EFMODEventProperty Property);
	int32 GetTimelinePosition();
	bool IsPlaying();
	void KeyOff();
	void Play();
	void Release();
	void SetEvent(class UFMODEvent* NewEvent);
	void SetParameter(class FName Param_Name, float Value);
	void SetPaused(bool Paused);
	void SetPitch(float Pitch);
	void SetProgrammerSoundName(const class FString& Value);
	void SetProperty(EFMODEventProperty Property, float Value);
	void SetTimelinePosition(int32 Time);
	void SetVolume(float Volume);
	void Stop();

	int32 GetLength() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODAudioComponent">();
	}
	static class UFMODAudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODAudioComponent>();
	}
};

// Class FMODStudio.FMODBank
// 0x0000 (0x0038 - 0x0038)
class UFMODBank final : public UFMODAsset
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODBank">();
	}
	static class UFMODBank* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODBank>();
	}
};

// Class FMODStudio.FMODBankLookup
// 0x0038 (0x0060 - 0x0028)
class UFMODBankLookup final : public UObject
{
public:
	class UDataTable*                             DataTable;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MasterBankPath;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MasterAssetsBankPath;                              // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MasterStringsBankPath;                             // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODBankLookup">();
	}
	static class UFMODBankLookup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODBankLookup>();
	}
};

// Class FMODStudio.FMODBlueprintStatics
// 0x0000 (0x0028 - 0x0028)
class UFMODBlueprintStatics final : public UBlueprintFunctionLibrary
{
public:
	static void BusSetMute(class UFMODBus* Bus, bool bMute);
	static void BusSetPaused(class UFMODBus* Bus, bool bPaused);
	static void BusSetVolume(class UFMODBus* Bus, float Volume);
	static void BusStopAllEvents(class UFMODBus* Bus, EFMOD_STUDIO_STOP_MODE StopMode);
	static float EventInstanceGetParameter(const struct FFMODEventInstance& EventInstance, class FName Param_Name);
	static void EventInstanceGetParameterValue(const struct FFMODEventInstance& EventInstance, class FName Param_Name, float* UserValue, float* FinalValue);
	static bool EventInstanceIsValid(const struct FFMODEventInstance& EventInstance);
	static void EventInstanceKeyOff(const struct FFMODEventInstance& EventInstance);
	static void EventInstancePlay(const struct FFMODEventInstance& EventInstance);
	static void EventInstanceRelease(const struct FFMODEventInstance& EventInstance);
	static void EventInstanceSetParameter(const struct FFMODEventInstance& EventInstance, class FName Param_Name, float Value);
	static void EventInstanceSetPaused(const struct FFMODEventInstance& EventInstance, bool Paused);
	static void EventInstanceSetPitch(const struct FFMODEventInstance& EventInstance, float Pitch);
	static void EventInstanceSetProperty(const struct FFMODEventInstance& EventInstance, EFMODEventProperty Property, float Value);
	static void EventInstanceSetTransform(const struct FFMODEventInstance& EventInstance, const struct FTransform& Location);
	static void EventInstanceSetVolume(const struct FFMODEventInstance& EventInstance, float Volume);
	static void EventInstanceStop(const struct FFMODEventInstance& EventInstance, bool Release);
	static class UFMODAsset* FindAssetByName(const class FString& Param_Name);
	static class UFMODEvent* FindEventByName(const class FString& Param_Name);
	static TArray<struct FFMODEventInstance> FindEventInstances(class UObject* WorldContextObject, class UFMODEvent* Event);
	static float GetGlobalParameterByName(class FName Param_Name);
	static void GetGlobalParameterValueByName(class FName Param_Name, float* UserValue, float* FinalValue);
	static TArray<class FString> GetOutputDrivers();
	static bool IsBankLoaded(class UFMODBank* Bank);
	static void LoadBank(class UFMODBank* Bank, bool bBlocking, bool bLoadSampleData);
	static void LoadBankSampleData(class UFMODBank* Bank);
	static void LoadEventSampleData(class UObject* WorldContextObject, class UFMODEvent* Event);
	static void MixerResume();
	static void MixerSuspend();
	static struct FFMODEventInstance PlayEvent2D(class UObject* WorldContextObject, class UFMODEvent* Event, bool bAutoPlay);
	static struct FFMODEventInstance PlayEventAtLocation(class UObject* WorldContextObject, class UFMODEvent* Event, const struct FTransform& Location, bool bAutoPlay);
	static class UFMODAudioComponent* PlayEventAttached(class UFMODEvent* Event, class USceneComponent* AttachToComponent, class FName AttachPointName, const struct FVector& Location, EAttachLocation LocationType, bool bStopWhenAttachedToDestroyed, bool bAutoPlay, bool bAutoDestroy);
	static void SetGlobalParameterByName(class FName Param_Name, float Value);
	static void SetLocale(const class FString& Locale);
	static void SetOutputDriverByIndex(int32 NewDriverIndex);
	static void SetOutputDriverByName(const class FString& NewDriverName);
	static void UnloadBank(class UFMODBank* Bank);
	static void UnloadBankSampleData(class UFMODBank* Bank);
	static void UnloadEventSampleData(class UObject* WorldContextObject, class UFMODEvent* Event);
	static void VCASetVolume(class UFMODVCA* Vca, float Volume);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODBlueprintStatics">();
	}
	static class UFMODBlueprintStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODBlueprintStatics>();
	}
};

// Class FMODStudio.FMODBus
// 0x0000 (0x0038 - 0x0038)
class UFMODBus final : public UFMODAsset
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODBus">();
	}
	static class UFMODBus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODBus>();
	}
};

// Class FMODStudio.FMODEvent
// 0x0000 (0x0038 - 0x0038)
class UFMODEvent : public UFMODAsset
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODEvent">();
	}
	static class UFMODEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODEvent>();
	}
};

// Class FMODStudio.FMODEventControlSection
// 0x0098 (0x0180 - 0x00E8)
class UFMODEventControlSection final : public UMovieSceneSection
{
public:
	struct FFMODEventControlChannel               ControlKeys;                                       // 0x00E8(0x0098)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODEventControlSection">();
	}
	static class UFMODEventControlSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODEventControlSection>();
	}
};

// Class FMODStudio.FMODEventControlTrack
// 0x0018 (0x00A8 - 0x0090)
class UFMODEventControlTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             ControlSections;                                   // 0x0098(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODEventControlTrack">();
	}
	static class UFMODEventControlTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODEventControlTrack>();
	}
};

// Class FMODStudio.FMODEventParameterTrack
// 0x0018 (0x00A8 - 0x0090)
class UFMODEventParameterTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0098(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODEventParameterTrack">();
	}
	static class UFMODEventParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODEventParameterTrack>();
	}
};

// Class FMODStudio.FMODPort
// 0x0000 (0x0038 - 0x0038)
class UFMODPort final : public UFMODAsset
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODPort">();
	}
	static class UFMODPort* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODPort>();
	}
};

// Class FMODStudio.FMODSettings
// 0x0198 (0x01C0 - 0x0028)
class UFMODSettings final : public UObject
{
public:
	bool                                          bLoadAllBanks;                                     // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoadAllSampleData;                                // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLiveUpdate;                                 // 0x002A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableEditorLiveUpdate;                           // 0x002B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         BankOutputDirectory;                               // 0x0030(0x0010)(Edit, Config, NativeAccessSpecifierPublic)
	EFMODSpeakerMode                              OutputFormat;                                      // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMODOutput                                   OutputType;                                        // 0x0041(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFMODProjectLocale>             Locales;                                           // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bVol0Virtual;                                      // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Vol0VirtualLevel;                                  // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SampleRate;                                        // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchHardwareSampleRate;                          // 0x0064(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RealChannelCount;                                  // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalChannelCount;                                 // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DSPBufferLength;                                   // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DSPBufferCount;                                    // 0x0074(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FileBufferSize;                                    // 0x0078(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StudioUpdatePeriod;                                // 0x007C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InitialOutputDriverName;                           // 0x0080(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLockAllBuses;                                     // 0x0090(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomPoolSizes                       MemoryPoolSizes;                                   // 0x0094(0x0014)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         LiveUpdatePort;                                    // 0x00A8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EditorLiveUpdatePort;                              // 0x00AC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReloadBanksDelay;                                  // 0x00B0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAPIErrorLogging;                            // 0x00B4(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMemoryTracking;                             // 0x00B5(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         PluginFiles;                                       // 0x00B8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FString                                 ContentBrowserPrefix;                              // 0x00C8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ForcePlatformName;                                 // 0x00D8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MasterBankName;                                    // 0x00E8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkipLoadBankName;                                  // 0x00F8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StudioBankKey;                                     // 0x0108(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WavWriterPath;                                     // 0x0118(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMODLogging                                  LoggingLevel;                                      // 0x0128(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OcclusionParameter;                                // 0x0130(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AmbientVolumeParameter;                            // 0x0140(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AmbientLPFParameter;                               // 0x0150(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EFMODPlatforms, struct FFMODPlatformSettings> Platforms;                                         // 0x0160(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0[0x10];                                     // 0x01B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODSettings">();
	}
	static class UFMODSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODSettings>();
	}
};

// Class FMODStudio.FMODSnapshot
// 0x0000 (0x0038 - 0x0038)
class UFMODSnapshot final : public UFMODEvent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODSnapshot">();
	}
	static class UFMODSnapshot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODSnapshot>();
	}
};

// Class FMODStudio.FMODSnapshotReverb
// 0x0010 (0x0070 - 0x0060)
class UFMODSnapshotReverb final : public UReverbEffect
{
public:
	struct FGuid                                  AssetGuid;                                         // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODSnapshotReverb">();
	}
	static class UFMODSnapshotReverb* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODSnapshotReverb>();
	}
};

// Class FMODStudio.FMODVCA
// 0x0000 (0x0038 - 0x0038)
class UFMODVCA final : public UFMODAsset
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMODVCA">();
	}
	static class UFMODVCA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMODVCA>();
	}
};

}

