#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: FX_Struct

#include "Basic.hpp"

#include "S_ParticleParameter_structs.hpp"


namespace SDK
{

// UserDefinedStruct FX_Struct.FX_Struct
// 0x0070 (0x0070 - 0x0000)
struct FFX_Struct final
{
public:
	class UStaticMesh*                            Mesh_2_3FF9F8564E266EDE3BCD2A905D916C05;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UParticleSystem>         Particle_16_9A7D3B4548B1AD36292DDBA93587BC68;      // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         DrawDistance_8_4234624C48AFD411853BC78D978DB3D3;   // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          Niagara_17_608F67C3459185961C8B8794DF00B46A;       // 0x0038(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FS_ParticleParameter>           ParticleParameter_15_621CFB944A7F38F05DB6A88A23081DCE; // 0x0060(0x0010)(Edit, BlueprintVisible)
};

}

