#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: Goal_Mesh

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GolfIt_structs.hpp"
#include "GolfIt_classes.hpp"
#include "GolfItUtils_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Goal_Mesh.Goal_Mesh_C
// 0x0048 (0x02A0 - 0x0258)
class AGoal_Mesh_C : public AGolfItBaseGoal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      GoalEffect_Niagara;                                // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               GoalEffect_Cascade;                                // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GoalBar;                                           // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GoalNet;                                           // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFinished;                                        // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class AActor*                                 FinishingActor;                                    // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnFinished__DelegateSignature();
	void ExecuteUbergraph_Goal_Mesh(int32 EntryPoint);
	void BndEvt__Goal_Mesh_GoalNet_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnColorChanged();
	void BndEvt__Goal_Mesh_GoalNet_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetupMesh();
	void SetupGateWithBar();
	void SetupGateSolo();
	void SetupRingWithBar();
	void SetupRingSolo();
	void SetupGong();
	void PlayBallEnterHoleSound(const struct FVector& HitImpulse);
	void CheckIfHoleValid(class AGolfItGolfBallPawn* BallReference, bool* Finish, class AGolfItGolfBallPawn** FinishingBall);
	void PlayWrongHoleSound();
	void PlayFinishSound(int32 Strokes, int32 Par);
	void UpdateColors();
	void UpdateMeshCollisionOnGoalEntry(ECollisionEnabled NewType);
	void CheckActorAndTriggerFinish(class UObject* ActorHit, bool* Finished);
	void ChangeGoalCustomDepth(bool NewValue, int32 CurrentHoleNumber, class AGolfItLobbySettings* LobbySettings, bool* Completed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Goal_Mesh_C">();
	}
	static class AGoal_Mesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGoal_Mesh_C>();
	}
};

}

