#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: GolfItGameEvents

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GolfItGameEvents.GolfItGameEventsSubsystem.ExecuteEvent
// 0x0008 (0x0008 - 0x0000)
struct GolfItGameEventsSubsystem_ExecuteEvent final
{
public:
	struct FGameplayTag                           GameEventTag;                                      // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItGameEvents.GolfItGameEventsSubsystem.ExecuteEvents
// 0x0020 (0x0020 - 0x0000)
struct GolfItGameEventsSubsystem_ExecuteEvents final
{
public:
	struct FGameplayTagContainer                  GameEventTags;                                     // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
};

// DelegateFunction GolfItGameEvents.GolfItGameEventsSubsystem.OnGolfItGameEventExecuteSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GolfItGameEventsSubsystem_OnGolfItGameEventExecuteSignature__DelegateSignature final
{
public:
	struct FGameplayTag                           GameEventTag;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction GolfItGameEvents.GolfItGameEventsSubsystem.OnGolfItGameEventListenersSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GolfItGameEventsSubsystem_OnGolfItGameEventListenersSignature__DelegateSignature final
{
public:
	struct FGameplayTag                           GameEventTag;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItGameEvents.GolfItGameEventsSubsystem.RegisterEventListener
// 0x001C (0x001C - 0x0000)
struct GolfItGameEventsSubsystem_RegisterEventListener final
{
public:
	TDelegate<void(struct FGameplayTag& GameEventTag)> OnGameEvent;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GameEventTag;                                      // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IMMEDIATE;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FireSingleTime;                                    // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowDuplicates;                                   // 0x001A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItGameEvents.GolfItGameEventsSubsystem.RegisterEventsListener
// 0x0038 (0x0038 - 0x0000)
struct GolfItGameEventsSubsystem_RegisterEventsListener final
{
public:
	TDelegate<void(struct FGameplayTag& GameEventTag)> OnGameEvent;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  GameEventTags;                                     // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          IMMEDIATE;                                         // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowDuplicates;                                   // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItGameEvents.GolfItGameEventsSubsystem.UnregisterEventListenerByDelegate
// 0x0010 (0x0010 - 0x0000)
struct GolfItGameEventsSubsystem_UnregisterEventListenerByDelegate final
{
public:
	TDelegate<void(struct FGameplayTag& GameEventTag)> OnGameEvent;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};

// Function GolfItGameEvents.GolfItGameEventsSubsystem.UnregisterEventListenerFromEventByDelegate
// 0x0018 (0x0018 - 0x0000)
struct GolfItGameEventsSubsystem_UnregisterEventListenerFromEventByDelegate final
{
public:
	struct FGameplayTag                           GameEventTag;                                      // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(struct FGameplayTag& GameEventTag)> OnGameEvent;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};

// Function GolfItGameEvents.GolfItGameEventsSubsystem.UnregisterEventListenersByEventTag
// 0x0008 (0x0008 - 0x0000)
struct GolfItGameEventsSubsystem_UnregisterEventListenersByEventTag final
{
public:
	struct FGameplayTag                           GameEventTag;                                      // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

