#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: GolfItChallengeSystem

#include "Basic.hpp"

#include "GolfItChallengeSystem_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// DelegateFunction GolfItChallengeSystem.GolfItChallengeBase.OnChallengeProgressedDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct GolfItChallengeBase_OnChallengeProgressedDelegate__DelegateSignature final
{
public:
	class UGolfItChallengeBase*                   Challenge;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OldProgress;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewProgress;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OldForecast;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewForecast;                                       // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction GolfItChallengeSystem.GolfItChallengeBase.OnChallengeUpdatedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct GolfItChallengeBase_OnChallengeUpdatedDelegate__DelegateSignature final
{
public:
	class UGolfItChallengeBase*                   Challenge;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallengeState                               OldState;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallengeState                               NewState;                                          // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItChallengeSystem.GolfItChallengeBase.GetChallengeState
// 0x0001 (0x0001 - 0x0000)
struct GolfItChallengeBase_GetChallengeState final
{
public:
	EChallengeState                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeBase.GetCurProgress
// 0x0004 (0x0004 - 0x0000)
struct GolfItChallengeBase_GetCurProgress final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeBase.GetDescription
// 0x0018 (0x0018 - 0x0000)
struct GolfItChallengeBase_GetDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeBase.GetDescriptionTemplate
// 0x0018 (0x0018 - 0x0000)
struct GolfItChallengeBase_GetDescriptionTemplate final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeBase.GetForecastProgress
// 0x0004 (0x0004 - 0x0000)
struct GolfItChallengeBase_GetForecastProgress final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeBase.GetMaxProgress
// 0x0004 (0x0004 - 0x0000)
struct GolfItChallengeBase_GetMaxProgress final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeBase.GetMaxProgressInfoStringForExport
// 0x0010 (0x0010 - 0x0000)
struct GolfItChallengeBase_GetMaxProgressInfoStringForExport final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeBase.GetMinProgress
// 0x0004 (0x0004 - 0x0000)
struct GolfItChallengeBase_GetMinProgress final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeBase.GetParameterStringForExport
// 0x0018 (0x0018 - 0x0000)
struct GolfItChallengeBase_GetParameterStringForExport final
{
public:
	struct FGolfItChallengeDifficultySelection    Difficulties;                                      // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeBase.GetProgressType
// 0x0001 (0x0001 - 0x0000)
struct GolfItChallengeBase_GetProgressType final
{
public:
	EChallengeProgressType                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeBase.IsProgressComplete
// 0x0001 (0x0001 - 0x0000)
struct GolfItChallengeBase_IsProgressComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeDataAssetBase.GetPrimaryChallenge
// 0x0008 (0x0008 - 0x0000)
struct GolfItChallengeDataAssetBase_GetPrimaryChallenge final
{
public:
	class UGolfItPrimaryChallengeBase*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeDataAssetBase.GetRewardExportString
// 0x0010 (0x0010 - 0x0000)
struct GolfItChallengeDataAssetBase_GetRewardExportString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeDataAssetBase.GetSecondaryChallenges
// 0x0010 (0x0010 - 0x0000)
struct GolfItChallengeDataAssetBase_GetSecondaryChallenges final
{
public:
	TArray<class UGolfItSecondaryChallengeBase*>  ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeDataAssetBase.GetSecondsUntilExpiration
// 0x0004 (0x0004 - 0x0000)
struct GolfItChallengeDataAssetBase_GetSecondsUntilExpiration final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItChallengeSubsystem.CreateTestChallenge
// 0x0010 (0x0010 - 0x0000)
struct GolfItChallengeSubsystem_CreateTestChallenge final
{
public:
	class UGolfItChallengeDataAssetBase*          DataAsset;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDifficulty                                   Difficulty;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItChallengeSystem.GolfItChallengeSubsystem.GetDataAssetByPrimaryChallenge
// 0x0010 (0x0010 - 0x0000)
struct GolfItChallengeSubsystem_GetDataAssetByPrimaryChallenge final
{
public:
	class UGolfItPrimaryChallengeBase*            PrimaryChallenge;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGolfItChallengeDataAssetBase*          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItPrimaryChallengeBase.OnGameEvent
// 0x0008 (0x0008 - 0x0000)
struct GolfItPrimaryChallengeBase_OnGameEvent final
{
public:
	struct FGameplayTag                           GameEventTag;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItPrimaryChallengeBase.OnSecondaryChallengeUpdated
// 0x0010 (0x0010 - 0x0000)
struct GolfItPrimaryChallengeBase_OnSecondaryChallengeUpdated final
{
public:
	class UGolfItChallengeBase*                   SecondaryChallenge;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallengeState                               OldState;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallengeState                               NewState;                                          // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItChallengeSystem.GolfItPrimaryChallengeBase.GetNumRewardCoins
// 0x0004 (0x0004 - 0x0000)
struct GolfItPrimaryChallengeBase_GetNumRewardCoins final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItChallengeSystem.GolfItSecondaryChallengeWithSettingBase.SettingsComplyWithChallenge
// 0x0001 (0x0001 - 0x0000)
struct GolfItSecondaryChallengeWithSettingBase_SettingsComplyWithChallenge final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

