#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: GolfItKaren

#include "Basic.hpp"

#include "GolfItKaren_structs.hpp"


namespace SDK::Params
{

// DelegateFunction GolfItKaren.GolfItKarenSubsystem.OnChallengesAPIStateRetrieved__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct GolfItKarenSubsystem_OnChallengesAPIStateRetrieved__DelegateSignature final
{
public:
	EChallengesAPIState                           APIState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction GolfItKaren.GolfItKarenSubsystem.OnRetryRewardGrantRetrieved__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GolfItKarenSubsystem_OnRetryRewardGrantRetrieved__DelegateSignature final
{
public:
	int32                                         NumToRetry;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumGranted;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItKaren.GolfItKarenSubsystem.RequestChallengesAPIState
// 0x0014 (0x0014 - 0x0000)
struct GolfItKarenSubsystem_RequestChallengesAPIState final
{
public:
	TDelegate<void(EChallengesAPIState APIState)> OnChallengesAPIStateRetrieved;                     // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItKaren.GolfItKarenSubsystem.RequestRetryRewardGrant
// 0x0014 (0x0014 - 0x0000)
struct GolfItKarenSubsystem_RequestRetryRewardGrant final
{
public:
	TDelegate<void(int32 NumToRetry, int32 NumGranted)> OnRetryRewardGrantRetrieved;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

