#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: GolfIt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GolfIt_structs.hpp"
#include "GolfItSteam_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SlateCore_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "GolfItUtils_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CommonInput_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "UMG_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "LuaMachine_structs.hpp"
#include "LuaMachine_classes.hpp"
#include "Voxel_structs.hpp"
#include "Voxel_classes.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK
{

// Class GolfIt.GolfItEditor2Action
// 0x0060 (0x0088 - 0x0028)
class UGolfItEditor2Action : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EEditor2ActionType                            MType;                                             // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUndoable;                                         // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEditor2Mode                                  MEditorMode;                                       // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldUpdateEditorMode;                           // 0x0033(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MActionMessage;                                    // 0x0038(0x0018)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bChainedToPreviousEditorAction;                    // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bChainedToNextEditorAction;                        // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSetUp;                                          // 0x0052(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MIndex;                                            // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnDo_Delegate;                                     // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnUndo_Delegate;                                   // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnRedo_Delegate;                                   // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)

public:
	static class UGolfItEditor2Action* CreateEditorAction(class UObject* WorldContextObject, EEditor2ActionType Type);

	bool Do();
	class AGolfItEditor2ObjectManager* GetObjectManager();
	void OnDone();
	void OnRedone();
	void OnUndone();
	bool Redo();
	bool Undo();

	class FText GetActionMessage() const;
	EEditor2Mode GetEditorMode() const;
	bool ShouldUpdateEditorMode() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2Action">();
	}
	static class UGolfItEditor2Action* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItEditor2Action>();
	}
};

// Class GolfIt.GolfItEditor2AddFoliage
// 0x0018 (0x00A0 - 0x0088)
class UGolfItEditor2AddFoliage final : public UGolfItEditor2Action
{
public:
	int32                                         MPlayerId;                                         // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEditor2FoliageData>            MInstances;                                        // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static void CreateAddFoliageAction(EEditor2CreateEditorActionOutputPins* OutputPin, class UGolfItEditor2AddFoliage** EditorActionObject, class UObject* WorldContextObject, const TArray<struct FEditor2FoliageData>& AddedInstances);

	bool Setup(const TArray<struct FEditor2FoliageData>& AddedInstances);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2AddFoliage">();
	}
	static class UGolfItEditor2AddFoliage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItEditor2AddFoliage>();
	}
};

// Class GolfIt.PreviewPictureLoader
// 0x0030 (0x0060 - 0x0030)
class UPreviewPictureLoader final : public UBlueprintAsyncActionBase
{
public:
	class UObject*                                MContextObject;                                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             MOnDone;                                           // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class UPreviewPictureLoader* AsyncLoadAvatarPictureFromPlayerState(class UObject* WorldContextObject, class APlayerState* PlayerState);
	static class UPreviewPictureLoader* AsyncLoadAvatarPictureFromSteamFriend(class UObject* WorldContextObject, const struct FSteamFriend& SteamFriend);
	static class UPreviewPictureLoader* AsyncLoadPictureFromBinaryData(class UObject* WorldContextObject, const TArray<uint8>& BinaryData);
	static class UPreviewPictureLoader* AsyncLoadPreviewPictureFromCustomItemDesc(class UObject* WorldContextObject, class ULocalCustomItemDesc* CustomItemDesc);
	static class UPreviewPictureLoader* AsyncLoadPreviewPictureFromMapInfo(class UObject* WorldContextObject, class UGolfItBaseMapInfo* MapInfo);

	void DoneDelegate__DelegateSignature(class UObject* Context, class UTexture2D* PreviewPicture);

	bool MatchesSteamFriend(const struct FSteamFriend& SteamFriend) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PreviewPictureLoader">();
	}
	static class UPreviewPictureLoader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPreviewPictureLoader>();
	}
};

// Class GolfIt.AsyncSaveGameAction
// 0x0028 (0x0058 - 0x0030)
class UAsyncSaveGameAction final : public UBlueprintAsyncActionBase
{
public:
	class UObject*                                MContextObject;                                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USaveGame*                              MSaveGame;                                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             MOnDone;                                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class UAsyncSaveGameAction* AsyncLoadIfMissingCustomItemDesc(class UObject* WorldContextObject, class ULocalCustomItemDesc* CustomItemDesc);
	static class UAsyncSaveGameAction* AsyncLoadIfMissingMapInfo(class UObject* WorldContextObject, class UGolfItCustomMapInfo* CustomMapInfo);
	static class UAsyncSaveGameAction* AsyncLoadSaveGameFromCustomItemDesc(class UObject* WorldContextObject, class ULocalCustomItemDesc* CustomItemDesc);
	static class UAsyncSaveGameAction* AsyncLoadSaveGameFromMapInfo(class UObject* WorldContextObject, class UGolfItCustomMapInfo* CustomMapInfo);
	static class UAsyncSaveGameAction* AsyncSaveSaveGameOfCustomItemDesc(class UObject* WorldContextObject, class USaveGame* SaveGame, class ULocalCustomItemDesc* CustomItemDesc);
	static class UAsyncSaveGameAction* AsyncSaveSaveGameOfMapInfo(class UObject* WorldContextObject, class UGolfItCustomMapSaveGame* SaveGame, class UGolfItCustomMapInfo* CustomMapInfo, bool UpdateVersionCounter);

	void DoneDelegate__DelegateSignature(class UObject* Context, class USaveGame* SaveGame);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncSaveGameAction">();
	}
	static class UAsyncSaveGameAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncSaveGameAction>();
	}
};

// Class GolfIt.GolfItEditor2BillboardComponent
// 0x0010 (0x0470 - 0x0460)
class UGolfItEditor2BillboardComponent final : public UMaterialBillboardComponent
{
public:
	class UTexture*                               MTexture;                                          // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MIsHovered;                                        // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MIsSelected;                                       // 0x0469(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46A[0x2];                                      // 0x046A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MSelectedByPlayerId;                               // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetIsHovered(bool IsHovered);
	void SetIsSelected(bool IsSelected, int32 PlayerId);
	void Setup(class UTexture* Texture);
	void UpdateElements();

	void GetMaterials(TArray<class UMaterialInterface*>* OutMaterials, bool bGetDebugMaterials) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2BillboardComponent">();
	}
	static class UGolfItEditor2BillboardComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItEditor2BillboardComponent>();
	}
};

// Class GolfIt.CreateVoxelWorldAsync
// 0x00A0 (0x00D0 - 0x0030)
class UCreateVoxelWorldAsync final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             Finished;                                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             Failed;                                            // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x80];                                      // 0x0050(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCreateVoxelWorldAsync* CreateVoxelWorldAsync(const class UObject* WorldContextObject, const struct FVoxelWorldCreateInfo& OverrideParameters, TSubclassOf<class AGolfItEditor2VoxelWorld> VoxelWorldClass, bool UpdateWorldSettings, const struct FEditor2VoxelWorldSettings& WorldSettings);

	void CheckVoxelTerrainCreationState();
	void SpawnVoxelTerrainActor();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreateVoxelWorldAsync">();
	}
	static class UCreateVoxelWorldAsync* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreateVoxelWorldAsync>();
	}
};

// Class GolfIt.GolfItEditor2LuaFunctionObject
// 0x0048 (0x0070 - 0x0028)
class UGolfItEditor2LuaFunctionObject final : public UObject
{
public:
	struct FLuaValue                              LuaFunction;                                       // 0x0028(0x0040)(Edit, BlueprintVisible, ExposeOnSpawn, NativeAccessSpecifierPublic)
	EEditor2LuaFunctionType                       Type;                                              // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Interval;                                          // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void CallLuaFunction();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2LuaFunctionObject">();
	}
	static class UGolfItEditor2LuaFunctionObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItEditor2LuaFunctionObject>();
	}
};

// Class GolfIt.GolfItEditor2ObjectProperty
// 0x0060 (0x0088 - 0x0028)
class UGolfItEditor2ObjectProperty : public UObject
{
public:
	uint8                                         Pad_28[0x4];                                       // 0x0028(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PropertyName;                                      // 0x002C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ExposeOnSpawn, NativeAccessSpecifierPublic)
	bool                                          IsInCategory;                                      // 0x0050(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CategoryId;                                        // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasEyedropper;                                     // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AssociatedInstanceId;                              // 0x005C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            PropertyWidget;                                    // 0x0060(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnValueChangedDelegate;                            // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnEyedropperClickedDelegate;                       // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static bool DuplicateObjectProperty(class UObject* WorldContextObject, class UGolfItEditor2ObjectProperty* InProperty, class UGolfItEditor2ObjectProperty** OutProperty);

	void ForceInit();
	void OnEyedropperClicked();
	void OnObjectSelected();
	void SetAssociatedInstanceId(int32 InstanceID);

	void GetAllChildProperties(TArray<class UGolfItEditor2ObjectProperty*>* ChildProperties) const;
	int32 GetAssociatedInstanceId() const;
	void GetCurrentChildProperties(TArray<class UGolfItEditor2ObjectProperty*>* ChildProperties) const;
	bool GetHasChildProperties() const;
	struct FLuaValue GetLuaValue(TSubclassOf<class ULuaState> State) const;
	EEditor2VariableType GetType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2ObjectProperty">();
	}
	static class UGolfItEditor2ObjectProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItEditor2ObjectProperty>();
	}
};

// Class GolfIt.GolfItEditor2Boolean
// 0x0028 (0x00B0 - 0x0088)
class UGolfItEditor2Boolean final : public UGolfItEditor2ObjectProperty
{
public:
	bool                                          MValue;                                            // 0x0088(0x0001)(Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          MLastValue;                                        // 0x0089(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          MStartValue;                                       // 0x008A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGolfItEditor2ObjectProperty*>   MChildPropertiesTrue;                              // 0x0090(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ContainsInstancedReference, ExposeOnSpawn, NativeAccessSpecifierPublic)
	TArray<class UGolfItEditor2ObjectProperty*>   MChildPropertiesFalse;                             // 0x00A0(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ContainsInstancedReference, ExposeOnSpawn, NativeAccessSpecifierPublic)

public:
	void OnRep_Value();
	void SetValue(bool Value, bool IsEditorAction);

	bool GetLastValue() const;
	bool GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2Boolean">();
	}
	static class UGolfItEditor2Boolean* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItEditor2Boolean>();
	}
};

// Class GolfIt.WorkshopCustomItemDescLoader
// 0x0020 (0x0050 - 0x0030)
class UWorkshopCustomItemDescLoader final : public UBlueprintAsyncActionBase
{
public:
	class USteamUGCSubsystem*                     MUGCSubsystem;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             MOnDone;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class UWorkshopCustomItemDescLoader* LoadWorkshopCustomItems(class UObject* WorldContextObject, class USteamUGCSubsystem* UGCSubsystem, ECustomItemType Type);

	void DoneDelegate__DelegateSignature(const TArray<class UWorkshopCustomItemDesc*>& WorkshopCustomItemDescs);
	void OnLoadingComplete();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorkshopCustomItemDescLoader">();
	}
	static class UWorkshopCustomItemDescLoader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorkshopCustomItemDescLoader>();
	}
};

// Class GolfIt.GolfItEditor2Color
// 0x0038 (0x00C0 - 0x0088)
class UGolfItEditor2Color final : public UGolfItEditor2ObjectProperty
{
public:
	struct FLinearColor                           MValue;                                            // 0x0088(0x0010)(Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           MLastValue;                                        // 0x0098(0x0010)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           MStartValue;                                       // 0x00A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SupportTextEntry;                                  // 0x00B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_Value();
	void SetValue(const struct FLinearColor& Value, bool IsEditorAction);

	struct FLinearColor GetLastValue() const;
	struct FLinearColor GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2Color">();
	}
	static class UGolfItEditor2Color* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItEditor2Color>();
	}
};

// Class GolfIt.CustomItemBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UCustomItemBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void CreateNewCustomBlueprintDesc(class UObject* WorldContextObject, class ULocalCustomItemDesc** OutCustomItemDesc, class UGolfItBlueprintSaveGame** OutSaveGame, const class FString& Param_Name, TSubclassOf<class UGolfItBlueprintSaveGame> SaveGameClass);
	static void DeleteItemHandleFromWorkshop(const struct FSteamWorkshopItemHandle& WorkshopItemHandle);
	static void GetCustomItemsDescs(class UObject* WorldContextObject, ECustomItemType Type, TArray<class ULocalCustomItemDesc*>* OutCustomItemsDescs);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomItemBlueprintLibrary">();
	}
	static class UCustomItemBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomItemBlueprintLibrary>();
	}
};

// Class GolfIt.GolfItMapsSettings
// 0x0038 (0x0070 - 0x0038)
class UGolfItMapsSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class UTexture2D>              MDefaultPreviewPicture;                            // 0x0038(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FGolfItOfficalMapConfigEntry>   MOfficialMapsConfig;                               // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UGolfItMapsSettings* GetMapsSettings();

	void GetConfigEntryByMapInfo(struct FGolfItOfficalMapConfigEntry* OutEntry, const class UGolfItBaseMapInfo* MapInfo);

	class FName GetLeaderboardNameForOfficialMap(const class UGolfItOfficialMapInfo* OfficialMapInfo, EGolfItPlayMode PlayMode) const;
	void GetLeaderboardNamesForOfficialMap(TMap<EGolfItPlayMode, class FName>* OutNames, const class UGolfItOfficialMapInfo* OfficialMapInfo) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItMapsSettings">();
	}
	static class UGolfItMapsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItMapsSettings>();
	}
};

// Class GolfIt.GolfItEditor2CustomAssetSaveGame
// 0x0018 (0x0040 - 0x0028)
class UGolfItEditor2CustomAssetSaveGame : public USaveGame
{
public:
	class FName                                   RowName;                                           // 0x0028(0x0008)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CustomName;                                        // 0x0030(0x0010)(BlueprintVisible, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2CustomAssetSaveGame">();
	}
	static class UGolfItEditor2CustomAssetSaveGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItEditor2CustomAssetSaveGame>();
	}
};

// Class GolfIt.GolfItBasePawn
// 0x0000 (0x0280 - 0x0280)
class AGolfItBasePawn : public APawn
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItBasePawn">();
	}
	static class AGolfItBasePawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGolfItBasePawn>();
	}
};

// Class GolfIt.GolfItEditor2Pawn
// 0x00D0 (0x0350 - 0x0280)
class AGolfItEditor2Pawn final : public AGolfItBasePawn
{
public:
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentDeltaTime;                                  // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BlockInput;                                        // 0x028C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEditor2Mode                                  CurrentEditorMode;                                 // 0x028D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEditor2Mode                                  LastEditorMode;                                    // 0x028E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28F[0x1];                                      // 0x028F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              MouseAxisValue;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ObjectManager;                                     // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEditor2Category                              LastPlacedCategory;                                // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEditor2PlaceableObjectType                   LastPlacedObjectType;                              // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LastPlacedObjectRowName;                           // 0x02A4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LastPlacedCustomID;                                // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MultiselectionIsActive;                            // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          GroupSelectionIsActive;                            // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LaneSnappingPointsAreEnabled;                      // 0x02C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C3[0x1];                                      // 0x02C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             MTraceHitResult;                                   // 0x02C4(0x0088)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ProcessMovementInput();
	void UpdateSnappingPointVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2Pawn">();
	}
	static class AGolfItEditor2Pawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGolfItEditor2Pawn>();
	}
};

// Class GolfIt.LocalCustomItemDesc
// 0x0048 (0x0070 - 0x0028)
class ULocalCustomItemDesc : public UObject
{
public:
	class FName                                   MName;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECustomItemType                               MType;                                             // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MCreator;                                          // 0x0034(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamWorkshopItemHandle               MWorkshopItemHandle;                               // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x28];                                      // 0x0048(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString GetSaveGameFilePath() const;
	bool IsWorkshopItem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LocalCustomItemDesc">();
	}
	static class ULocalCustomItemDesc* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalCustomItemDesc>();
	}
};

// Class GolfIt.GolfItEditor2CustomAssetsSaveGame
// 0x0040 (0x0068 - 0x0028)
class UGolfItEditor2CustomAssetsSaveGame final : public USaveGame
{
public:
	TArray<class FString>                         ScriptTemplates;                                   // 0x0028(0x0010)(BlueprintVisible, Net, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Meshes;                                            // 0x0038(0x0010)(BlueprintVisible, Net, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Sounds;                                            // 0x0048(0x0010)(BlueprintVisible, Net, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Textures;                                          // 0x0058(0x0010)(BlueprintVisible, Net, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	TArray<class FString> GetCustomAssetIDsByType(EEditor2CustomUserAssetType CustomAssetType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2CustomAssetsSaveGame">();
	}
	static class UGolfItEditor2CustomAssetsSaveGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItEditor2CustomAssetsSaveGame>();
	}
};

// Class GolfIt.WorkshopCustomItemDesc
// 0x0030 (0x00A0 - 0x0070)
class UWorkshopCustomItemDesc final : public ULocalCustomItemDesc
{
public:
	class FText                                   MDescription;                                      // 0x0070(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, Protected, NativeAccessSpecifierProtected)
	EUGCItemVisibility                            MVisibility;                                       // 0x0088(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_89[0x17];                                      // 0x0089(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorkshopCustomItemDesc">();
	}
	static class UWorkshopCustomItemDesc* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorkshopCustomItemDesc>();
	}
};

// Class GolfIt.GolfItEditor2CustomScriptSG
// 0x0020 (0x0060 - 0x0040)
class UGolfItEditor2CustomScriptSG final : public UGolfItEditor2CustomAssetSaveGame
{
public:
	class FString                                 LuaCode;                                           // 0x0040(0x0010)(BlueprintVisible, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TemplateID;                                        // 0x0050(0x0010)(BlueprintVisible, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2CustomScriptSG">();
	}
	static class UGolfItEditor2CustomScriptSG* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItEditor2CustomScriptSG>();
	}
};

// Class GolfIt.GolfItEditor2PropertiesInterface
// 0x0000 (0x0028 - 0x0028)
class IGolfItEditor2PropertiesInterface final : public IInterface
{
public:
	void CreateObjectProperties(class AActor* Param_Outer, TArray<class UGolfItEditor2ObjectProperty*>* Properties, TArray<class FText>* Categories);
	void GetChildProperties(TArray<struct FEditor2ChildProperties>* ChildProperties);
	void GetPropertyButtons(class UGolfItEditor2ActionList** ActionList);
	void OnPropertyButtonPressed(int32 ButtonID);
	void OnPropertyValueChanged(class UGolfItEditor2ObjectProperty* ObjectPropertyRef, bool IsEditorAction);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2PropertiesInterface">();
	}
	static class IGolfItEditor2PropertiesInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGolfItEditor2PropertiesInterface>();
	}
};

// Class GolfIt.Editor2PawnInterface
// 0x0000 (0x0028 - 0x0028)
class IEditor2PawnInterface final : public IInterface
{
public:
	void Delete(bool Release);
	void GetGroupSelectionIsActive(bool* GroupSelectionIsActive);
	void GetTraceHitResult(struct FHitResult* TraceHitResult);
	void GetTraceImpactLocation(bool RelativeToImpactComponent, bool* IsValid, struct FVector* ImpactLocation);
	void Group(bool Release);
	bool InitLastObjectPlacing();
	bool InitObjectPlacing(EEditor2Category Category, EEditor2PlaceableObjectType ObjectType, class FName RowName, bool bHasCustomName, const class FString& CustomID);
	void RotatePreview(float Value);
	void ScalePreview(float Value);
	void Select(bool MultiSelect, bool Release);
	void SelectGroup(const class FString& GroupId);
	void SelectObjectInstance(const struct FEditor2PlaceableObjectInstance& ObjectInstance);
	void SetBlockInput(bool BlockInput);
	void SetCurrentTransformationMode(EEditor2TransformationType NewTransformationMode);
	void SetGroupSelectionIsActive(bool GroupSelectionIsActive);
	void SetMouseAxisValue(const struct FVector2D& MouseAxisValue);
	void SetMultiselectionIsActive(bool MultiselectionIsActive);
	void SetSnappingPointsAreEnabled(bool SnappingPointsAreEnabled);
	void StartEyedropper(class UGolfItEditor2ObjectProperty* ObjectProperty);
	void Ungroup(bool Release);
	void Unselect(bool Release);
	void UpdateCamLocation(const struct FEditor2CamInput& InputDirection);
	void UpdateCamRotation(const struct FVector2D& AxisValue);
	void UpdateFoliagePainterSettings(const struct FEditor2FoliagePainterSettings& NewSettings);
	void UpdateVoxelTerrainEditingSettings(float Radius, float Strength, bool SurfaceOnly, EEditor2VoxelTerrainModifier Modifier, bool TraceAll);
	void UpdateVoxelTerrainMode(EEditor2VoxelTerrainMode NewMode);
	void UpdateVoxelTerrainSurfacePainterSettings(float Radius, float Falloff, float Alpha, int32 MaterialID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Editor2PawnInterface">();
	}
	static class IEditor2PawnInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEditor2PawnInterface>();
	}
};

// Class GolfIt.GolfItEditor2DeleteObject
// 0x0050 (0x00D8 - 0x0088)
class UGolfItEditor2DeleteObject final : public UGolfItEditor2Action
{
public:
	TArray<struct FEditor2PlaceableObjectInstance> MObjectInstances;                                  // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     MTransforms;                                       // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           MRowNames;                                         // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EEditor2PlaceableObjectType>           MObjectTypes;                                      // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         MCustomIDs;                                        // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static void CreateDeleteAction(EEditor2CreateEditorActionOutputPins* OutputPin, class UGolfItEditor2DeleteObject** EditorActionObject, class UObject* WorldContextObject, const TArray<struct FEditor2PlaceableObjectInstance>& ObjectInstances);

	bool Setup(const TArray<struct FEditor2PlaceableObjectInstance>& ObjectInstances);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2DeleteObject">();
	}
	static class UGolfItEditor2DeleteObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItEditor2DeleteObject>();
	}
};

// Class GolfIt.ImportedSoundWave
// 0x0000 (0x03C0 - 0x03C0)
class UImportedSoundWave final : public USoundWaveProcedural
{
public:
	static class UImportedSoundWave* ImportSound(bool* Success, const class FString& FilePath, TArray<uint8>* RawData);
	static class UImportedSoundWave* PlayRawImportedSound(const TArray<uint8>& RawData);

	void SetCustomSoundClass(class USoundClass* NewSoundClass);
	void SetLooping(bool ShouldLoop);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImportedSoundWave">();
	}
	static class UImportedSoundWave* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImportedSoundWave>();
	}
};

// Class GolfIt.GolfItBaseMapInfo
// 0x0030 (0x0058 - 0x0028)
class UGolfItBaseMapInfo : public UObject
{
public:
	class FName                                   MPlayMapName;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   MEditorMapName;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   MDisplayName;                                      // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         MIsVRMap : 1;                                      // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         MIsDevMap : 1;                                     // 0x0050(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FName GetEditorMapName() const;
	class FString GetMapHandle() const;
	EGolfItMapType GetMapType() const;
	class FName GetPlayMapName() const;
	struct FSteamWorkshopItemHandle GetWorkshopItemHandle() const;
	bool IsLocalMap() const;
	bool IsOfficialMap() const;
	bool IsPlayMapValid() const;
	bool IsWorkshopMap() const;
	class FString ToString() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItBaseMapInfo">();
	}
	static class UGolfItBaseMapInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItBaseMapInfo>();
	}
};

// Class GolfIt.GolfItCustomMapInfo
// 0x0040 (0x0098 - 0x0058)
class UGolfItCustomMapInfo : public UGolfItBaseMapInfo
{
public:
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MCreatorName;                                      // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              MCreatedAt;                                        // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              MUpdatedAt;                                        // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGolfItWorkshopMapInfo*                 MCorrespondingWorkshopMap;                         // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSteamWorkshopItemHandle               MCorrespondingWorkshopMapHandle;                   // 0x0088(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreateNewPreviewPicture(bool Replace);
	void GetBackupMaps(TArray<class UGolfItBackupCustomMapInfo*>* OutBackupMaps);

	bool HasPreviewPictureFile() const;
	bool HasSaveGameInfoSet() const;
	bool HasValidSaveGame() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItCustomMapInfo">();
	}
	static class UGolfItCustomMapInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItCustomMapInfo>();
	}
};

// Class GolfIt.GolfItBackupCustomMapInfo
// 0x0008 (0x00A0 - 0x0098)
class UGolfItBackupCustomMapInfo final : public UGolfItCustomMapInfo
{
public:
	class UGolfItCustomMapInfo*                   MCorrespondingLocalCustomMap;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	struct FDateTime GetBackupDate() const;
	class FString GetBackupFileName() const;
	class FString GetBackupFilePath() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItBackupCustomMapInfo">();
	}
	static class UGolfItBackupCustomMapInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItBackupCustomMapInfo>();
	}
};

// Class GolfIt.GolfItEditor2EditScript
// 0x0038 (0x00C0 - 0x0088)
class UGolfItEditor2EditScript : public UGolfItEditor2Action
{
public:
	class FString                                 MCustomId;                                         // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEditor2CustomAssetDataLocation               MDataLocation;                                     // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MUpdatedCode;                                      // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MPreviousCode;                                     // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static void CreateEditScriptAction(EEditor2CreateEditorActionOutputPins* OutputPin, class UGolfItEditor2EditScript** EditorActionObject, class UObject* WorldContextObject, const class FString& CustomID, EEditor2CustomAssetDataLocation DataLocation, const class FString& UpdatedCode);

	bool Setup(const class FString& CustomID, const class FString& UpdatedCode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2EditScript">();
	}
	static class UGolfItEditor2EditScript* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItEditor2EditScript>();
	}
};

// Class GolfIt.GolfItEditor2ObjManagerInterface
// 0x0000 (0x0028 - 0x0028)
class IGolfItEditor2ObjManagerInterface final : public IInterface
{
public:
	bool AddCustomScriptTemplate(const struct FEditor2CustomAssetProperties& TemplateProperties, class FString* TemplateID);
	bool AddObjectToGroup(const class FString& GroupId, const struct FEditor2PlaceableObjectInstance& ObjectInstance);
	void AddProxy(class FName RowName, EEditor2PlaceableObjectType ObjectType, const class FString& CustomID, const struct FTransform& StartTransform, bool* Success, int32* ProxyId, class AGolfItEditor2PlaceableObject** ProxyActor);
	bool ApplyPendingScriptChanges();
	bool DeleteCustomScriptTemplate(EEditor2CustomAssetDataLocation DataLocation, const class FString& TemplateID);
	bool DeleteObject(const class FString& ObjectID, int32 InstanceID);
	bool DuplicateCustomScriptTemplate(const class FString& TemplateID, const class FString& CustomName, class FString* DuplicatedTemplateId);
	void FindObjectActor(const class FString& ObjectID, class AGolfItEditor2PlaceableObject** ObjectActor);
	void GetAllCustomAssetIDs(EEditor2CustomUserAssetType Type, EEditor2CustomAssetDataLocation DataLocation, TArray<class FString>* CustomAssetIDs);
	void GetAllPlacedInstances(TArray<struct FEditor2PlaceableObjectInstance>* ObjectInstances);
	void GetAllPlacedObjects(TArray<class AGolfItEditor2PlaceableObject*>* Objects);
	bool GetCustomLuaScriptCode(const class FString& CustomID, EEditor2CustomAssetDataLocation DataLocation, class FString* LuaCode);
	void GetCustomNameByID(EEditor2CustomUserAssetType Type, EEditor2CustomAssetDataLocation DataLocation, const class FString& CustomID, class FString* CustomName);
	void GetGizmoCurrentTransform(struct FTransform* CurrentTransform);
	void GetGizmoStartTransform(struct FTransform* StartTransform);
	void GetGizmoTransformSpace(bool* WorldSpace);
	void GetGroupedInstanceIdsByGroupId(const class FString& GroupId, TArray<struct FEditor2PlaceableObjectInstance>* ObjectInstanceIds);
	void GetGroups(TMap<class FString, struct FEditor2ObjectGroup>* Groups);
	void GetHoveredInstanceIds(TArray<struct FEditor2PlaceableObjectInstance>* HoveredInstanceIds);
	void GetMaxTransformFractionalDigits(int32* MaxTransformFractionalDigits);
	void GetProxies(TArray<class AGolfItEditor2PlaceableObject*>* ProxyActors);
	void GetProxy(int32 ProxyId, class AGolfItEditor2PlaceableObject** ProxyActor);
	void GetProxyCurrentTransform(struct FTransform* CurrentTransform);
	void GetScriptEditorID(EEditor2CustomAssetDataLocation* DataLocation, class FString* CustomID);
	void GetSnapValues(float* SnapDistance, float* SnapAngle);
	void HoverGizmoAxis(class UPrimitiveComponent* Component);
	void IsGizmoAxisSelected(bool* GizmoAxisIsSelected, TArray<EEditor2TransformationAxis>* SelectedAxis);
	bool IsProxyObjectVisible();
	bool OpenScriptEditor(EEditor2CustomAssetDataLocation DataLocation, const class FString& CustomID);
	bool PlaceObject(class FString* ObjectID, int32* InstanceID, struct FTransform* Transform, class FName* RowName, EEditor2PlaceableObjectType* ObjectType, bool* IsCustomAsset, class FString* CustomID);
	bool PlaceObjectAtLocation(class FString* ObjectID, int32* InstanceID, const struct FTransform& Transform, class FName RowName, EEditor2PlaceableObjectType ObjectType, bool IsCustomAsset, const class FString& CustomID, bool CalledByScript);
	bool PlaceObjectAtLocationWithID(class FString* ObjectID, int32 InstanceID, const struct FTransform& Transform, class FName RowName, EEditor2PlaceableObjectType ObjectType, bool IsCustomAsset, const class FString& CustomID, bool AddToSaveGame);
	void ProcessTransformInput(const struct FVector2D& MouseInput, const struct FVector& ImpactLocation);
	void ReleaseGizmoAxis();
	void RemoveAllProxies();
	bool RemoveObjectFromGroup(const class FString& GroupId, const struct FEditor2PlaceableObjectInstance& ObjectInstance);
	void RemoveProxy(int32 ProxyId);
	void SelectGizmoAxis(class UPrimitiveComponent* Component);
	void SetCurrentTransformationMode(EEditor2TransformationType NewTransformationMode);
	void SetGizmoTransform(const struct FTransform& NewTransform);
	void SetGizmoTransformSpace(bool WorldSpace);
	void SetHoveredObject(bool IsHovered, const class FString& HoveredObjectId);
	void SetSnapAngle(float SnapAngle);
	void SetSnapDistance(float SnapDistance);
	bool SpawnObjectByScript(class FString* ObjectID, int32* InstanceID, const struct FEditor2PlaceableObjectInstance& ScriptID, const struct FTransform& RelTransform, class FName RowName, EEditor2PlaceableObjectType ObjectType);
	void UnhoverGizmoAxis();
	bool UpdateCustomScriptTemplateName(const class FString& TemplateID, const class FString& NewName);
	void UpdateProxy(const struct FTransform& Transform);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2ObjManagerInterface">();
	}
	static class IGolfItEditor2ObjManagerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGolfItEditor2ObjManagerInterface>();
	}
};

// Class GolfIt.extracode
// 0x0000 (0x0028 - 0x0028)
class UExtracode final : public UBlueprintFunctionLibrary
{
public:
	static void Array_Sort(const TArray<int32>& TargetArray, bool bAscendingOrder, class FName VariableName);
	static void CalculateTangentsForMesh(const TArray<struct FVector>& Vertices, const TArray<int32>& Triangles, const TArray<struct FVector2D>& UVs, TArray<struct FVector>* Tang);
	static void ChangeLightDrawDistance(int32 DrawDistance, class ULocalLightComponent* Light);
	static class UNiagaraSystem* CreateCustomizerNiagaraAsset(class UObject* WorldContextObject, class UNiagaraSystem* NiagaraSystemAsset, bool Enabled);
	static bool DoesMaterialHaveParameter(class UMaterialInterface* Mat, class FName Parameter);
	static float GetBoundingSphere(class UPointLightComponent* Light);
	static bool GetFiles(TArray<class FString>* Files, const class FString& RootFolderFullPath, const class FString& Ext);
	static class FString GetFStringFromWorkshopID(const struct FWorkshopID& WorkshopID);
	static void GetInputKeys(TArray<struct FKey>* Keys, TArray<class FString>* KeyNames);
	static struct FRotator GetRotatorRelativeRotation(const struct FRotator& ParentRotation, const struct FRotator& ChildRotation);
	static bool GetStaticSwitchParameterValue(class UMaterialInterface* Mat, class FName Parameter);
	static void GetVertsFromSpline(class USplineMeshComponent* Spline, TArray<struct FVector>* Verts, TArray<struct FVector>* VertsOriginal);
	static float GetWorldGravity(const class UObject* WorldContextObject);
	static bool IsAffectedNiagaraSim(class UNiagaraSystem* NiagaraSystemAsset);
	static bool IsMaterialUsingTwoSidedFoliage(class UMaterialInstance* Material, int32* ShadingModel);
	static bool LoadStringArrayFromFile(TArray<class FString>* StringArray, int32* ArraySize, const class FString& FullFilePath, bool ExcludeEmptyLines);
	static void LogString(const class FString& Message);
	static void RemoveDelaysFromActor(class AActor* Actor);
	static bool SaveStringArrayToFile(const class FString& SaveDirectory, const class FString& Filename, const TArray<class FString>& SaveText, bool AllowOverWriting, bool AllowAppend);
	static void SetMaxSubstepDeltaTime(float NewTime);
	static void SetMinDrawDistance(class UPrimitiveComponent* Object, float Distance);
	static void SetSecondFogData(class UExponentialHeightFogComponent* FogComponent, float FogDensity, float HeightFalloff, float HeightOffset);
	static void SetWorkshopIDFromFString(struct FWorkshopID& WorkshopID, const class FString& Value);
	static bool SetWorldGravity(const class UObject* WorldContextObject, float Gravity);
	static void SortFloatArray(TArray<float>& FloatArray, TArray<float>* FloatArrayRef);
	static void SortIntArray(TArray<int32>& IntArray, TArray<int32>* IntArrayRef);
	static void String__ExplodeString(TArray<class FString>* OutputStrings, const class FString& InputString, const class FString& Separator, int32 Limit, bool bTrimElements);
	static void UpdatePhysicsSolver(class UStaticMeshComponent* Mesh, int32 PositionSolver, int32 VelocitiySolver, float CustomSleepThresholdMultiplier);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"extracode">();
	}
	static class UExtracode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExtracode>();
	}
};

// Class GolfIt.GolfItEditor2EditMapScript
// 0x0000 (0x00C0 - 0x00C0)
class UGolfItEditor2EditMapScript final : public UGolfItEditor2EditScript
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItEditor2EditMapScript">();
	}
	static class UGolfItEditor2EditMapScript* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItEditor2EditMapScript>();
	}
};

// Class GolfIt.GetEditorPlayerControllerAsync
// 0x0018 (0x0048 - 0x0030)
class UGetEditorPlayerControllerAsync final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             IsValid;                                           // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGetEditorPlayerControllerAsync* GetEditorPlayerControllerAsync(const class UObject* WorldContextObject);

	void TryToGetPlayerController();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GetEditorPlayerControllerAsync">();
	}
	static class UGetEditorPlayerControllerAsync* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGetEditorPlayerControllerAsync>();
	}
};

// Class GolfIt.GolfItEditor2SceneComponent
// 0x00D0 (0x0180 - 0x00B0)
#pragma pack(push, 0x1)
class alignas(0x10) UGolfItEditor2SceneComponent : public UActorComponent
{
public:
	bool                                          MIsProxyObject;                                    // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MDebugLocation;                                    // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MSpawnAlwaysSceneRootComponent;                    // 0x00B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MSpawnCollisionSphere;                             // 0x00B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
