#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: GolfItUtils

#include "Basic.hpp"

#include "GolfItUtils_structs.hpp"


namespace SDK::Params
{

// Function GolfItUtils.GolfItUtilityFunctions.BitMaskFromIdx
// 0x0008 (0x0008 - 0x0000)
struct GolfItUtilityFunctions_BitMaskFromIdx final
{
public:
	uint8                                         Param_Index;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItUtils.GolfItUtilityFunctions.IsEditorBuild
// 0x0001 (0x0001 - 0x0000)
struct GolfItUtilityFunctions_IsEditorBuild final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItUtils.GolfItUtilityFunctions.SwitchIsEditorBuild
// 0x0001 (0x0001 - 0x0000)
struct GolfItUtilityFunctions_SwitchIsEditorBuild final
{
public:
	EGenericBoolResult                            Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

