#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: GolfItLoadingScreen

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GolfItLoadingScreen.GolfItLoadingScreenInterface
// 0x0000 (0x0028 - 0x0028)
class IGolfItLoadingScreenInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItLoadingScreenInterface">();
	}
	static class IGolfItLoadingScreenInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGolfItLoadingScreenInterface>();
	}
};

// Class GolfItLoadingScreen.GolfItLoadingScreenSettings
// 0x0040 (0x0078 - 0x0038)
class UGolfItLoadingScreenSettings final : public UDeveloperSettings
{
public:
	struct FSoftClassPath                         MLoadingScreenWidget;                              // 0x0038(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MLoadingScreenZOrder;                              // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MHoldLoadingScreenAdditionalSecs;                  // 0x0054(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MDebugPrintOnTick;                                 // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        MVRLoadingTexture;                                 // 0x0060(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItLoadingScreenSettings">();
	}
	static class UGolfItLoadingScreenSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItLoadingScreenSettings>();
	}
};

// Class GolfItLoadingScreen.GolfItLoadingScreenManager
// 0x0068 (0x0098 - 0x0030)
class UGolfItLoadingScreenManager final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x68];                                      // 0x0030(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItLoadingScreenManager">();
	}
	static class UGolfItLoadingScreenManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItLoadingScreenManager>();
	}
};

}

