#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: GolfItDataHub

#include "Basic.hpp"

#include "GolfItDataHub_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GolfItSteam_structs.hpp"
#include "GolfItUtils_structs.hpp"


namespace SDK::Params
{

// Function GolfItDataHub.GolfItDataHubDataProvider.StoreData
// 0x0008 (0x0008 - 0x0000)
struct GolfItDataHubDataProvider_StoreData final
{
public:
	class UGolfItDataHubScope*                    Scope;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubFunctions.MakeDataHubHandle
// 0x0014 (0x0014 - 0x0000)
struct GolfItDataHubFunctions_MakeDataHubHandle final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataHubHandle                         ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubFunctions.MakeDataHubHandleWithIndex
// 0x0018 (0x0018 - 0x0000)
struct GolfItDataHubFunctions_MakeDataHubHandleWithIndex final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataHubHandle                         ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubFunctions.MakeDataHubHandleWithLocalPlayer
// 0x0014 (0x0014 - 0x0000)
struct GolfItDataHubFunctions_MakeDataHubHandleWithLocalPlayer final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataHubHandle                         ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubFunctions.MakeDataHubHandleWithPlayer
// 0x0020 (0x0020 - 0x0000)
struct GolfItDataHubFunctions_MakeDataHubHandleWithPlayer final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class APlayerState*                     PlayerState;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataHubHandle                         ReturnValue;                                       // 0x0010(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItDataHub.GolfItDataHubScope.ActivateDataHandle
// 0x0010 (0x0010 - 0x0000)
struct GolfItDataHubScope_ActivateDataHandle final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenericOperationResult                       ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItDataHub.GolfItDataHubScope.GetFloatArrayData
// 0x0028 (0x0028 - 0x0000)
struct GolfItDataHubScope_GetFloatArrayData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FloatArray;                                        // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EDataHubGetDataResult                         ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItDataHub.GolfItDataHubScope.GetFloatData
// 0x0014 (0x0014 - 0x0000)
struct GolfItDataHubScope_GetFloatData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutFloat;                                          // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataHubGetDataResult                         ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItDataHub.GolfItDataHubScope.GetGameplayTagData
// 0x0018 (0x0018 - 0x0000)
struct GolfItDataHubScope_GetGameplayTagData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           OutTag;                                            // 0x000C(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataHubGetDataResult                         ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItDataHub.GolfItDataHubScope.GetIntArrayData
// 0x0028 (0x0028 - 0x0000)
struct GolfItDataHubScope_GetIntArrayData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 IntArray;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EDataHubGetDataResult                         ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItDataHub.GolfItDataHubScope.GetIntData
// 0x0014 (0x0014 - 0x0000)
struct GolfItDataHubScope_GetIntData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutInt;                                            // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataHubGetDataResult                         ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItDataHub.GolfItDataHubScope.GetLongIntData
// 0x0020 (0x0020 - 0x0000)
struct GolfItDataHubScope_GetLongIntData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         OutInt;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataHubGetDataResult                         ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItDataHub.GolfItDataHubScope.GetNameData
// 0x0018 (0x0018 - 0x0000)
struct GolfItDataHubScope_GetNameData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutName;                                           // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataHubGetDataResult                         ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItDataHub.GolfItDataHubScope.GetWorkshopHandleData
// 0x0020 (0x0020 - 0x0000)
struct GolfItDataHubScope_GetWorkshopHandleData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamWorkshopItemHandle               OutWorkshopHandle;                                 // 0x0010(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataHubGetDataResult                         ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItDataHub.GolfItDataHubScope.OnScopeEndingEvent
// 0x0008 (0x0008 - 0x0000)
struct GolfItDataHubScope_OnScopeEndingEvent final
{
public:
	struct FGameplayTag                           GameEventTag;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubScope.RegisterDataProvider
// 0x0010 (0x0010 - 0x0000)
struct GolfItDataHubScope_RegisterDataProvider final
{
public:
	TScriptInterface<class IGolfItDataHubDataProvider> Provider;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubScope.StoreFloatArrayData
// 0x0020 (0x0020 - 0x0000)
struct GolfItDataHubScope_StoreFloatArrayData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Data;                                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubScope.StoreFloatData
// 0x0010 (0x0010 - 0x0000)
struct GolfItDataHubScope_StoreFloatData final
{
public:
	struct FDataHubHandle                         DataTag;                                           // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Data;                                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubScope.StoreGameplayTagData
// 0x0014 (0x0014 - 0x0000)
struct GolfItDataHubScope_StoreGameplayTagData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Data;                                              // 0x000C(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubScope.StoreIntArrayData
// 0x0020 (0x0020 - 0x0000)
struct GolfItDataHubScope_StoreIntArrayData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Data;                                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubScope.StoreIntData
// 0x0010 (0x0010 - 0x0000)
struct GolfItDataHubScope_StoreIntData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Data;                                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubScope.StoreLongIntData
// 0x0018 (0x0018 - 0x0000)
struct GolfItDataHubScope_StoreLongIntData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Data;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubScope.StoreNameData
// 0x0014 (0x0014 - 0x0000)
struct GolfItDataHubScope_StoreNameData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Data;                                              // 0x000C(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubScope.StoreWorkshopHandleData
// 0x0018 (0x0018 - 0x0000)
struct GolfItDataHubScope_StoreWorkshopHandleData final
{
public:
	struct FDataHubHandle                         DataHandle;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamWorkshopItemHandle               Data;                                              // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubScope.GetScopeTag
// 0x0008 (0x0008 - 0x0000)
struct GolfItDataHubScope_GetScopeTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItDataHub.GolfItDataHubSubsystem.GetScope
// 0x0018 (0x0018 - 0x0000)
struct GolfItDataHubSubsystem_GetScope final
{
public:
	EGenericOperationResult                       OutResult;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ScopeTag;                                          // 0x0004(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGolfItDataHubScope*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

