#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: GolfInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EditorPawnGlobalSettings_structs.hpp"
#include "GolfItUtils_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GolfInstance.GolfInstance_C
// 0x0068 (0x0210 - 0x01A8)
class UGolfInstance_C final : public UGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Kicked;                                            // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   KickedMessage;                                     // 0x01B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         LowestPoint;                                       // 0x01D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEditorPawnGlobalSettings              EditorPawnSettings;                                // 0x01D4(0x0003)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D7[0x1];                                      // 0x01D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             CheckLights;                                       // 0x01D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          EditorAllSpecialLoaded;                            // 0x01E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             EditorWaitingForHistoryChange;                     // 0x01F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             AddTextToEditorDisplay;                            // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CheckLights__DelegateSignature();
	void EditorWaitingForHistoryChange__DelegateSignature(class AActor* Actor);
	void AddTextToEditorDisplay__DelegateSignature(const class FString& Text, float Time, bool Important);
	void ExecuteUbergraph_GolfInstance(int32 EntryPoint);
	void SetLowestPoint(float NewLowestPoint);
	void SetKicked(bool NewVar, const class FText& Param_KickedMessage);
	void RestGolfInstance();
	void HandleNetworkError(ENetworkFailure FailureType, bool bIsServer);
	void HandleTravelError(ETravelFailure FailureType);
	void GetGolfInstanceReference(class UGolfInstance_C** Ref);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GolfInstance_C">();
	}
	static class UGolfInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfInstance_C>();
	}
};

}

