#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: GolfItSteam

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "GolfItSteam_structs.hpp"
#include "GolfItUtils_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GolfItSteam.GolfItInventoryItemDataAsset
// 0x0048 (0x0078 - 0x0030)
class UGolfItInventoryItemDataAsset : public UPrimaryDataAsset
{
public:
	int64                                         MSteamItemDefinitionID;                            // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int64                                         MSteamItemExchangeOverrideID;                      // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MScrapValueOverride;                               // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   MDisplayName;                                      // 0x0044(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         MIsDefaultItem : 1;                                // 0x004C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         MIsTestItem : 1;                                   // 0x004C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              MPreviewPicture;                                   // 0x0050(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	struct FSteamInventoryItemDefinitionHandle GetCoinGeneratorHandle() const;
	class FName GetDisplayName() const;
	struct FSteamInventoryItemDefinitionHandle GetItemDefinitionHandle() const;
	TSoftObjectPtr<class UTexture2D> GetPreviewPicture() const;
	ESteamInventoryItemRarity GetRarity() const;
	ESteamInventoryItemType GetType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItInventoryItemDataAsset">();
	}
	static class UGolfItInventoryItemDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItInventoryItemDataAsset>();
	}
};

// Class GolfItSteam.GolfItSkinDataAsset
// 0x0040 (0x00B8 - 0x0078)
class UGolfItSkinDataAsset : public UGolfItInventoryItemDataAsset
{
public:
	ESteamInventoryItemRarity                     MRarity;                                           // 0x0078(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               MRotation;                                         // 0x007C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         MAllowColorSettings : 1;                           // 0x0088(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      MMaterialInterface;                                // 0x0090(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItSkinDataAsset">();
	}
	static class UGolfItSkinDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItSkinDataAsset>();
	}
};

// Class GolfItSteam.ExternalUINode
// 0x0060 (0x0090 - 0x0030)
class UExternalUINode final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           MRequestor;                                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerState*                           MRequestee;                                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x28];                                      // 0x0048(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             MOnClosedDelegate;                                 // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             MOnFailedDelegate;                                 // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static bool OpenAchievementsOverlay();
	static class UExternalUINode* OpenProfileOverlay(class UObject* WorldContextObject, const class APlayerState* Requestor, const class APlayerState* Requestee);
	static void OpenSendFriendRequestOverlay(const class APlayerState* Requestee, EGenericOperationResult* Result);
	static class UExternalUINode* OpenStoreOverlay(class UObject* WorldContextObject, const class FString& ProductId);
	static class UExternalUINode* OpenWebOverlay(class UObject* WorldContextObject, const class FString& URL);
	static class UExternalUINode* OpenWorkshopLegalAgreement(class UObject* WorldContextObject);
	static class UExternalUINode* ShowFloatingGamepadTextInput(class UObject* WorldContextObject, ESteamGamepadTextInputMode Mode, const struct FIntPoint& UpperLeft, const struct FIntPoint& LowerRight);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExternalUINode">();
	}
	static class UExternalUINode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExternalUINode>();
	}
};

// Class GolfItSteam.GolfItHatDataAsset
// 0x0098 (0x0110 - 0x0078)
#pragma pack(push, 0x1)
class alignas(0x10) UGolfItHatDataAsset : public UGolfItInventoryItemDataAsset
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             MTransform;                                        // 0x0080(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	ESteamInventoryItemRarity                     MRarity;                                           // 0x00B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         MParticleSystem;                                   // 0x00B8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UNiagaraSystem>          MNiagaraSystem;                                    // 0x00E0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItHatDataAsset">();
	}
	static class UGolfItHatDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItHatDataAsset>();
	}
};
#pragma pack(pop)

// Class GolfItSteam.GolfItAnimatedHatDataAsset
// 0x0080 (0x0190 - 0x0110)
class UGolfItAnimatedHatDataAsset final : public UGolfItHatDataAsset
{
public:
	TSoftObjectPtr<class USkeletalMesh>           MSkeletalMesh;                                     // 0x0108(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimSequence>           MAnimationSequence;                                // 0x0130(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            MAnimationMontage;                                 // 0x0158(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         MUseAnimationPlayrate : 1;                         // 0x0180(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_181[0xF];                                      // 0x0181(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItAnimatedHatDataAsset">();
	}
	static class UGolfItAnimatedHatDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItAnimatedHatDataAsset>();
	}
};

// Class GolfItSteam.GolfItGeneratorDataAsset
// 0x0068 (0x00E0 - 0x0078)
class UGolfItGeneratorDataAsset final : public UGolfItInventoryItemDataAsset
{
public:
	TArray<class UGolfItInventoryItemDataAsset*>  MPossibleItems;                                    // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<ESteamInventoryItemRarity, float>        MDropPercentages;                                  // 0x0088(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                         MPrice;                                            // 0x00D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESteamInventoryItemRarity                     MRarity;                                           // 0x00DC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESteamInventoryItemType                       MType;                                             // 0x00DD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItGeneratorDataAsset">();
	}
	static class UGolfItGeneratorDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItGeneratorDataAsset>();
	}
};

// Class GolfItSteam.GolfItGoalEffectDataAsset
// 0x0080 (0x00F8 - 0x0078)
class UGolfItGoalEffectDataAsset final : public UGolfItInventoryItemDataAsset
{
public:
	ESteamInventoryItemRarity                     MRarity;                                           // 0x0078(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          MNiagaraSystem;                                    // 0x0080(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UObject>                 MAudioSoundCue;                                    // 0x00A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UNiagaraSystem>          MNiagaraPreviewSystem;                             // 0x00D0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItGoalEffectDataAsset">();
	}
	static class UGolfItGoalEffectDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItGoalEffectDataAsset>();
	}
};

// Class GolfItSteam.GolfItPutterDataAsset
// 0x0080 (0x00F8 - 0x0078)
class UGolfItPutterDataAsset final : public UGolfItInventoryItemDataAsset
{
public:
	ESteamInventoryItemRarity                     MRarity;                                           // 0x0078(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             MStaticMesh;                                       // 0x0080(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterialInstance>       MMaterialInstance;                                 // 0x00A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UNiagaraSystem>          MNiagaraSystem;                                    // 0x00D0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItPutterDataAsset">();
	}
	static class UGolfItPutterDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItPutterDataAsset>();
	}
};

// Class GolfItSteam.GolfItSkinMeshDataAsset
// 0x0028 (0x00E0 - 0x00B8)
class UGolfItSkinMeshDataAsset final : public UGolfItSkinDataAsset
{
public:
	TSoftObjectPtr<class UStaticMesh>             MStaticMesh;                                       // 0x00B8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItSkinMeshDataAsset">();
	}
	static class UGolfItSkinMeshDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItSkinMeshDataAsset>();
	}
};

// Class GolfItSteam.GolfItStaticHatDataAsset
// 0x0020 (0x0130 - 0x0110)
class UGolfItStaticHatDataAsset final : public UGolfItHatDataAsset
{
public:
	TSoftObjectPtr<class UStaticMesh>             MStaticMesh;                                       // 0x0108(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItStaticHatDataAsset">();
	}
	static class UGolfItStaticHatDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItStaticHatDataAsset>();
	}
};

// Class GolfItSteam.GolfItSteamFriendsFunctions
// 0x0000 (0x0028 - 0x0028)
class UGolfItSteamFriendsFunctions final : public UBlueprintFunctionLibrary
{
public:
	static void FilterSteamFriends(TArray<struct FSteamFriend>* OutFilteredFriends, const TArray<struct FSteamFriend>& InFriends, bool IncludeOnline, bool IncludeOffline, bool IncludePlayingGolfIt, bool IncludeNotPlayingGolfIt);
	static bool IsPlayerStateFriend(class APlayerState* PlayerState);
	static void SendSessionInvite(class UObject* WorldContextObject, const struct FSteamFriend& Friend, EGenericOperationResult* Result);
	static void SortSteamFriendsByName(TArray<struct FSteamFriend>& SortedFriends, bool Ascending);
	static void SwitchIsPlayerStateFriend(EGenericBoolResult* Result, class APlayerState* PlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItSteamFriendsFunctions">();
	}
	static class UGolfItSteamFriendsFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItSteamFriendsFunctions>();
	}
};

// Class GolfItSteam.GolfItSteamFunctions
// 0x0000 (0x0028 - 0x0028)
class UGolfItSteamFunctions final : public UBlueprintFunctionLibrary
{
public:
	static void AddTimelineEvent(const class FString& Icon, const class FString& Title, const class FString& Description, int32 Priority, float StartOffsetSeconds, float Duration);
	static bool ClearAchievement(const class FName& Param_Name);
	static void ClearRichPresence();
	static void ClearRichPresenceKey(const class FString& Status);
	static void CloseSteamDeckKeyboard(EGenericOperationResult* Result);
	static void CloseSteamFloatingTextKeyboard(EGenericOperationResult* Result);
	static ESteamControllerType CurrentSteamControllerType(int32 GamepadIndex);
	static class FString GetCurrentBranchName();
	static int32 GetSteamAppId();
	static class FName GetSteamGameLanguageCode();
	static bool IsDevBranch();
	static bool IsSteamDeck();
	static bool IsSteamInitialised();
	static void OpenSteamDeckKeyboard(EGenericOperationResult* Result, int32 XPosition, int32 YPostion, int32 Width, int32 Height);
	static void OpenSteamFloatingTextKeyboard(EGenericOperationResult* Result, ESteamGamepadTextInputMode Mode, const struct FIntPoint& UpperLeft, const struct FIntPoint& LowerRight);
	static void SetRichPresence(const class FString& Status, const class FString& Info, EGenericOperationResult* Result);
	static void SwitchIsDevBranch(EGenericBoolResult* Result);
	static void SwitchIsSteamDeck(EGenericBoolResult* Result);
	static void SwitchIsSteamInitialised(EGenericBoolResult* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItSteamFunctions">();
	}
	static class UGolfItSteamFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItSteamFunctions>();
	}
};

// Class GolfItSteam.GolfItTrailDataAsset
// 0x0138 (0x01B0 - 0x0078)
class UGolfItTrailDataAsset final : public UGolfItInventoryItemDataAsset
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             MTransform;                                        // 0x0080(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         MIsMovementBased : 1;                              // 0x00B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         MIsAlwaysActive : 1;                               // 0x00B0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         MIsIntrusive : 1;                                  // 0x00B0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	ESteamInventoryItemRarity                     MRarity;                                           // 0x00B1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             MStaticMesh;                                       // 0x00B8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterialInstance>       MMaterialInstance;                                 // 0x00E0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimSequence>           MAnimationSequence;                                // 0x0108(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UParticleSystem>         MParticleSystem;                                   // 0x0130(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UNiagaraSystem>          MNiagaraSystem;                                    // 0x0158(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UNiagaraSystem>          MNiagaraPreviewSystem;                             // 0x0180(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItTrailDataAsset">();
	}
	static class UGolfItTrailDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItTrailDataAsset>();
	}
};

// Class GolfItSteam.InventoryBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UInventoryBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FSteamInventoryItemDefinitionHandle GetGolfItBundleGeneratorHandleByRarity(ESteamInventoryItemRarity Rarity);
	static struct FSteamInventoryItemDefinitionHandle GetGolfItCoinDefinitionHandle();
	static struct FSteamInventoryItemDefinitionHandle GetGolfItCoinGeneratorHandleByRarity(ESteamInventoryItemRarity Rarity);
	static int32 GetGolfItCoinPriceForBundleGenerator(ESteamInventoryItemRarity Rarity);
	static int32 GetGolfItCoinPriceForDirectPurchase(ESteamInventoryItemRarity Rarity);
	static struct FSteamInventoryItemDefinitionHandle GetGolfItPlayTimeGeneratorDefinitionHandle();
	static bool IsGolfItCoinDefinition(const struct FSteamInventoryItemDefinitionHandle& ItemDefinition);
	static bool IsItemDefinitionHandleEqual(const struct FSteamInventoryItemDefinitionHandle& A, const struct FSteamInventoryItemDefinitionHandle& B);
	static bool IsItemDefinitionHandleValid(const struct FSteamInventoryItemDefinitionHandle& Handle);
	static bool IsItemInstanceHandleEqual(const struct FSteamInventoryItemInstanceHandle& A, const struct FSteamInventoryItemInstanceHandle& B);
	static bool IsItemInstanceHandleValid(const struct FSteamInventoryItemInstanceHandle& Handle);
	static struct FSteamInventoryItemDefinitionHandle MakeSteamItemDefinitionHandle(int32 ItemDefinitionId);
	static void SortInventoryAssetIDsByRarity(TArray<struct FPrimaryAssetId>& InventoryItems, bool Ascending);
	static void SortInventoryItemsByAcquiredAt(TArray<struct FSteamInventoryItem>& InventoryItems, bool Ascending);
	static void SortInventoryItemsByRarity(TArray<struct FSteamInventoryItem>& InventoryItems, bool Ascending);
	static void SwitchInventoryItemType(const struct FPrimaryAssetId& AssetID, ESteamInventoryItemType* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InventoryBlueprintLibrary">();
	}
	static class UInventoryBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryBlueprintLibrary>();
	}
};

// Class GolfItSteam.SteamCallbacksSubsystem
// 0x0150 (0x0180 - 0x0030)
class USteamCallbacksSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x138];                                     // 0x0030(0x0138)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             MOnFailedToGetSteamToken;                          // 0x0168(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         MFailedToGetSteamToken : 1;                        // 0x0178(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCallbacksSubsystem">();
	}
	static class USteamCallbacksSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCallbacksSubsystem>();
	}
};

// Class GolfItSteam.SteamFriendListAsyncAction
// 0x0018 (0x0048 - 0x0030)
class USteamFriendListAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             MOnReadFriendListDoneDelegate;                     // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USteamFriendListAsyncAction* AsyncReadFriendList(class UObject* WorldContextObject);

	void OnReadFriendListDoneDelegate__DelegateSignature(const TArray<struct FSteamFriend>& Friends, bool Success);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamFriendListAsyncAction">();
	}
	static class USteamFriendListAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamFriendListAsyncAction>();
	}
};

// Class GolfItSteam.SteamInventoryFullUpdateRequest
// 0x0028 (0x0058 - 0x0030)
class USteamInventoryFullUpdateRequest final : public UBlueprintAsyncActionBase
{
public:
	class USteamInventorySubsystem*               MInventorySubsystem;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             MOnRequestDone;                                    // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             MOnRequestFailed;                                  // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class USteamInventoryFullUpdateRequest* RequestFullInventoryUpdate(class USteamInventorySubsystem* InventorySubsystem, class UObject* WorldContextObject);

	void DoneDelegate__DelegateSignature();
	void OnRequestDone();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamInventoryFullUpdateRequest">();
	}
	static class USteamInventoryFullUpdateRequest* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamInventoryFullUpdateRequest>();
	}
};

// Class GolfItSteam.SteamInventoryUpdateRequest
// 0x0048 (0x0078 - 0x0030)
class USteamInventoryUpdateRequest final : public UBlueprintAsyncActionBase
{
public:
	class USteamInventorySubsystem*               MInventorySubsystem;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             MOnRequestDone;                                    // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             MOnRequestFailed;                                  // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class USteamInventoryUpdateRequest* RequestAddPromoItem(class USteamInventorySubsystem* InventorySubsystem, class UObject* WorldContextObject, const struct FSteamInventoryItemDefinitionHandle& ItemDefinitionHandle);
	static class USteamInventoryUpdateRequest* RequestConsumeItem(class USteamInventorySubsystem* InventorySubsystem, class UObject* WorldContextObject, const struct FSteamInventoryItemInstanceHandle& ItemHandle, int32 Quantity);
	static class USteamInventoryUpdateRequest* RequestDropPlaytimeItem(class USteamInventorySubsystem* InventorySubsystem, class UObject* WorldContextObject, const struct FSteamInventoryItemDefinitionHandle& ItemDefinitionHandle);
	static class USteamInventoryUpdateRequest* RequestExchangeItem(class USteamInventorySubsystem* InventorySubsystem, class UObject* WorldContextObject, const struct FSteamInventoryItemDefinitionHandle& NewItemHandle, int32 NewItemQuantity, const struct FSteamInventoryItemInstanceHandle& ConsumingItemHandle, int32 ConsumingItemQuantity);
	static class USteamInventoryUpdateRequest* RequestSplitItemStack(class USteamInventorySubsystem* InventorySubsystem, class UObject* WorldContextObject, const struct FSteamInventoryItemInstanceHandle& ItemHandle, int32 Quantity);
	static class USteamInventoryUpdateRequest* RequestTransferItemStack(class USteamInventorySubsystem* InventorySubsystem, class UObject* WorldContextObject, const struct FSteamInventoryItemInstanceHandle& SourceItemHandle, const struct FSteamInventoryItemInstanceHandle& DestinationItemHandle, int32 Quantity);

	void DoneDelegate__DelegateSignature(const TArray<struct FSteamInventoryUpdateChange>& ChangeList);
	void FailedDelegate__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamInventoryUpdateRequest">();
	}
	static class USteamInventoryUpdateRequest* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamInventoryUpdateRequest>();
	}
};

// Class GolfItSteam.SteamInventorySubsystem
// 0x0128 (0x0158 - 0x0030)
class USteamInventorySubsystem final : public UGameInstanceSubsystem
{
public:
	FMulticastInlineDelegateProperty_             MOnInventoryFullyUpdatedDelegate;                  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x118];                                     // 0x0040(0x0118)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString GetItemDefinitionSteamProperty(EGenericOperationResult* OutResult, const struct FSteamInventoryItemDefinitionHandle& Handle, const class FString& Property);
	void OnInventoryFullyUpdatedDelegate__DelegateSignature();

	void GetInventoryItemByItemDefinitionHandle(struct FSteamInventoryItem* OutItem, ESearchResult* Result, const struct FSteamInventoryItemDefinitionHandle& Handle) const;
	void GetInventoryItemByPrimaryAssetID(struct FSteamInventoryItem* OutItem, ESearchResult* Result, const struct FPrimaryAssetId& ID) const;
	void GetInventoryItemsByPrimaryAssetType(TArray<struct FSteamInventoryItem>* OutItems, const struct FPrimaryAssetType& Type) const;
	int32 GetTotalQuantityByItemDefinitionHandle(const struct FSteamInventoryItemDefinitionHandle& Handle) const;
	bool HasReceivedFullUpdate() const;
	bool HasReceivedItemDefinitions() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamInventorySubsystem">();
	}
	static class USteamInventorySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamInventorySubsystem>();
	}
};

// Class GolfItSteam.SteamLeaderboardDownloadNodes
// 0x0030 (0x0060 - 0x0030)
class USteamLeaderboardDownloadNodes final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             MOnRequestSucceeded;                               // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             MOnRequestFailed;                                  // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class USteamLeaderboardDownloadNodes* DownloadLeaderboard(class UObject* WorldContextObject, const class FName& Param_Name, int32 FirstRank, int32 LastRank);

	void DoneDelegate__DelegateSignature(const TArray<struct FLeaderboardRow>& SortedRows);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamLeaderboardDownloadNodes">();
	}
	static class USteamLeaderboardDownloadNodes* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamLeaderboardDownloadNodes>();
	}
};

// Class GolfItSteam.SteamStatsNodes
// 0x0030 (0x0060 - 0x0030)
class USteamStatsNodes final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             MOnRequestSucceeded;                               // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             MOnRequestFailed;                                  // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class USteamStatsNodes* GetNumCurrentPlayers(class UObject* WorldContextObject);
	static class USteamStatsNodes* GetUserStat(class UObject* WorldContextObject, class FName Param_Name);

	void DoneDelegate__DelegateSignature(int32 Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamStatsNodes">();
	}
	static class USteamStatsNodes* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamStatsNodes>();
	}
};

// Class GolfItSteam.SteamUGCQueryResultContainer
// 0x0040 (0x0068 - 0x0028)
class USteamUGCQueryResultContainer final : public UObject
{
public:
	TArray<struct FSteamWorkshopItemHandle>       MItemHandles;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FSteamUGCQueryResult>           MDetails;                                          // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         MNumResultsReceived;                               // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MNumTotalExpectedResults;                          // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MNextPage;                                         // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         MIsLastPage : 1;                                   // 0x0054(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUGCBaseQuerySettings*                  MQuerySettings;                                    // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USteamUGCQueryResultContainer*          MPreviousContainer;                                // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamUGCQueryResultContainer">();
	}
	static class USteamUGCQueryResultContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamUGCQueryResultContainer>();
	}
};

// Class GolfItSteam.UGCBaseQuerySettings
// 0x0058 (0x0080 - 0x0028)
class UUGCBaseQuerySettings : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           MRequiredTags;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           MRequiredTagGroups;                                // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           MExcludedTags;                                     // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         MReturnOnlyIds : 1;                                // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_60_1 : 1;                                   // 0x0060(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         MReturnKeyValueTags : 1;                           // 0x0060(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_60_3 : 1;                                   // 0x0060(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         MReturnLongDescription : 1;                        // 0x0060(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_60_5 : 1;                                   // 0x0060(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         MReturnMetadata : 1;                               // 0x0060(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_60_7 : 1;                                   // 0x0060(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         MReturnChildren : 1;                               // 0x0061(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_61_1 : 1;                                   // 0x0061(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         MReturnAdditionalPreviews : 1;                     // 0x0061(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_61_3 : 1;                                   // 0x0061(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         MReturnTotalOnly : 1;                              // 0x0061(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MPlaytimeStatsDurationDays;                        // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x4];                                       // 0x0068(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MLanguage;                                         // 0x006C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MMaxCacheAgeSeconds;                               // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0x4];                                       // 0x0078(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MPageNumber;                                       // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetMaxCacheAge(int32 Seconds);
	void SetPageNumber(int32 PageNumber);
	void SetPlaytimeStatsDuration(int32 Days);
	void SetReturnAdditionalPreviews(bool ReturnAdditionalPreviews);
	void SetReturnChildren(bool ReturnChildren);
	void SetReturnKeyValueTags(bool ReturnKeyValueTags);
	void SetReturnLongDescription(bool ReturnLongDescription);
	void SetReturnMetadata(bool ReturnMetadata);
	void SetReturnOnlyIds(bool ReturnOnlyIds);
	void SetReturnTotalOnly(bool ReturnTotalOnly);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UGCBaseQuerySettings">();
	}
	static class UUGCBaseQuerySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUGCBaseQuerySettings>();
	}
};

// Class GolfItSteam.UGCUserQuerySettings
// 0x0020 (0x00A0 - 0x0080)
class UUGCUserQuerySettings final : public UUGCBaseQuerySettings
{
public:
	uint8                                         Pad_80[0x14];                                      // 0x0080(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MCloudFileNameFilter;                              // 0x0094(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UGCUserQuerySettings">();
	}
	static class UUGCUserQuerySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUGCUserQuerySettings>();
	}
};

// Class GolfItSteam.UGCAllQuerySettings
// 0x0078 (0x00F8 - 0x0080)
class UUGCAllQuerySettings final : public UUGCBaseQuerySettings
{
public:
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FName>                MRequiredKeyValueTags;                             // 0x0088(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         MMatchAnyTag : 1;                                  // 0x00D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MSearchText;                                       // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MRankedByTrendDays;                                // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetMatchAnyTag(bool MatchAnyTag);
	void SetRankedByTrendDays(int32 Days);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UGCAllQuerySettings">();
	}
	static class UUGCAllQuerySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUGCAllQuerySettings>();
	}
};

// Class GolfItSteam.UGCDetailQuerySettings
// 0x0010 (0x0090 - 0x0080)
class UUGCDetailQuerySettings final : public UUGCBaseQuerySettings
{
public:
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UGCDetailQuerySettings">();
	}
	static class UUGCDetailQuerySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUGCDetailQuerySettings>();
	}
};

// Class GolfItSteam.GolfItStatSettings
// 0x00A0 (0x00D8 - 0x0038)
class UGolfItStatSettings final : public UDeveloperSettings
{
public:
	TMap<class FName, struct FGolfItStatDescription> MStats;                                            // 0x0038(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<EGolfItStatCategory, class FText>        MCategories;                                       // 0x0088(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UGolfItStatSettings* GetStatSettings();

	bool GetCategoryDescription(EGolfItStatCategory Category, class FText* OutDescription) const;
	bool GetStatDescription(class FName Stat, struct FGolfItStatDescription* OutDescription) const;
	void GetStatNames(TArray<class FName>* OutKeys, EGolfItStatCategory Category) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItStatSettings">();
	}
	static class UGolfItStatSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItStatSettings>();
	}
};

// Class GolfItSteam.SteamUserStatsSubsystem
// 0x00C0 (0x00F0 - 0x0030)
class USteamUserStatsSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0xC0];                                      // 0x0030(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ChangeCurrentUserStat(EUserStatsUpdateResult* Result, class FName Param_Name, int32 Value, EStatsUpdateOperation Operation, EStatsUpdateValueCondition Condition);
	bool StoreCurrentUserStats();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamUserStatsSubsystem">();
	}
	static class USteamUserStatsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamUserStatsSubsystem>();
	}
};

}

