#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: GolfItDataHub

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "GolfItDataHub_structs.hpp"
#include "Engine_classes.hpp"
#include "GolfItUtils_structs.hpp"


namespace SDK
{

// Class GolfItDataHub.GolfItDataHubDataProvider
// 0x0000 (0x0028 - 0x0028)
class IGolfItDataHubDataProvider final : public IInterface
{
public:
	void StoreData(class UGolfItDataHubScope* Scope);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItDataHubDataProvider">();
	}
	static class IGolfItDataHubDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGolfItDataHubDataProvider>();
	}
};

// Class GolfItDataHub.GolfItDataHubFunctions
// 0x0000 (0x0028 - 0x0028)
class UGolfItDataHubFunctions final : public UBlueprintFunctionLibrary
{
public:
	static struct FDataHubHandle MakeDataHubHandle(const struct FGameplayTag& GameplayTag);
	static struct FDataHubHandle MakeDataHubHandleWithIndex(const struct FGameplayTag& GameplayTag, int32 Param_Index);
	static struct FDataHubHandle MakeDataHubHandleWithLocalPlayer(const struct FGameplayTag& GameplayTag);
	static struct FDataHubHandle MakeDataHubHandleWithPlayer(const struct FGameplayTag& GameplayTag, const class APlayerState* PlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItDataHubFunctions">();
	}
	static class UGolfItDataHubFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItDataHubFunctions>();
	}
};

// Class GolfItDataHub.GolfItDataHubScope
// 0x0070 (0x0098 - 0x0028)
class UGolfItDataHubScope final : public UObject
{
public:
	class UGolfItDataHubSubsystem*                MDataHubSubsystem;                                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x58];                                      // 0x0030(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IGolfItDataHubDataProvider>> MDataProviders;                                    // 0x0088(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	EGenericOperationResult ActivateDataHandle(const struct FDataHubHandle& DataHandle);
	EDataHubGetDataResult GetFloatArrayData(const struct FDataHubHandle& DataHandle, TArray<float>* FloatArray);
	EDataHubGetDataResult GetFloatData(const struct FDataHubHandle& DataHandle, float* OutFloat);
	EDataHubGetDataResult GetGameplayTagData(const struct FDataHubHandle& DataHandle, struct FGameplayTag* OutTag);
	EDataHubGetDataResult GetIntArrayData(const struct FDataHubHandle& DataHandle, TArray<int32>* IntArray);
	EDataHubGetDataResult GetIntData(const struct FDataHubHandle& DataHandle, int32* OutInt);
	EDataHubGetDataResult GetLongIntData(const struct FDataHubHandle& DataHandle, int64* OutInt);
	EDataHubGetDataResult GetNameData(const struct FDataHubHandle& DataHandle, class FName* OutName);
	EDataHubGetDataResult GetWorkshopHandleData(const struct FDataHubHandle& DataHandle, struct FSteamWorkshopItemHandle* OutWorkshopHandle);
	void OnScopeEndingEvent(const struct FGameplayTag& GameEventTag);
	void RegisterDataProvider(TScriptInterface<class IGolfItDataHubDataProvider> Provider);
	void StoreFloatArrayData(const struct FDataHubHandle& DataHandle, TArray<float>& Data);
	void StoreFloatData(const struct FDataHubHandle& DataTag, float Data);
	void StoreGameplayTagData(const struct FDataHubHandle& DataHandle, const struct FGameplayTag& Data);
	void StoreIntArrayData(const struct FDataHubHandle& DataHandle, TArray<int32>& Data);
	void StoreIntData(const struct FDataHubHandle& DataHandle, int32 Data);
	void StoreLongIntData(const struct FDataHubHandle& DataHandle, int64 Data);
	void StoreNameData(const struct FDataHubHandle& DataHandle, const class FName& Data);
	void StoreWorkshopHandleData(const struct FDataHubHandle& DataHandle, const struct FSteamWorkshopItemHandle& Data);

	struct FGameplayTag GetScopeTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItDataHubScope">();
	}
	static class UGolfItDataHubScope* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItDataHubScope>();
	}
};

// Class GolfItDataHub.GolfItDataHubSubsystem
// 0x0028 (0x0058 - 0x0030)
class UGolfItDataHubSubsystem final : public UGameInstanceSubsystem
{
public:
	TArray<class UGolfItDataHubScope*>            MScopes;                                           // 0x0030(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UGolfItDataHubScope*>            MEndingScopes;                                     // 0x0040(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UGolfItDataHubScope*                    MFrameScope;                                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UGolfItDataHubScope* GetScope(EGenericOperationResult* OutResult, const struct FGameplayTag& ScopeTag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GolfItDataHubSubsystem">();
	}
	static class UGolfItDataHubSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGolfItDataHubSubsystem>();
	}
};

}

