#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: GolfIt

#include "Basic.hpp"

#include "Voxel_structs.hpp"
#include "GolfItSteam_structs.hpp"
#include "GolfIt_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "GolfItUtils_structs.hpp"
#include "CommonInput_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LuaMachine_structs.hpp"
#include "GolfItChallengeSystem_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_structs.hpp"
#include "RuntimeMeshComponent_structs.hpp"


namespace SDK::Params
{

// Function GolfIt.GolfItEditor2Action.CreateEditorAction
// 0x0018 (0x0018 - 0x0000)
struct GolfItEditor2Action_CreateEditorAction final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEditor2ActionType                            Type;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGolfItEditor2Action*                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2Action.Do
// 0x0001 (0x0001 - 0x0000)
struct GolfItEditor2Action_Do final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2Action.GetObjectManager
// 0x0008 (0x0008 - 0x0000)
struct GolfItEditor2Action_GetObjectManager final
{
public:
	class AGolfItEditor2ObjectManager*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2Action.Redo
// 0x0001 (0x0001 - 0x0000)
struct GolfItEditor2Action_Redo final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2Action.Undo
// 0x0001 (0x0001 - 0x0000)
struct GolfItEditor2Action_Undo final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2Action.GetActionMessage
// 0x0018 (0x0018 - 0x0000)
struct GolfItEditor2Action_GetActionMessage final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2Action.GetEditorMode
// 0x0001 (0x0001 - 0x0000)
struct GolfItEditor2Action_GetEditorMode final
{
public:
	EEditor2Mode                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2Action.ShouldUpdateEditorMode
// 0x0001 (0x0001 - 0x0000)
struct GolfItEditor2Action_ShouldUpdateEditorMode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2AddFoliage.CreateAddFoliageAction
// 0x0028 (0x0028 - 0x0000)
struct GolfItEditor2AddFoliage_CreateAddFoliageAction final
{
public:
	EEditor2CreateEditorActionOutputPins          OutputPin;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGolfItEditor2AddFoliage*               EditorActionObject;                                // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FEditor2FoliageData>            AddedInstances;                                    // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2AddFoliage.Setup
// 0x0018 (0x0018 - 0x0000)
struct GolfItEditor2AddFoliage_Setup final
{
public:
	TArray<struct FEditor2FoliageData>            AddedInstances;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfIt.PreviewPictureLoader.AsyncLoadAvatarPictureFromPlayerState
// 0x0018 (0x0018 - 0x0000)
struct PreviewPictureLoader_AsyncLoadAvatarPictureFromPlayerState final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           PlayerState;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPreviewPictureLoader*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.PreviewPictureLoader.AsyncLoadAvatarPictureFromSteamFriend
// 0x0050 (0x0050 - 0x0000)
struct PreviewPictureLoader_AsyncLoadAvatarPictureFromSteamFriend final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamFriend                           SteamFriend;                                       // 0x0008(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UPreviewPictureLoader*                  ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.PreviewPictureLoader.AsyncLoadPictureFromBinaryData
// 0x0020 (0x0020 - 0x0000)
struct PreviewPictureLoader_AsyncLoadPictureFromBinaryData final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 BinaryData;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UPreviewPictureLoader*                  ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.PreviewPictureLoader.AsyncLoadPreviewPictureFromCustomItemDesc
// 0x0018 (0x0018 - 0x0000)
struct PreviewPictureLoader_AsyncLoadPreviewPictureFromCustomItemDesc final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULocalCustomItemDesc*                   CustomItemDesc;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPreviewPictureLoader*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.PreviewPictureLoader.AsyncLoadPreviewPictureFromMapInfo
// 0x0018 (0x0018 - 0x0000)
struct PreviewPictureLoader_AsyncLoadPreviewPictureFromMapInfo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGolfItBaseMapInfo*                     MapInfo;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPreviewPictureLoader*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction GolfIt.PreviewPictureLoader.DoneDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct PreviewPictureLoader_DoneDelegate__DelegateSignature final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             PreviewPicture;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.PreviewPictureLoader.MatchesSteamFriend
// 0x0048 (0x0048 - 0x0000)
struct PreviewPictureLoader_MatchesSteamFriend final
{
public:
	struct FSteamFriend                           SteamFriend;                                       // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfIt.AsyncSaveGameAction.AsyncLoadIfMissingCustomItemDesc
// 0x0018 (0x0018 - 0x0000)
struct AsyncSaveGameAction_AsyncLoadIfMissingCustomItemDesc final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULocalCustomItemDesc*                   CustomItemDesc;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncSaveGameAction*                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.AsyncSaveGameAction.AsyncLoadIfMissingMapInfo
// 0x0018 (0x0018 - 0x0000)
struct AsyncSaveGameAction_AsyncLoadIfMissingMapInfo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGolfItCustomMapInfo*                   CustomMapInfo;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncSaveGameAction*                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.AsyncSaveGameAction.AsyncLoadSaveGameFromCustomItemDesc
// 0x0018 (0x0018 - 0x0000)
struct AsyncSaveGameAction_AsyncLoadSaveGameFromCustomItemDesc final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULocalCustomItemDesc*                   CustomItemDesc;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncSaveGameAction*                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.AsyncSaveGameAction.AsyncLoadSaveGameFromMapInfo
// 0x0018 (0x0018 - 0x0000)
struct AsyncSaveGameAction_AsyncLoadSaveGameFromMapInfo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGolfItCustomMapInfo*                   CustomMapInfo;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncSaveGameAction*                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.AsyncSaveGameAction.AsyncSaveSaveGameOfCustomItemDesc
// 0x0020 (0x0020 - 0x0000)
struct AsyncSaveGameAction_AsyncSaveSaveGameOfCustomItemDesc final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveGame*                              SaveGame;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULocalCustomItemDesc*                   CustomItemDesc;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncSaveGameAction*                   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.AsyncSaveGameAction.AsyncSaveSaveGameOfMapInfo
// 0x0028 (0x0028 - 0x0000)
struct AsyncSaveGameAction_AsyncSaveSaveGameOfMapInfo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGolfItCustomMapSaveGame*               SaveGame;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGolfItCustomMapInfo*                   CustomMapInfo;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UpdateVersionCounter;                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncSaveGameAction*                   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction GolfIt.AsyncSaveGameAction.DoneDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AsyncSaveGameAction_DoneDelegate__DelegateSignature final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveGame*                              SaveGame;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2BillboardComponent.SetIsHovered
// 0x0001 (0x0001 - 0x0000)
struct GolfItEditor2BillboardComponent_SetIsHovered final
{
public:
	bool                                          IsHovered;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2BillboardComponent.SetIsSelected
// 0x0008 (0x0008 - 0x0000)
struct GolfItEditor2BillboardComponent_SetIsSelected final
{
public:
	bool                                          IsSelected;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerId;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2BillboardComponent.Setup
// 0x0008 (0x0008 - 0x0000)
struct GolfItEditor2BillboardComponent_Setup final
{
public:
	class UTexture*                               Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2BillboardComponent.GetMaterials
// 0x0018 (0x0018 - 0x0000)
struct GolfItEditor2BillboardComponent_GetMaterials final
{
public:
	TArray<class UMaterialInterface*>             OutMaterials;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bGetDebugMaterials;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfIt.CreateVoxelWorldAsync.CreateVoxelWorldAsync
// 0x0078 (0x0078 - 0x0000)
struct CreateVoxelWorldAsync_CreateVoxelWorldAsync final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVoxelWorldCreateInfo                  OverrideParameters;                                // 0x0008(0x0048)(Parm, NativeAccessSpecifierPublic)
	TSubclassOf<class AGolfItEditor2VoxelWorld>   VoxelWorldClass;                                   // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UpdateWorldSettings;                               // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditor2VoxelWorldSettings             WorldSettings;                                     // 0x005C(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCreateVoxelWorldAsync*                 ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2ObjectProperty.DuplicateObjectProperty
// 0x0020 (0x0020 - 0x0000)
struct GolfItEditor2ObjectProperty_DuplicateObjectProperty final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGolfItEditor2ObjectProperty*           InProperty;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGolfItEditor2ObjectProperty*           OutProperty;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfIt.GolfItEditor2ObjectProperty.SetAssociatedInstanceId
// 0x0004 (0x0004 - 0x0000)
struct GolfItEditor2ObjectProperty_SetAssociatedInstanceId final
{
public:
	int32                                         InstanceID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2ObjectProperty.GetAllChildProperties
// 0x0010 (0x0010 - 0x0000)
struct GolfItEditor2ObjectProperty_GetAllChildProperties final
{
public:
	TArray<class UGolfItEditor2ObjectProperty*>   ChildProperties;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2ObjectProperty.GetAssociatedInstanceId
// 0x0004 (0x0004 - 0x0000)
struct GolfItEditor2ObjectProperty_GetAssociatedInstanceId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2ObjectProperty.GetCurrentChildProperties
// 0x0010 (0x0010 - 0x0000)
struct GolfItEditor2ObjectProperty_GetCurrentChildProperties final
{
public:
	TArray<class UGolfItEditor2ObjectProperty*>   ChildProperties;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2ObjectProperty.GetHasChildProperties
// 0x0001 (0x0001 - 0x0000)
struct GolfItEditor2ObjectProperty_GetHasChildProperties final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2ObjectProperty.GetLuaValue
// 0x0048 (0x0048 - 0x0000)
struct GolfItEditor2ObjectProperty_GetLuaValue final
{
public:
	TSubclassOf<class ULuaState>                  State;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2ObjectProperty.GetType
// 0x0001 (0x0001 - 0x0000)
struct GolfItEditor2ObjectProperty_GetType final
{
public:
	EEditor2VariableType                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2Boolean.SetValue
// 0x0002 (0x0002 - 0x0000)
struct GolfItEditor2Boolean_SetValue final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEditorAction;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2Boolean.GetLastValue
// 0x0001 (0x0001 - 0x0000)
struct GolfItEditor2Boolean_GetLastValue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2Boolean.GetValue
// 0x0001 (0x0001 - 0x0000)
struct GolfItEditor2Boolean_GetValue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.WorkshopCustomItemDescLoader.LoadWorkshopCustomItems
// 0x0020 (0x0020 - 0x0000)
struct WorkshopCustomItemDescLoader_LoadWorkshopCustomItems final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USteamUGCSubsystem*                     UGCSubsystem;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomItemType                               Type;                                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorkshopCustomItemDescLoader*          ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction GolfIt.WorkshopCustomItemDescLoader.DoneDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WorkshopCustomItemDescLoader_DoneDelegate__DelegateSignature final
{
public:
	TArray<class UWorkshopCustomItemDesc*>        WorkshopCustomItemDescs;                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2Color.SetValue
// 0x0014 (0x0014 - 0x0000)
struct GolfItEditor2Color_SetValue final
{
public:
	struct FLinearColor                           Value;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEditorAction;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfIt.GolfItEditor2Color.GetLastValue
// 0x0010 (0x0010 - 0x0000)
struct GolfItEditor2Color_GetLastValue final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2Color.GetValue
// 0x0010 (0x0010 - 0x0000)
struct GolfItEditor2Color_GetValue final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.CustomItemBlueprintLibrary.CreateNewCustomBlueprintDesc
// 0x0030 (0x0030 - 0x0000)
struct CustomItemBlueprintLibrary_CreateNewCustomBlueprintDesc final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULocalCustomItemDesc*                   OutCustomItemDesc;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGolfItBlueprintSaveGame*               OutSaveGame;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param_Name;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGolfItBlueprintSaveGame>   SaveGameClass;                                     // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.CustomItemBlueprintLibrary.DeleteItemHandleFromWorkshop
// 0x0008 (0x0008 - 0x0000)
struct CustomItemBlueprintLibrary_DeleteItemHandleFromWorkshop final
{
public:
	struct FSteamWorkshopItemHandle               WorkshopItemHandle;                                // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.CustomItemBlueprintLibrary.GetCustomItemsDescs
// 0x0020 (0x0020 - 0x0000)
struct CustomItemBlueprintLibrary_GetCustomItemsDescs final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomItemType                               Type;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULocalCustomItemDesc*>           OutCustomItemsDescs;                               // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItMapsSettings.GetMapsSettings
// 0x0008 (0x0008 - 0x0000)
struct GolfItMapsSettings_GetMapsSettings final
{
public:
	class UGolfItMapsSettings*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItMapsSettings.GetConfigEntryByMapInfo
// 0x0160 (0x0160 - 0x0000)
struct GolfItMapsSettings_GetConfigEntryByMapInfo final
{
public:
	struct FGolfItOfficalMapConfigEntry           OutEntry;                                          // 0x0000(0x0158)(Parm, OutParm, NativeAccessSpecifierPublic)
	const class UGolfItBaseMapInfo*               MapInfo;                                           // 0x0158(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItMapsSettings.GetLeaderboardNameForOfficialMap
// 0x0018 (0x0018 - 0x0000)
struct GolfItMapsSettings_GetLeaderboardNameForOfficialMap final
{
public:
	const class UGolfItOfficialMapInfo*           OfficialMapInfo;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGolfItPlayMode                               PlayMode;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ReturnValue;                                       // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfIt.GolfItMapsSettings.GetLeaderboardNamesForOfficialMap
// 0x0058 (0x0058 - 0x0000)
struct GolfItMapsSettings_GetLeaderboardNamesForOfficialMap final
{
public:
	TMap<EGolfItPlayMode, class FName>            OutNames;                                          // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	const class UGolfItOfficialMapInfo*           OfficialMapInfo;                                   // 0x0050(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.LocalCustomItemDesc.GetSaveGameFilePath
// 0x0010 (0x0010 - 0x0000)
struct LocalCustomItemDesc_GetSaveGameFilePath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.LocalCustomItemDesc.IsWorkshopItem
// 0x0001 (0x0001 - 0x0000)
struct LocalCustomItemDesc_IsWorkshopItem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2CustomAssetsSaveGame.GetCustomAssetIDsByType
// 0x0018 (0x0018 - 0x0000)
struct GolfItEditor2CustomAssetsSaveGame_GetCustomAssetIDsByType final
{
public:
	EEditor2CustomUserAssetType                   CustomAssetType;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2PropertiesInterface.CreateObjectProperties
// 0x0028 (0x0028 - 0x0000)
struct GolfItEditor2PropertiesInterface_CreateObjectProperties final
{
public:
	class AActor*                                 Param_Outer;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UGolfItEditor2ObjectProperty*>   Properties;                                        // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class FText>                           Categories;                                        // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2PropertiesInterface.GetChildProperties
// 0x0010 (0x0010 - 0x0000)
struct GolfItEditor2PropertiesInterface_GetChildProperties final
{
public:
	TArray<struct FEditor2ChildProperties>        ChildProperties;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2PropertiesInterface.GetPropertyButtons
// 0x0008 (0x0008 - 0x0000)
struct GolfItEditor2PropertiesInterface_GetPropertyButtons final
{
public:
	class UGolfItEditor2ActionList*               ActionList;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2PropertiesInterface.OnPropertyButtonPressed
// 0x0004 (0x0004 - 0x0000)
struct GolfItEditor2PropertiesInterface_OnPropertyButtonPressed final
{
public:
	int32                                         ButtonID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2PropertiesInterface.OnPropertyValueChanged
// 0x0010 (0x0010 - 0x0000)
struct GolfItEditor2PropertiesInterface_OnPropertyValueChanged final
{
public:
	class UGolfItEditor2ObjectProperty*           ObjectPropertyRef;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEditorAction;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfIt.Editor2PawnInterface.Delete
// 0x0001 (0x0001 - 0x0000)
struct Editor2PawnInterface_Delete final
{
public:
	bool                                          Release;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.GetGroupSelectionIsActive
// 0x0001 (0x0001 - 0x0000)
struct Editor2PawnInterface_GetGroupSelectionIsActive final
{
public:
	bool                                          GroupSelectionIsActive;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.GetTraceHitResult
// 0x0088 (0x0088 - 0x0000)
struct Editor2PawnInterface_GetTraceHitResult final
{
public:
	struct FHitResult                             TraceHitResult;                                    // 0x0000(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.GetTraceImpactLocation
// 0x0010 (0x0010 - 0x0000)
struct Editor2PawnInterface_GetTraceImpactLocation final
{
public:
	bool                                          RelativeToImpactComponent;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsValid;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ImpactLocation;                                    // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.Group
// 0x0001 (0x0001 - 0x0000)
struct Editor2PawnInterface_Group final
{
public:
	bool                                          Release;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.InitLastObjectPlacing
// 0x0001 (0x0001 - 0x0000)
struct Editor2PawnInterface_InitLastObjectPlacing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.InitObjectPlacing
// 0x0028 (0x0028 - 0x0000)
struct Editor2PawnInterface_InitObjectPlacing final
{
public:
	EEditor2Category                              Category;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEditor2PlaceableObjectType                   ObjectType;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RowName;                                           // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasCustomName;                                    // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomID;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfIt.Editor2PawnInterface.RotatePreview
// 0x0004 (0x0004 - 0x0000)
struct Editor2PawnInterface_RotatePreview final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.ScalePreview
// 0x0004 (0x0004 - 0x0000)
struct Editor2PawnInterface_ScalePreview final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.Select
// 0x0002 (0x0002 - 0x0000)
struct Editor2PawnInterface_Select final
{
public:
	bool                                          MultiSelect;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Release;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.SelectGroup
// 0x0010 (0x0010 - 0x0000)
struct Editor2PawnInterface_SelectGroup final
{
public:
	class FString                                 GroupId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.SelectObjectInstance
// 0x0018 (0x0018 - 0x0000)
struct Editor2PawnInterface_SelectObjectInstance final
{
public:
	struct FEditor2PlaceableObjectInstance        ObjectInstance;                                    // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.SetBlockInput
// 0x0001 (0x0001 - 0x0000)
struct Editor2PawnInterface_SetBlockInput final
{
public:
	bool                                          BlockInput;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.SetCurrentTransformationMode
// 0x0001 (0x0001 - 0x0000)
struct Editor2PawnInterface_SetCurrentTransformationMode final
{
public:
	EEditor2TransformationType                    NewTransformationMode;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.SetGroupSelectionIsActive
// 0x0001 (0x0001 - 0x0000)
struct Editor2PawnInterface_SetGroupSelectionIsActive final
{
public:
	bool                                          GroupSelectionIsActive;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.SetMouseAxisValue
// 0x0008 (0x0008 - 0x0000)
struct Editor2PawnInterface_SetMouseAxisValue final
{
public:
	struct FVector2D                              MouseAxisValue;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.SetMultiselectionIsActive
// 0x0001 (0x0001 - 0x0000)
struct Editor2PawnInterface_SetMultiselectionIsActive final
{
public:
	bool                                          MultiselectionIsActive;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.SetSnappingPointsAreEnabled
// 0x0001 (0x0001 - 0x0000)
struct Editor2PawnInterface_SetSnappingPointsAreEnabled final
{
public:
	bool                                          SnappingPointsAreEnabled;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.StartEyedropper
// 0x0008 (0x0008 - 0x0000)
struct Editor2PawnInterface_StartEyedropper final
{
public:
	class UGolfItEditor2ObjectProperty*           ObjectProperty;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.Ungroup
// 0x0001 (0x0001 - 0x0000)
struct Editor2PawnInterface_Ungroup final
{
public:
	bool                                          Release;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.Unselect
// 0x0001 (0x0001 - 0x0000)
struct Editor2PawnInterface_Unselect final
{
public:
	bool                                          Release;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.UpdateCamLocation
// 0x0008 (0x0008 - 0x0000)
struct Editor2PawnInterface_UpdateCamLocation final
{
public:
	struct FEditor2CamInput                       InputDirection;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.UpdateCamRotation
// 0x0008 (0x0008 - 0x0000)
struct Editor2PawnInterface_UpdateCamRotation final
{
public:
	struct FVector2D                              AxisValue;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.UpdateFoliagePainterSettings
// 0x002C (0x002C - 0x0000)
struct Editor2PawnInterface_UpdateFoliagePainterSettings final
{
public:
	struct FEditor2FoliagePainterSettings         NewSettings;                                       // 0x0000(0x002C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.UpdateVoxelTerrainEditingSettings
// 0x000C (0x000C - 0x0000)
struct Editor2PawnInterface_UpdateVoxelTerrainEditingSettings final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strength;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SurfaceOnly;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEditor2VoxelTerrainModifier                  Modifier;                                          // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TraceAll;                                          // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfIt.Editor2PawnInterface.UpdateVoxelTerrainMode
// 0x0001 (0x0001 - 0x0000)
struct Editor2PawnInterface_UpdateVoxelTerrainMode final
{
public:
	EEditor2VoxelTerrainMode                      NewMode;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.Editor2PawnInterface.UpdateVoxelTerrainSurfacePainterSettings
// 0x0010 (0x0010 - 0x0000)
struct Editor2PawnInterface_UpdateVoxelTerrainSurfacePainterSettings final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialID;                                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2DeleteObject.CreateDeleteAction
// 0x0028 (0x0028 - 0x0000)
struct GolfItEditor2DeleteObject_CreateDeleteAction final
{
public:
	EEditor2CreateEditorActionOutputPins          OutputPin;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGolfItEditor2DeleteObject*             EditorActionObject;                                // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FEditor2PlaceableObjectInstance> ObjectInstances;                                   // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItEditor2DeleteObject.Setup
// 0x0018 (0x0018 - 0x0000)
struct GolfItEditor2DeleteObject_Setup final
{
public:
	TArray<struct FEditor2PlaceableObjectInstance> ObjectInstances;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfIt.ImportedSoundWave.ImportSound
// 0x0030 (0x0030 - 0x0000)
struct ImportedSoundWave_ImportSound final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 RawData;                                           // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UImportedSoundWave*                     ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.ImportedSoundWave.PlayRawImportedSound
// 0x0018 (0x0018 - 0x0000)
struct ImportedSoundWave_PlayRawImportedSound final
{
public:
	TArray<uint8>                                 RawData;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UImportedSoundWave*                     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.ImportedSoundWave.SetCustomSoundClass
// 0x0008 (0x0008 - 0x0000)
struct ImportedSoundWave_SetCustomSoundClass final
{
public:
	class USoundClass*                            NewSoundClass;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.ImportedSoundWave.SetLooping
// 0x0001 (0x0001 - 0x0000)
struct ImportedSoundWave_SetLooping final
{
public:
	bool                                          ShouldLoop;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItBaseMapInfo.GetEditorMapName
// 0x0008 (0x0008 - 0x0000)
struct GolfItBaseMapInfo_GetEditorMapName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItBaseMapInfo.GetMapHandle
// 0x0010 (0x0010 - 0x0000)
struct GolfItBaseMapInfo_GetMapHandle final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfIt.GolfItBaseMapInfo.GetMapType
// 0x0001 (0x0001 - 0x0000)
struct GolfItBaseMapInfo_GetMapType final
{
public:
