#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: GolfItSteam

#include "Basic.hpp"

#include "GolfItSteam_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GolfItUtils_structs.hpp"


namespace SDK::Params
{

// Function GolfItSteam.GolfItInventoryItemDataAsset.GetCoinGeneratorHandle
// 0x0004 (0x0004 - 0x0000)
struct GolfItInventoryItemDataAsset_GetCoinGeneratorHandle final
{
public:
	struct FSteamInventoryItemDefinitionHandle    ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItInventoryItemDataAsset.GetDisplayName
// 0x0008 (0x0008 - 0x0000)
struct GolfItInventoryItemDataAsset_GetDisplayName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItInventoryItemDataAsset.GetItemDefinitionHandle
// 0x0004 (0x0004 - 0x0000)
struct GolfItInventoryItemDataAsset_GetItemDefinitionHandle final
{
public:
	struct FSteamInventoryItemDefinitionHandle    ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItInventoryItemDataAsset.GetPreviewPicture
// 0x0028 (0x0028 - 0x0000)
struct GolfItInventoryItemDataAsset_GetPreviewPicture final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItInventoryItemDataAsset.GetRarity
// 0x0001 (0x0001 - 0x0000)
struct GolfItInventoryItemDataAsset_GetRarity final
{
public:
	ESteamInventoryItemRarity                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItInventoryItemDataAsset.GetType
// 0x0001 (0x0001 - 0x0000)
struct GolfItInventoryItemDataAsset_GetType final
{
public:
	ESteamInventoryItemType                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.ExternalUINode.OpenAchievementsOverlay
// 0x0001 (0x0001 - 0x0000)
struct ExternalUINode_OpenAchievementsOverlay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.ExternalUINode.OpenProfileOverlay
// 0x0020 (0x0020 - 0x0000)
struct ExternalUINode_OpenProfileOverlay final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class APlayerState*                     Requestor;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class APlayerState*                     Requestee;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExternalUINode*                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.ExternalUINode.OpenSendFriendRequestOverlay
// 0x0010 (0x0010 - 0x0000)
struct ExternalUINode_OpenSendFriendRequestOverlay final
{
public:
	const class APlayerState*                     Requestee;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenericOperationResult                       Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.ExternalUINode.OpenStoreOverlay
// 0x0020 (0x0020 - 0x0000)
struct ExternalUINode_OpenStoreOverlay final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProductId;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExternalUINode*                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.ExternalUINode.OpenWebOverlay
// 0x0020 (0x0020 - 0x0000)
struct ExternalUINode_OpenWebOverlay final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 URL;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExternalUINode*                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.ExternalUINode.OpenWorkshopLegalAgreement
// 0x0010 (0x0010 - 0x0000)
struct ExternalUINode_OpenWorkshopLegalAgreement final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExternalUINode*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.ExternalUINode.ShowFloatingGamepadTextInput
// 0x0028 (0x0028 - 0x0000)
struct ExternalUINode_ShowFloatingGamepadTextInput final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESteamGamepadTextInputMode                    Mode;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              UpperLeft;                                         // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              LowerRight;                                        // 0x0014(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UExternalUINode*                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFriendsFunctions.FilterSteamFriends
// 0x0028 (0x0028 - 0x0000)
struct GolfItSteamFriendsFunctions_FilterSteamFriends final
{
public:
	TArray<struct FSteamFriend>                   OutFilteredFriends;                                // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSteamFriend>                   InFriends;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          IncludeOnline;                                     // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeOffline;                                    // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludePlayingGolfIt;                              // 0x0022(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeNotPlayingGolfIt;                           // 0x0023(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.GolfItSteamFriendsFunctions.IsPlayerStateFriend
// 0x0010 (0x0010 - 0x0000)
struct GolfItSteamFriendsFunctions_IsPlayerStateFriend final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.GolfItSteamFriendsFunctions.SendSessionInvite
// 0x0050 (0x0050 - 0x0000)
struct GolfItSteamFriendsFunctions_SendSessionInvite final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamFriend                           Friend;                                            // 0x0008(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EGenericOperationResult                       Result;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.GolfItSteamFriendsFunctions.SortSteamFriendsByName
// 0x0018 (0x0018 - 0x0000)
struct GolfItSteamFriendsFunctions_SortSteamFriendsByName final
{
public:
	TArray<struct FSteamFriend>                   SortedFriends;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Ascending;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.GolfItSteamFriendsFunctions.SwitchIsPlayerStateFriend
// 0x0010 (0x0010 - 0x0000)
struct GolfItSteamFriendsFunctions_SwitchIsPlayerStateFriend final
{
public:
	EGenericBoolResult                            Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           PlayerState;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.AddTimelineEvent
// 0x0040 (0x0040 - 0x0000)
struct GolfItSteamFunctions_AddTimelineEvent final
{
public:
	class FString                                 Icon;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Title;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartOffsetSeconds;                                // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.GolfItSteamFunctions.ClearAchievement
// 0x000C (0x000C - 0x0000)
struct GolfItSteamFunctions_ClearAchievement final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.GolfItSteamFunctions.ClearRichPresenceKey
// 0x0010 (0x0010 - 0x0000)
struct GolfItSteamFunctions_ClearRichPresenceKey final
{
public:
	class FString                                 Status;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.CloseSteamDeckKeyboard
// 0x0001 (0x0001 - 0x0000)
struct GolfItSteamFunctions_CloseSteamDeckKeyboard final
{
public:
	EGenericOperationResult                       Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.CloseSteamFloatingTextKeyboard
// 0x0001 (0x0001 - 0x0000)
struct GolfItSteamFunctions_CloseSteamFloatingTextKeyboard final
{
public:
	EGenericOperationResult                       Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.CurrentSteamControllerType
// 0x0008 (0x0008 - 0x0000)
struct GolfItSteamFunctions_CurrentSteamControllerType final
{
public:
	int32                                         GamepadIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESteamControllerType                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.GolfItSteamFunctions.GetCurrentBranchName
// 0x0010 (0x0010 - 0x0000)
struct GolfItSteamFunctions_GetCurrentBranchName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.GetSteamAppId
// 0x0004 (0x0004 - 0x0000)
struct GolfItSteamFunctions_GetSteamAppId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.GetSteamGameLanguageCode
// 0x0008 (0x0008 - 0x0000)
struct GolfItSteamFunctions_GetSteamGameLanguageCode final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.IsDevBranch
// 0x0001 (0x0001 - 0x0000)
struct GolfItSteamFunctions_IsDevBranch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.IsSteamDeck
// 0x0001 (0x0001 - 0x0000)
struct GolfItSteamFunctions_IsSteamDeck final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.IsSteamInitialised
// 0x0001 (0x0001 - 0x0000)
struct GolfItSteamFunctions_IsSteamInitialised final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.OpenSteamDeckKeyboard
// 0x0014 (0x0014 - 0x0000)
struct GolfItSteamFunctions_OpenSteamDeckKeyboard final
{
public:
	EGenericOperationResult                       Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         XPosition;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         YPostion;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.OpenSteamFloatingTextKeyboard
// 0x0014 (0x0014 - 0x0000)
struct GolfItSteamFunctions_OpenSteamFloatingTextKeyboard final
{
public:
	EGenericOperationResult                       Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESteamGamepadTextInputMode                    Mode;                                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              UpperLeft;                                         // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              LowerRight;                                        // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.SetRichPresence
// 0x0028 (0x0028 - 0x0000)
struct GolfItSteamFunctions_SetRichPresence final
{
public:
	class FString                                 Status;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Info;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenericOperationResult                       Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.GolfItSteamFunctions.SwitchIsDevBranch
// 0x0001 (0x0001 - 0x0000)
struct GolfItSteamFunctions_SwitchIsDevBranch final
{
public:
	EGenericBoolResult                            Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.SwitchIsSteamDeck
// 0x0001 (0x0001 - 0x0000)
struct GolfItSteamFunctions_SwitchIsSteamDeck final
{
public:
	EGenericBoolResult                            Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.GolfItSteamFunctions.SwitchIsSteamInitialised
// 0x0001 (0x0001 - 0x0000)
struct GolfItSteamFunctions_SwitchIsSteamInitialised final
{
public:
	EGenericBoolResult                            Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.InventoryBlueprintLibrary.GetGolfItBundleGeneratorHandleByRarity
// 0x0008 (0x0008 - 0x0000)
struct InventoryBlueprintLibrary_GetGolfItBundleGeneratorHandleByRarity final
{
public:
	ESteamInventoryItemRarity                     Rarity;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamInventoryItemDefinitionHandle    ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.InventoryBlueprintLibrary.GetGolfItCoinDefinitionHandle
// 0x0004 (0x0004 - 0x0000)
struct InventoryBlueprintLibrary_GetGolfItCoinDefinitionHandle final
{
public:
	struct FSteamInventoryItemDefinitionHandle    ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.InventoryBlueprintLibrary.GetGolfItCoinGeneratorHandleByRarity
// 0x0008 (0x0008 - 0x0000)
struct InventoryBlueprintLibrary_GetGolfItCoinGeneratorHandleByRarity final
{
public:
	ESteamInventoryItemRarity                     Rarity;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamInventoryItemDefinitionHandle    ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.InventoryBlueprintLibrary.GetGolfItCoinPriceForBundleGenerator
// 0x0008 (0x0008 - 0x0000)
struct InventoryBlueprintLibrary_GetGolfItCoinPriceForBundleGenerator final
{
public:
	ESteamInventoryItemRarity                     Rarity;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.InventoryBlueprintLibrary.GetGolfItCoinPriceForDirectPurchase
// 0x0008 (0x0008 - 0x0000)
struct InventoryBlueprintLibrary_GetGolfItCoinPriceForDirectPurchase final
{
public:
	ESteamInventoryItemRarity                     Rarity;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.InventoryBlueprintLibrary.GetGolfItPlayTimeGeneratorDefinitionHandle
// 0x0004 (0x0004 - 0x0000)
struct InventoryBlueprintLibrary_GetGolfItPlayTimeGeneratorDefinitionHandle final
{
public:
	struct FSteamInventoryItemDefinitionHandle    ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.InventoryBlueprintLibrary.IsGolfItCoinDefinition
// 0x0008 (0x0008 - 0x0000)
struct InventoryBlueprintLibrary_IsGolfItCoinDefinition final
{
public:
	struct FSteamInventoryItemDefinitionHandle    ItemDefinition;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.InventoryBlueprintLibrary.IsItemDefinitionHandleEqual
// 0x000C (0x000C - 0x0000)
struct InventoryBlueprintLibrary_IsItemDefinitionHandleEqual final
{
public:
	struct FSteamInventoryItemDefinitionHandle    A;                                                 // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamInventoryItemDefinitionHandle    B;                                                 // 0x0004(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.InventoryBlueprintLibrary.IsItemDefinitionHandleValid
// 0x0008 (0x0008 - 0x0000)
struct InventoryBlueprintLibrary_IsItemDefinitionHandleValid final
{
public:
	struct FSteamInventoryItemDefinitionHandle    Handle;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.InventoryBlueprintLibrary.IsItemInstanceHandleEqual
// 0x0018 (0x0018 - 0x0000)
struct InventoryBlueprintLibrary_IsItemInstanceHandleEqual final
{
public:
	struct FSteamInventoryItemInstanceHandle      A;                                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamInventoryItemInstanceHandle      B;                                                 // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.InventoryBlueprintLibrary.IsItemInstanceHandleValid
// 0x0010 (0x0010 - 0x0000)
struct InventoryBlueprintLibrary_IsItemInstanceHandleValid final
{
public:
	struct FSteamInventoryItemInstanceHandle      Handle;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.InventoryBlueprintLibrary.MakeSteamItemDefinitionHandle
// 0x0008 (0x0008 - 0x0000)
struct InventoryBlueprintLibrary_MakeSteamItemDefinitionHandle final
{
public:
	int32                                         ItemDefinitionId;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamInventoryItemDefinitionHandle    ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.InventoryBlueprintLibrary.SortInventoryAssetIDsByRarity
// 0x0018 (0x0018 - 0x0000)
struct InventoryBlueprintLibrary_SortInventoryAssetIDsByRarity final
{
public:
	TArray<struct FPrimaryAssetId>                InventoryItems;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Ascending;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.InventoryBlueprintLibrary.SortInventoryItemsByAcquiredAt
// 0x0018 (0x0018 - 0x0000)
struct InventoryBlueprintLibrary_SortInventoryItemsByAcquiredAt final
{
public:
	TArray<struct FSteamInventoryItem>            InventoryItems;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Ascending;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.InventoryBlueprintLibrary.SortInventoryItemsByRarity
// 0x0018 (0x0018 - 0x0000)
struct InventoryBlueprintLibrary_SortInventoryItemsByRarity final
{
public:
	TArray<struct FSteamInventoryItem>            InventoryItems;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Ascending;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.InventoryBlueprintLibrary.SwitchInventoryItemType
// 0x0014 (0x0014 - 0x0000)
struct InventoryBlueprintLibrary_SwitchInventoryItemType final
{
public:
	struct FPrimaryAssetId                        AssetID;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESteamInventoryItemType                       Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.SteamFriendListAsyncAction.AsyncReadFriendList
// 0x0010 (0x0010 - 0x0000)
struct SteamFriendListAsyncAction_AsyncReadFriendList final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USteamFriendListAsyncAction*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction GolfItSteam.SteamFriendListAsyncAction.OnReadFriendListDoneDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct SteamFriendListAsyncAction_OnReadFriendListDoneDelegate__DelegateSignature final
{
public:
	TArray<struct FSteamFriend>                   Friends;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.SteamInventoryFullUpdateRequest.RequestFullInventoryUpdate
// 0x0018 (0x0018 - 0x0000)
struct SteamInventoryFullUpdateRequest_RequestFullInventoryUpdate final
{
public:
	class USteamInventorySubsystem*               InventorySubsystem;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USteamInventoryFullUpdateRequest*       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamInventoryUpdateRequest.RequestAddPromoItem
// 0x0020 (0x0020 - 0x0000)
struct SteamInventoryUpdateRequest_RequestAddPromoItem final
{
public:
	class USteamInventorySubsystem*               InventorySubsystem;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamInventoryItemDefinitionHandle    ItemDefinitionHandle;                              // 0x0010(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamInventoryUpdateRequest*           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamInventoryUpdateRequest.RequestConsumeItem
// 0x0028 (0x0028 - 0x0000)
struct SteamInventoryUpdateRequest_RequestConsumeItem final
{
public:
	class USteamInventorySubsystem*               InventorySubsystem;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamInventoryItemInstanceHandle      ItemHandle;                                        // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamInventoryUpdateRequest*           ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamInventoryUpdateRequest.RequestDropPlaytimeItem
// 0x0020 (0x0020 - 0x0000)
struct SteamInventoryUpdateRequest_RequestDropPlaytimeItem final
{
public:
	class USteamInventorySubsystem*               InventorySubsystem;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamInventoryItemDefinitionHandle    ItemDefinitionHandle;                              // 0x0010(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamInventoryUpdateRequest*           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamInventoryUpdateRequest.RequestExchangeItem
// 0x0030 (0x0030 - 0x0000)
struct SteamInventoryUpdateRequest_RequestExchangeItem final
{
public:
	class USteamInventorySubsystem*               InventorySubsystem;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamInventoryItemDefinitionHandle    NewItemHandle;                                     // 0x0010(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewItemQuantity;                                   // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamInventoryItemInstanceHandle      ConsumingItemHandle;                               // 0x0018(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConsumingItemQuantity;                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamInventoryUpdateRequest*           ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamInventoryUpdateRequest.RequestSplitItemStack
// 0x0028 (0x0028 - 0x0000)
struct SteamInventoryUpdateRequest_RequestSplitItemStack final
{
public:
	class USteamInventorySubsystem*               InventorySubsystem;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamInventoryItemInstanceHandle      ItemHandle;                                        // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamInventoryUpdateRequest*           ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamInventoryUpdateRequest.RequestTransferItemStack
// 0x0030 (0x0030 - 0x0000)
struct SteamInventoryUpdateRequest_RequestTransferItemStack final
{
public:
	class USteamInventorySubsystem*               InventorySubsystem;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamInventoryItemInstanceHandle      SourceItemHandle;                                  // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamInventoryItemInstanceHandle      DestinationItemHandle;                             // 0x0018(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamInventoryUpdateRequest*           ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction GolfItSteam.SteamInventoryUpdateRequest.DoneDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct SteamInventoryUpdateRequest_DoneDelegate__DelegateSignature final
{
public:
	TArray<struct FSteamInventoryUpdateChange>    ChangeList;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamInventorySubsystem.GetItemDefinitionSteamProperty
// 0x0028 (0x0028 - 0x0000)
struct SteamInventorySubsystem_GetItemDefinitionSteamProperty final
{
public:
	EGenericOperationResult                       OutResult;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamInventoryItemDefinitionHandle    Handle;                                            // 0x0004(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Property;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamInventorySubsystem.GetInventoryItemByItemDefinitionHandle
// 0x0030 (0x0030 - 0x0000)
struct SteamInventorySubsystem_GetInventoryItemByItemDefinitionHandle final
{
public:
	struct FSteamInventoryItem                    OutItem;                                           // 0x0000(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	ESearchResult                                 Result;                                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamInventoryItemDefinitionHandle    Handle;                                            // 0x002C(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamInventorySubsystem.GetInventoryItemByPrimaryAssetID
// 0x0040 (0x0040 - 0x0000)
struct SteamInventorySubsystem_GetInventoryItemByPrimaryAssetID final
{
public:
	struct FSteamInventoryItem                    OutItem;                                           // 0x0000(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	ESearchResult                                 Result;                                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        ID;                                                // 0x002C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GolfItSteam.SteamInventorySubsystem.GetInventoryItemsByPrimaryAssetType
// 0x0018 (0x0018 - 0x0000)
struct SteamInventorySubsystem_GetInventoryItemsByPrimaryAssetType final
{
public:
	TArray<struct FSteamInventoryItem>            OutItems;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPrimaryAssetType                      Type;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamInventorySubsystem.GetTotalQuantityByItemDefinitionHandle
// 0x0008 (0x0008 - 0x0000)
struct SteamInventorySubsystem_GetTotalQuantityByItemDefinitionHandle final
{
public:
	struct FSteamInventoryItemDefinitionHandle    Handle;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamInventorySubsystem.HasReceivedFullUpdate
// 0x0001 (0x0001 - 0x0000)
struct SteamInventorySubsystem_HasReceivedFullUpdate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamInventorySubsystem.HasReceivedItemDefinitions
// 0x0001 (0x0001 - 0x0000)
struct SteamInventorySubsystem_HasReceivedItemDefinitions final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamLeaderboardDownloadNodes.DownloadLeaderboard
// 0x0020 (0x0020 - 0x0000)
struct SteamLeaderboardDownloadNodes_DownloadLeaderboard final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Param_Name;                                        // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FirstRank;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastRank;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USteamLeaderboardDownloadNodes*         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction GolfItSteam.SteamLeaderboardDownloadNodes.DoneDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct SteamLeaderboardDownloadNodes_DoneDelegate__DelegateSignature final
{
public:
	TArray<struct FLeaderboardRow>                SortedRows;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamStatsNodes.GetNumCurrentPlayers
// 0x0010 (0x0010 - 0x0000)
struct SteamStatsNodes_GetNumCurrentPlayers final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USteamStatsNodes*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.SteamStatsNodes.GetUserStat
// 0x0018 (0x0018 - 0x0000)
struct SteamStatsNodes_GetUserStat final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Param_Name;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USteamStatsNodes*                       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction GolfItSteam.SteamStatsNodes.DoneDelegate__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SteamStatsNodes_DoneDelegate__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.UGCBaseQuerySettings.SetMaxCacheAge
// 0x0004 (0x0004 - 0x0000)
struct UGCBaseQuerySettings_SetMaxCacheAge final
{
public:
	int32                                         Seconds;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.UGCBaseQuerySettings.SetPageNumber
// 0x0004 (0x0004 - 0x0000)
struct UGCBaseQuerySettings_SetPageNumber final
{
public:
	int32                                         PageNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.UGCBaseQuerySettings.SetPlaytimeStatsDuration
// 0x0004 (0x0004 - 0x0000)
struct UGCBaseQuerySettings_SetPlaytimeStatsDuration final
{
public:
	int32                                         Days;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.UGCBaseQuerySettings.SetReturnAdditionalPreviews
// 0x0001 (0x0001 - 0x0000)
struct UGCBaseQuerySettings_SetReturnAdditionalPreviews final
{
public:
	bool                                          ReturnAdditionalPreviews;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GolfItSteam.UGCBaseQuerySettings.SetReturnChildren
// 0x0001 (0x0001 - 0x0000)
struct UGCBaseQuerySettings_SetReturnChildren final
{
public:
	bool                                          ReturnChildren;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

