#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: GolfIt

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "LuaMachine_structs.hpp"
#include "Voxel_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum GolfIt.EEditor2CustomUserAssetType
// NumValues: 0x0006
enum class EEditor2CustomUserAssetType : uint8
{
	Invalid                                  = 0,
	Script                                   = 1,
	Sound                                    = 2,
	Mesh                                     = 3,
	Texture                                  = 4,
	EEditor2CustomUserAssetType_MAX          = 5,
};

// Enum GolfIt.EEditor2CustomAssetDataLocation
// NumValues: 0x0004
enum class EEditor2CustomAssetDataLocation : uint8
{
	User                                     = 0,
	Workshop                                 = 1,
	Map                                      = 2,
	EEditor2CustomAssetDataLocation_MAX      = 3,
};

// Enum GolfIt.EEditor2Mode
// NumValues: 0x000A
enum class EEditor2Mode : uint8
{
	Selection                                = 0,
	Transformation                           = 1,
	Placing                                  = 2,
	MovingCamera                             = 3,
	Scripting                                = 4,
	EyeDropper                               = 5,
	PlayTest                                 = 6,
	FoliagePainter                           = 7,
	TerrainEditor                            = 8,
	EEditor2Mode_MAX                         = 9,
};

// Enum GolfIt.EGolfItBallBounceType
// NumValues: 0x0004
enum class EGolfItBallBounceType : uint8
{
	NotBouncy                                = 0,
	NormalBouncy                             = 1,
	VeryBouncy                               = 2,
	EGolfItBallBounceType_MAX                = 3,
};

// Enum GolfIt.EGolfItBallRollType
// NumValues: 0x0005
enum class EGolfItBallRollType : uint8
{
	VeryLow                                  = 0,
	Low                                      = 1,
	Normal                                   = 2,
	High                                     = 3,
	EGolfItBallRollType_MAX                  = 4,
};

// Enum GolfIt.EHotSeatPlayerRotation
// NumValues: 0x0006
enum class EHotSeatPlayerRotation : uint8
{
	FirstPlayerStarts                        = 0,
	IncrementEachHole                        = 1,
	LastPlayerFinishedStarts                 = 2,
	BestScoreStarts                          = 3,
	Random                                   = 4,
	EHotSeatPlayerRotation_MAX               = 5,
};

// Enum GolfIt.EGolfItPlayMode
// NumValues: 0x0009
enum class EGolfItPlayMode : uint8
{
	Practice                                 = 0,
	Easy                                     = 1,
	Hard                                     = 2,
	Classic                                  = 3,
	HoleInOne                                = 4,
	Race                                     = 5,
	Custom                                   = 6,
	Competitive                              = 7,
	EGolfItPlayMode_MAX                      = 8,
};

// Enum GolfIt.EGolfItMidRoundScoreSetting
// NumValues: 0x0008
enum class EGolfItMidRoundScoreSetting : uint8
{
	WorstScore                               = 0,
	MedianScore                              = 1,
	RandomScore                              = 2,
	AverageScore                             = 3,
	BestScore                                = 4,
	OutOfStrokeScore                         = 5,
	SpectatorOnly                            = 6,
	EGolfItMidRoundScoreSetting_MAX          = 7,
};

// Enum GolfIt.EEditor2SavegameLoadingError
// NumValues: 0x0006
enum class EEditor2SavegameLoadingError : uint8
{
	None                                     = 0,
	InvalidContextObject                     = 1,
	InvalidSavegameClass                     = 2,
	LoadingFailed                            = 3,
	CreatingNewSavegameObjectFailed          = 4,
	EEditor2SavegameLoadingError_MAX         = 5,
};

// Enum GolfIt.EEditor2FoliagePainterMode
// NumValues: 0x0003
enum class EEditor2FoliagePainterMode : uint8
{
	Add                                      = 0,
	Remove                                   = 1,
	EEditor2FoliagePainterMode_MAX           = 2,
};

// Enum GolfIt.ELobbyPlayerFinishHoleResult
// NumValues: 0x0006
enum class ELobbyPlayerFinishHoleResult : uint8
{
	ReachedGoal                              = 0,
	OutOfStrokes                             = 1,
	OutOfTime                                = 2,
	Surrender                                = 3,
	Forced                                   = 4,
	ELobbyPlayerFinishHoleResult_MAX         = 5,
};

// Enum GolfIt.ELobbyPlayerPlayState
// NumValues: 0x000C
enum class ELobbyPlayerPlayState : uint8
{
	Connecting                               = 0,
	DownloadingMap                           = 1,
	LoadingMap                               = 2,
	WaitingLobbyNotReady                     = 3,
	WaitingLobbyReady                        = 4,
	Starting                                 = 5,
	WaitingNextHole                          = 6,
	PlayingHole                              = 7,
	FinishedHole                             = 8,
	WaitingEnd                               = 9,
	End                                      = 10,
	ELobbyPlayerPlayState_MAX                = 11,
};

// Enum GolfIt.EGolfItGameType
// NumValues: 0x0004
enum class EGolfItGameType : uint8
{
	Singleplayer                             = 0,
	Hotseat                                  = 1,
	Multiplayer                              = 2,
	EGolfItGameType_MAX                      = 3,
};

// Enum GolfIt.EGolfItPlayState
// NumValues: 0x0005
enum class EGolfItPlayState : uint8
{
	Waiting                                  = 0,
	Starting                                 = 1,
	Playing                                  = 2,
	Finished                                 = 3,
	EGolfItPlayState_MAX                     = 4,
};

// Enum GolfIt.EJoinSessionResult
// NumValues: 0x0007
enum class EJoinSessionResult : uint8
{
	Success                                  = 0,
	SessionIsFull                            = 1,
	SessionDoesNotExist                      = 2,
	CouldNotRetrieveAddress                  = 3,
	AlreadyInSession                         = 4,
	UnknownError                             = 5,
	EJoinSessionResult_MAX                   = 6,
};

// Enum GolfIt.ESessionSearchEmptyFilter
// NumValues: 0x0004
enum class ESessionSearchEmptyFilter : uint8
{
	OnlyEmpty                                = 0,
	OnlyNonEmpty                             = 1,
	All                                      = 2,
	ESessionSearchEmptyFilter_MAX            = 3,
};

// Enum GolfIt.ESessionSearchMapTypeFilter
// NumValues: 0x0004
enum class ESessionSearchMapTypeFilter : uint8
{
	OnlyOfficial                             = 0,
	OnlyCustom                               = 1,
	All                                      = 2,
	ESessionSearchMapTypeFilter_MAX          = 3,
};

// Enum GolfIt.EGolfItMapType
// NumValues: 0x0005
enum class EGolfItMapType : uint8
{
	Undefined                                = 0,
	Official                                 = 1,
	LocalCustom                              = 2,
	WorkshopCustom                           = 3,
	EGolfItMapType_MAX                       = 4,
};

// Enum GolfIt.EGolfItMapSorting
// NumValues: 0x0009
enum class EGolfItMapSorting : uint8
{
	None                                     = 0,
	DisplayName                              = 1,
	CreatedAt                                = 2,
	UpdatedAt                                = 3,
	SubscribedAt                             = 4,
	UpVoteRatio                              = 5,
	DownVoteRatio                            = 6,
	TotalVotes                               = 7,
	EGolfItMapSorting_MAX                    = 8,
};

// Enum GolfIt.ECustomItemType
// NumValues: 0x0008
enum class ECustomItemType : uint8
{
	Undefined                                = 0,
	Asset                                    = 1,
	Audio                                    = 2,
	Blueprint                                = 3,
	Collection                               = 4,
	Map                                      = 5,
	Material                                 = 6,
	ECustomItemType_MAX                      = 7,
};

// Enum GolfIt.EGolfItMouseCaptureMode
// NumValues: 0x0006
enum class EGolfItMouseCaptureMode : uint8
{
	NoCapture                                = 0,
	CapturePermanently                       = 1,
	CapturePermanently_IncludingInitialMouseDown = 2,
	CaptureDuringMouseDown                   = 3,
	CaptureDuringRightMouseDown              = 4,
	EGolfItMouseCaptureMode_MAX              = 5,
};

// Enum GolfIt.EGolfItInputMode
// NumValues: 0x0004
enum class EGolfItInputMode : uint8
{
	GameAndMenu                              = 0,
	Game                                     = 1,
	Menu                                     = 2,
	EGolfItInputMode_MAX                     = 3,
};

// Enum GolfIt.EPuttingMethod
// NumValues: 0x0003
enum class EPuttingMethod : uint8
{
	Hold                                     = 0,
	Toggle                                   = 1,
	EPuttingMethod_MAX                       = 2,
};

// Enum GolfIt.EBallTrailVisibility
// NumValues: 0x0005
enum class EBallTrailVisibility : uint8
{
	None                                     = 0,
	OnlyNonIntrusiveTrails                   = 1,
	ForceDefaultTrails                       = 2,
	All                                      = 3,
	EBallTrailVisibility_MAX                 = 4,
};

// Enum GolfIt.EEditorMusicOption
// NumValues: 0x0004
enum class EEditorMusicOption : uint8
{
	None                                     = 0,
	Default                                  = 1,
	Custom                                   = 2,
	EEditorMusicOption_MAX                   = 3,
};

// Enum GolfIt.EOtherGoalEffectVisibility
// NumValues: 0x0004
enum class EOtherGoalEffectVisibility : uint8
{
	Never                                    = 0,
	OnlyOnSpectate                           = 1,
	Always                                   = 2,
	EOtherGoalEffectVisibility_MAX           = 3,
};

// Enum GolfIt.EOtherPutterVisibility
// NumValues: 0x0004
enum class EOtherPutterVisibility : uint8
{
	Never                                    = 0,
	OnlyOnSpectate                           = 1,
	Always                                   = 2,
	EOtherPutterVisibility_MAX               = 3,
};

// Enum GolfIt.EPutterSwingType
// NumValues: 0x0003
enum class EPutterSwingType : uint8
{
	Rotational                               = 0,
	Straight                                 = 1,
	EPutterSwingType_MAX                     = 2,
};

// Enum GolfIt.EShopItemType
// NumValues: 0x0003
enum class EShopItemType : uint8
{
	Featured                                 = 0,
	Limited                                  = 1,
	EShopItemType_MAX                        = 2,
};

// Enum GolfIt.EGoalTypes
// NumValues: 0x0007
enum class EGoalTypes : uint8
{
	Flag                                     = 0,
	GateWithBar                              = 1,
	GateSolo                                 = 2,
	RingWithBar                              = 3,
	RingSolo                                 = 4,
	Gong                                     = 5,
	EGoalTypes_MAX                           = 6,
};

// Enum GolfIt.EWaterShape
// NumValues: 0x0003
enum class EWaterShape : uint8
{
	Square                                   = 0,
	Circular                                 = 1,
	EWaterShape_MAX                          = 2,
};

// Enum GolfIt.EWaterfallType
// NumValues: 0x0006
enum class EWaterfallType : uint8
{
	Waterfall1                               = 0,
	Waterfall2                               = 1,
	Waterfall3                               = 2,
	Waterfall4                               = 3,
	Waterfall5                               = 4,
	EWaterfallType_MAX                       = 5,
};

// Enum GolfIt.EDeviceVisibility
// NumValues: 0x0005
enum class EDeviceVisibility : uint8
{
	None                                     = 0,
	MouseAndKeyboard                         = 1,
	Gamepad                                  = 2,
	Touch                                    = 4,
	EDeviceVisibility_MAX                    = 5,
};

// Enum GolfIt.EGolfItBaseMaterialTypes
// NumValues: 0x0009
enum class EGolfItBaseMaterialTypes : uint8
{
	None                                     = 0,
	Color                                    = 1,
	ColorNormal                              = 2,
	PBR                                      = 3,
	Emissive                                 = 4,
	Masked                                   = 5,
	Translucent                              = 6,
	WorldAligned                             = 7,
	Max                                      = 8,
};

// Enum GolfIt.EEditor2CreateEditorActionOutputPins
// NumValues: 0x0003
enum class EEditor2CreateEditorActionOutputPins : uint8
{
	IsValid                                  = 0,
	IsNotValid                               = 1,
	EEditor2CreateEditorActionOutputPins_MAX = 2,
};

// Enum GolfIt.EEditor2LuaParameterType
// NumValues: 0x0007
enum class EEditor2LuaParameterType : uint8
{
	Type                                     = 0,
	Interval                                 = 1,
	GlobalVar                                = 2,
	TriggerShape                             = 3,
	Parameter                                = 4,
	Count                                    = 5,
	EEditor2LuaParameterType_MAX             = 6,
};

// Enum GolfIt.EEditor2LuaFunctionType
// NumValues: 0x0004
enum class EEditor2LuaFunctionType : uint8
{
	Periodic                                 = 0,
	EventDriven                              = 1,
	Trigger                                  = 2,
	EEditor2LuaFunctionType_MAX              = 3,
};

// Enum GolfIt.EEditor2SaveGameState
// NumValues: 0x0004
enum class EEditor2SaveGameState : uint8
{
	Nothing                                  = 0,
	Loading                                  = 1,
	Saving                                   = 2,
	EEditor2SaveGameState_MAX                = 3,
};

// Enum GolfIt.EEditor2EditScriptAssetButtonType
// NumValues: 0x0003
enum class EEditor2EditScriptAssetButtonType : uint8
{
	Edit                                     = 0,
	Duplicate                                = 1,
	EEditor2EditScriptAssetButtonType_MAX    = 2,
};

// Enum GolfIt.EEditor2ListEntryType
// NumValues: 0x0004
enum class EEditor2ListEntryType : uint8
{
	Default                                  = 0,
	Group                                    = 1,
	Child                                    = 2,
	EEditor2ListEntryType_MAX                = 3,
};

// Enum GolfIt.EEditor2VoxelTerrainModifier
// NumValues: 0x0005
enum class EEditor2VoxelTerrainModifier : uint8
{
	Add                                      = 0,
	Remove                                   = 1,
	Smooth                                   = 2,
	Flatten                                  = 3,
	EEditor2VoxelTerrainModifier_MAX         = 4,
};

// Enum GolfIt.EEditor2VoxelTerrainMode
// NumValues: 0x0004
enum class EEditor2VoxelTerrainMode : uint8
{
	WorldSettings                            = 0,
	Editing                                  = 1,
	SurfacePainting                          = 2,
	EEditor2VoxelTerrainMode_MAX             = 3,
};

// Enum GolfIt.EEditor2SavegameRelation
// NumValues: 0x0003
enum class EEditor2SavegameRelation : uint8
{
	UserRelated                              = 0,
	MapRelated                               = 1,
	EEditor2SavegameRelation_MAX             = 2,
};

// Enum GolfIt.EEditor2SavegameType
// NumValues: 0x0005
enum class EEditor2SavegameType : uint8
{
	CustomAssets                             = 0,
	MetaData                                 = 1,
	PlacedObjects                            = 2,
	VoxelTerrain                             = 3,
	EEditor2SavegameType_MAX                 = 4,
};

// Enum GolfIt.EEditor2PlaceableObjectType
// NumValues: 0x0009
enum class EEditor2PlaceableObjectType : uint8
{
	Undefined                                = 0,
	StaticMesh                               = 1,
	Script                                   = 2,
	Actor                                    = 3,
	Particle                                 = 4,
	Volume                                   = 5,
	Light                                    = 6,
	Count                                    = 7,
	EEditor2PlaceableObjectType_MAX          = 8,
};

// Enum GolfIt.EEditor2NumericPropertyWidgetType
// NumValues: 0x0003
enum class EEditor2NumericPropertyWidgetType : uint8
{
	Textbox                                  = 0,
	Slider                                   = 1,
	EEditor2NumericPropertyWidgetType_MAX    = 2,
};

// Enum GolfIt.EEditor2VariableType
// NumValues: 0x000F
enum class EEditor2VariableType : uint8
{
	Empty                                    = 0,
	Bool                                     = 1,
	Float                                    = 2,
	Int                                      = 3,
	Enum                                     = 4,
	Color                                    = 5,
	RestrictedText                           = 6,
	UserText                                 = 7,
	Vector2D                                 = 8,
	Vector3D                                 = 9,
	Hyperlink                                = 10,
	Transform                                = 11,
	Header                                   = 12,
	ActionList                               = 13,
	EEditor2VariableType_MAX                 = 14,
};

// Enum GolfIt.EPrimitiveComponentType
// NumValues: 0x0005
enum class EPrimitiveComponentType : uint8
{
	Static                                   = 0,
	Skeletal                                 = 1,
	Collision                                = 2,
	Default                                  = 3,
	EPrimitiveComponentType_MAX              = 4,
};

// Enum GolfIt.EEditor2DebugPrintVariableType
// NumValues: 0x0008
enum class EEditor2DebugPrintVariableType : uint8
{
	String                                   = 0,
	Boolean                                  = 1,
	Float                                    = 2,
	Int                                      = 3,
	UObject                                  = 4,
	ObjectInstance                           = 5,
	LuaValue                                 = 6,
	EEditor2DebugPrintVariableType_MAX       = 7,
};

// Enum GolfIt.EEditor2DebugPrintType
// NumValues: 0x0004
enum class EEditor2DebugPrintType : uint8
{
	SimpleText                               = 0,
	VariableValue                            = 1,
	Array                                    = 2,
	EEditor2DebugPrintType_MAX               = 3,
};

// Enum GolfIt.EEditor2ObjectArea
// NumValues: 0x0009
enum class EEditor2ObjectArea : uint8
{
	Grassland                                = 0,
	Winterland                               = 1,
	Graveyard                                = 2,
	Mines                                    = 3,
	PiratesCove                              = 4,
	JadeTemple                               = 5,
	DeepBlue                                 = 6,
	Count                                    = 7,
	EEditor2ObjectArea_MAX                   = 8,
};

// Enum GolfIt.EEditor2Category
// NumValues: 0x0008
enum class EEditor2Category : uint8
{
	Undefined                                = 0,
	Lanes                                    = 1,
	Scripts                                  = 2,
	Environment                              = 3,
	Special                                  = 4,
	Effects                                  = 5,
	Lights                                   = 6,
	EEditor2Category_MAX                     = 7,
};

// Enum GolfIt.EEditor2ActionType
// NumValues: 0x0014
enum class EEditor2ActionType : uint8
{
	Undefined                                = 0,
	PlaceObject                              = 1,
	SelectObject                             = 2,
	TransformObject                          = 3,
	UnselectAllObjects                       = 4,
	MultiSelectObject                        = 5,
	UnselectObject                           = 6,
	DeleteObject                             = 7,
	Group                                    = 8,
	Ungroup                                  = 9,
	EditParam                                = 10,
	EditUserScript                           = 11,
	EditMapScript                            = 12,
	ResetParams                              = 13,
	AddFoliage                               = 14,
	RemoveFoliage                            = 15,
	EditVoxelTerrain                         = 16,
	UpdateVoxelWorldSettings                 = 17,
	PaintVoxelSurface                        = 18,
	EEditor2ActionType_MAX                   = 19,
};

// Enum GolfIt.EEditor2TransformationAxis
// NumValues: 0x0004
enum class EEditor2TransformationAxis : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	EEditor2TransformationAxis_MAX           = 3,
};

// Enum GolfIt.EEditor2TransformationType
// NumValues: 0x0004
enum class EEditor2TransformationType : uint8
{
	Translation                              = 0,
	Rotation                                 = 1,
	Scale                                    = 2,
	EEditor2TransformationType_MAX           = 3,
};

// Enum GolfIt.ELargeDataTransferConnectionState
// NumValues: 0x0006
enum class ELargeDataTransferConnectionState : uint8
{
	None                                     = 0,
	Handshake                                = 1,
	WaitingForMagic                          = 2,
	Connected                                = 3,
	Failure                                  = 4,
	ELargeDataTransferConnectionState_MAX    = 5,
};

// Enum GolfIt.EFlagTypes
// NumValues: 0x0004
enum class EFlagTypes : uint8
{
	Triangle                                 = 0,
	Square                                   = 1,
	SquareWithLogo                           = 2,
	EFlagTypes_MAX                           = 3,
};

// Enum GolfIt.EGolfBallStatus
// NumValues: 0x0006
enum class EGolfBallStatus : uint8
{
	Idle                                     = 0,
	Rolling                                  = 1,
	Aiming                                   = 2,
	Occupied                                 = 3,
	Finished                                 = 4,
	EGolfBallStatus_MAX                      = 5,
};

// Enum GolfIt.EInputBindingCategory
// NumValues: 0x0004
enum class EInputBindingCategory : uint8
{
	Game                                     = 0,
	Editor                                   = 1,
	VR                                       = 2,
	EInputBindingCategory_MAX                = 3,
};

// Enum GolfIt.EGolfItSettingLayoutType
// NumValues: 0x0004
enum class EGolfItSettingLayoutType : uint8
{
	Vertical                                 = 0,
	Horizontal                               = 1,
	Title                                    = 2,
	EGolfItSettingLayoutType_MAX             = 3,
};

// Enum GolfIt.EDisplayWaterType
// NumValues: 0x0004
enum class EDisplayWaterType : uint8
{
	None                                     = 0,
	Transparent                              = 1,
	Dark                                     = 2,
	EDisplayWaterType_MAX                    = 3,
};

// Enum GolfIt.EWaterType
// NumValues: 0x0003
enum class EWaterType : uint8
{
	Air                                      = 0,
	Water                                    = 1,
	EWaterType_MAX                           = 2,
};

// Enum GolfIt.ELobbyPlayerStateSorting
// NumValues: 0x0006
enum class ELobbyPlayerStateSorting : uint8
{
	NumCurrentStrokes                        = 0,
	StrokeScore                              = 1,
	LastHoleTime                             = 2,
	StartTimeHostFirst                       = 3,
	CompetitiveScore                         = 4,
	ELobbyPlayerStateSorting_MAX             = 5,
};

// Enum GolfIt.EBasePlayerStateSorting
// NumValues: 0x0004
enum class EBasePlayerStateSorting : uint8
{
	StartTime                                = 0,
	Name                                     = 1,
	Ping                                     = 2,
	EBasePlayerStateSorting_MAX              = 3,
};

// Enum GolfIt.ECustomImageFormats
// NumValues: 0x0007
enum class ECustomImageFormats : uint8
{
	JPG                                      = 0,
	PNG                                      = 1,
	BMP                                      = 2,
	ICO                                      = 3,
	EXR                                      = 4,
	ICNS                                     = 5,
	ECustomImageFormats_MAX                  = 6,
};

// ScriptStruct GolfIt.Editor2MeshComponentData
// 0x0050 (0x0050 - 0x0000)
struct FEditor2MeshComponentData final
{
public:
	struct FTransform                             RelTransform;                                      // 0x0000(0x0030)(BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UStaticMesh*                            Mesh;                                              // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MaterialOverride;                                  // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        ComponentToAttachTo;                               // 0x0040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GolfIt.Editor2PlaceableObjectInstance
// 0x0018 (0x0018 - 0x0000)
struct FEditor2PlaceableObjectInstance final
{
public:
	class FString                                 ObjectID;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InstanceID;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GolfIt.Editor2ParamValue
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FEditor2ParamValue final
{
public:
	EEditor2VariableType                          Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GolfIt.Editor2ParamValues
// 0x0020 (0x0020 - 0x0000)
struct FEditor2ParamValues final
{
public:
	TArray<class FName>                           Names;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FEditor2ParamValue>             Values;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.ShopItem
// 0x0028 (0x0028 - 0x0000)
struct FShopItem final
{
public:
	struct FPrimaryAssetId                        MAssetId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MItemDefinitionId;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EShopItemType                                 MItemType;                                         // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              MDuration;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MPriceOverride;                                    // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GolfIt.Editor2PlaceableObjectInstances
// 0x0010 (0x0010 - 0x0000)
struct FEditor2PlaceableObjectInstances final
{
public:
	TArray<struct FEditor2PlaceableObjectInstance> ObjectInstances;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2ScriptParameter
// 0x0050 (0x0050 - 0x0000)
struct FEditor2ScriptParameter final
{
public:
	class FString                                 ParameterName;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              LuaValue;                                          // 0x0010(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2AssetProperties
// 0x0020 (0x0020 - 0x0000)
struct FEditor2AssetProperties final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCustomAsset;                                     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomID;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2FoliageInstances
// 0x0010 (0x0010 - 0x0000)
struct FEditor2FoliageInstances final
{
public:
	TArray<struct FTransform>                     Transforms;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2CustomAssetProperties
// 0x0018 (0x0018 - 0x0000)
struct FEditor2CustomAssetProperties final
{
public:
	class FString                                 CustomName;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.GolfItActionBindingRow
// 0x0030 (0x0030 - 0x0000)
struct FGolfItActionBindingRow final
{
public:
	class FName                                   MActionName;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   MDisplayText;                                      // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           MKeyBindings;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2VoxelActionHistory
// 0x0018 (0x0018 - 0x0000)
struct FEditor2VoxelActionHistory final
{
public:
	bool                                          bIsSynced;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HistoryPosition;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UGolfItEditor2VoxelWorldAction*> Actions;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2PlaceableObjectProperties
// 0x0090 (0x0090 - 0x0000)
struct FEditor2PlaceableObjectProperties final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EEditor2Category                              Category;                                          // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEditor2PlaceableObjectType                   ObjectType;                                        // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EEditor2ObjectArea>                    AreasToUse;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              UITexture;                                         // 0x0030(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   PlaceableObjectClass;                              // 0x0058(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowNamingPopUpWidget;                            // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTrySnapping;                                      // 0x0081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketNameForSnapping;                             // 0x0084(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GolfIt.ReplicatedMapInfo
// 0x0018 (0x0018 - 0x0000)
struct FReplicatedMapInfo final
{
public:
	uint8                                         MMapType;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MMapHandle;                                        // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2PlaceableObjectPropertiesArray
// 0x0050 (0x0050 - 0x0000)
struct FEditor2PlaceableObjectPropertiesArray final
{
public:
	TMap<class FString, struct FEditor2PlaceableObjectProperties> PlaceableObjectPropertiesArray;                    // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2Savegames
// 0x0010 (0x0010 - 0x0000)
struct FEditor2Savegames final
{
public:
	TArray<class USaveGame*>                      SavegameObjects;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2ObjectInstanceIDs
// 0x0038 (0x0038 - 0x0000)
struct FEditor2ObjectInstanceIDs final
{
public:
	class FString                                 ObjectID;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CustomID;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 InstanceIDs;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.SessionFindResult
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FSessionFindResult final
{
public:
	class FName                                   MServerName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MNumPlayers;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MNumSlots;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MGameVersion;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MMapName;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MIsPasswordRequired;                               // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MPing;                                             // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MSessionID;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MMatchInProgress;                                  // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MCurrentHole;                                      // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MLastHole;                                         // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MIsAllowedToJoinMidRound;                          // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x13];                                      // 0x003D(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GolfIt.Editor2PlaceableObjectInstanceData
// 0x0060 (0x0060 - 0x0000)
struct FEditor2PlaceableObjectInstanceData final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         Actors;                                            // 0x0030(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        Objects;                                           // 0x0040(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 ObjectPropertyIds;                                 // 0x0050(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2QueuedPlaceableObjectInstance
// 0x0070 (0x0070 - 0x0000)
struct FEditor2QueuedPlaceableObjectInstance final
{
public:
	struct FEditor2PlaceableObjectInstanceData    Data;                                              // 0x0000(0x0060)(NativeAccessSpecifierPublic)
	bool                                          PlayAnim;                                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0xF];                                       // 0x0061(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GolfIt.GolfItActionBindingHandle
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FGolfItActionBindingHandle final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GolfIt.Editor2FoliagePainterSettings
// 0x002C (0x002C - 0x0000)
struct FEditor2FoliagePainterSettings final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEditor2FoliagePainterMode                    FoliagePainterMode;                                // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Density;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnRate;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsYawRandom;                                       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FixedYaw;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ScaleRange;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldAlignToGround;                               // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SlopeRange;                                        // 0x0024(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2CamInputDirections
// 0x0004 (0x0004 - 0x0000)
struct FEditor2CamInputDirections final
{
public:
	bool                                          Forward;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Backward;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Right;                                             // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Left;                                              // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2CamInput
// 0x0008 (0x0008 - 0x0000)
struct FEditor2CamInput final
{
public:
	float                                         Forward;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Right;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.GolfItBasePlayerStateClientOptions
// 0x0014 (0x0014 - 0x0000)
struct FGolfItBasePlayerStateClientOptions final
{
public:
	uint8                                         MIsVRPlayer : 1;                                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         MIsSteamDeckPlayer : 1;                            // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           MPlayerColor;                                      // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.WaterScalarMaterialParameters
// 0x0014 (0x0014 - 0x0000)
struct FWaterScalarMaterialParameters final
{
public:
	float                                         MGlobalOpacity;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MWaterDepth;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MHighlightDensity;                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MCubeMapIntensity;                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MReflectionAngle;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.WaterColor
// 0x0060 (0x0060 - 0x0000)
struct FWaterColor final
{
public:
	struct FLinearColor                           MBaseColor;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MFarColor;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MShallowWaterColor;                                // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MSSSColor;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MTroughColor;                                      // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MHighlightColor;                                   // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.WaterfallScalarMaterialParameters
// 0x000C (0x000C - 0x0000)
struct FWaterfallScalarMaterialParameters final
{
public:
	float                                         MFlowSpeed;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MCubeMapIntensity;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MReflectionAngle;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.WaterfallColor
// 0x0040 (0x0040 - 0x0000)
struct FWaterfallColor final
{
public:
	struct FLinearColor                           MBaseColor;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MFarColor;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MSSSColor;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MFoamColor;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.GolfItCustomMaterial
// 0x0108 (0x0108 - 0x0000)
struct FGolfItCustomMaterial final
{
public:
	EGolfItBaseMaterialTypes                      MBaseMaterialType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              MBaseMaterial;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      MScalarParameters;                                 // 0x0010(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, struct FLinearColor>        MVectorParameters;                                 // 0x0060(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, class FString>              MTextureParameters;                                // 0x00B0(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	class UPhysicalMaterial*                      MPhysicalMaterial;                                 // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.GolfItGameTextureRow
// 0x0048 (0x0050 - 0x0008)
struct FGolfItGameTextureRow final : public FTableRowBase
{
public:
	class FText                                   DisplayText;                                       // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          IsNormal;                                          // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture>                Texture;                                           // 0x0028(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.GolfItCustomTexture
// 0x0020 (0x0020 - 0x0000)
struct FGolfItCustomTexture final
{
public:
	bool                                          MIsImported;                                       // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MIsNormal;                                         // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             MTexture;                                          // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 MData;                                             // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2ObjectGroup
// 0x0018 (0x0018 - 0x0000)
struct FEditor2ObjectGroup final
{
public:
	class FName                                   DisplayName;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FEditor2PlaceableObjectInstance> ObjectsIDs;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GolfIt.Editor2FoliageData
// 0x0040 (0x0040 - 0x0000)
struct FEditor2FoliageData final
{
public:
	class FString                                 FoliageID;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCustomAsset;                                     // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomID;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
