#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: HirarchialSimpleObjects

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_Editor_Categories_structs.hpp"
#include "InstancedWithPlaceableActors_structs.hpp"
#include "HirarchialObjects_structs.hpp"
#include "E_Editor_Themes_structs.hpp"
#include "S_InstancedMeshArray_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass HirarchialSimpleObjects.HirarchialSimpleObjects_C
// 0x00C8 (0x02E8 - 0x0220)
class AHirarchialSimpleObjects_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         ViewDistanceOriginal;                              // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ISVR;                                              // 0x0234(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseHInstances;                                     // 0x0235(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_236[0x2];                                      // 0x0236(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ClusterSize;                                       // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstancedWithPlaceableActors>  InstancedWithPlaceableActors;                      // 0x0240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UInstancedStaticMeshComponent*          DummyInstances;                                    // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 DummyTempList;                                     // 0x0258(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         TempIndex;                                         // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FHirarchialObjects, struct FS_InstancedMeshArray> Hirarchial_ObjectsInstances;                       // 0x0270(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FHirarchialObjects                     CurrentCombo;                                      // 0x02C0(0x0028)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeMaterialOnInstance(E_Editor_Themes Theme, class UInstancedStaticMeshComponent* InstancedMesh);
	void DefaultInstanceMaterialInstance(class UInstancedStaticMeshComponent* InstancedMesh);
	void AddInstancesFromLoad(const struct FS_EditorInstancedMeshes& InstanceToAdd);
	void AddInstanceObject(class UStaticMesh* Mesh, bool NoCollision, const struct FTransform& ObjectsTransform, E_Editor_Themes Theme, int32 Cull, class UInstancedStaticMeshComponent** InstancedMesh, class UHierarchicalInstancedStaticMeshComponent** HierarchicalInstancedMesh);
	bool CheckClusterSize(class UInstancedStaticMeshComponent* InstancedStaticMesh, class AActor* Actor);
	void Check_If_Mesh_In_Global_Object_List(bool* Exist, struct FS_InstancedMeshArray* OutputInstances);
	void AllowedMaterials(TArray<class UMaterialInterface*>& InstancesToChck, bool* Continue);
	void Add_Stuff_Function(class UStaticMesh* Mesh, class AActor* Actor, E_Editor_Themes Area, int32 CullDistance, bool NoCollision, const struct FS_FullLaneComposition& LaneComposition, class UInstancedStaticMeshComponent** InstancedMesh, class UHierarchicalInstancedStaticMeshComponent** HierarchicalInstancedMesh);
	void ClearAll();
	void ChangeCull(int32 ViewDistance);
	void SetOriginalViewDistance(int32 ViewDistanceSetting);
	void SetAllInstancesToStatic();
	void RememberPlaceableObjects(const TArray<class AActor*>& PlaceableActors, const class UInstancedStaticMeshComponent* InstancedMesh, const class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedMesh, const int32 InstancedID);
	void RemovePlacableObjects(const class UInstancedStaticMeshComponent* InstancedMesh, const class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedMesh, const int32 InstancedID);
	void MulticastAddInstance(class UStaticMesh* StaticMesh, bool NoCollision, const struct FTransform& ObjectTransform);
	void ChangeInstancesToMeshes();
	void ChangeBasicToInstances();
	void ExecuteUbergraph_HirarchialSimpleObjects(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HirarchialSimpleObjects_C">();
	}
	static class AHirarchialSimpleObjects_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHirarchialSimpleObjects_C>();
	}
};

}

