#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: HirarchialObjects

#include "Basic.hpp"

#include "E_Editor_Themes_structs.hpp"
#include "S_FullLaneComposition_structs.hpp"


namespace SDK
{

// UserDefinedStruct HirarchialObjects.HirarchialObjects
// 0x0028 (0x0028 - 0x0000)
struct FHirarchialObjects final
{
public:
	class UStaticMesh*                            Mesh_8_A6166CEF42DD104913BCDC8233B280E9;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Editor_Themes                               Area_5_569607524E55367E18ABF58F712E9962;           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_FullLaneComposition                 LaneCompositions_11_1C6D7DB24CFCC7D5C11401BED03083C8; // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DataKey_14_BC1489954AF1427CF681E2BC93035C4F;       // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

