#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: HoleSpawnPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function HoleSpawnPoint.HoleSpawnPoint_C.HoleSpawnOptionsChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HoleSpawnPoint_C_HoleSpawnOptionsChanged__DelegateSignature final
{
public:
	int32                                         NewHole;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewPar;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function HoleSpawnPoint.HoleSpawnPoint_C.ExecuteUbergraph_HoleSpawnPoint
// 0x0020 (0x0020 - 0x0000)
struct HoleSpawnPoint_C_ExecuteUbergraph_HoleSpawnPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALobbyGameState_C*                      K2Node_DynamicCast_AsLobby_Game_State;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function HoleSpawnPoint.HoleSpawnPoint_C.GetSpawnType
// 0x0004 (0x0004 - 0x0000)
struct HoleSpawnPoint_C_GetSpawnType final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function HoleSpawnPoint.HoleSpawnPoint_C.GetPar
// 0x0004 (0x0004 - 0x0000)
struct HoleSpawnPoint_C_GetPar final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function HoleSpawnPoint.HoleSpawnPoint_C.GetMaxPlayers
// 0x0004 (0x0004 - 0x0000)
struct HoleSpawnPoint_C_GetMaxPlayers final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function HoleSpawnPoint.HoleSpawnPoint_C.GetHoleNumber
// 0x0004 (0x0004 - 0x0000)
struct HoleSpawnPoint_C_GetHoleNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function HoleSpawnPoint.HoleSpawnPoint_C.GetCondition
// 0x0004 (0x0004 - 0x0000)
struct HoleSpawnPoint_C_GetCondition final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

