#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: ImgMedia

#include "Basic.hpp"


namespace SDK::Params
{

// Function ImgMedia.ImgMediaSource.AddGlobalCamera
// 0x0008 (0x0008 - 0x0000)
struct ImgMediaSource_AddGlobalCamera final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ImgMedia.ImgMediaSource.AddTargetObject
// 0x0010 (0x0010 - 0x0000)
struct ImgMediaSource_AddTargetObject final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ImgMedia.ImgMediaSource.RemoveGlobalCamera
// 0x0008 (0x0008 - 0x0000)
struct ImgMediaSource_RemoveGlobalCamera final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ImgMedia.ImgMediaSource.RemoveTargetObject
// 0x0008 (0x0008 - 0x0000)
struct ImgMediaSource_RemoveTargetObject final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ImgMedia.ImgMediaSource.SetMipLevelDistance
// 0x0004 (0x0004 - 0x0000)
struct ImgMediaSource_SetMipLevelDistance final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ImgMedia.ImgMediaSource.SetSequencePath
// 0x0010 (0x0010 - 0x0000)
struct ImgMediaSource_SetSequencePath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ImgMedia.ImgMediaSource.GetProxies
// 0x0010 (0x0010 - 0x0000)
struct ImgMediaSource_GetProxies final
{
public:
	TArray<class FString>                         OutProxies;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function ImgMedia.ImgMediaSource.GetSequencePath
// 0x0010 (0x0010 - 0x0000)
struct ImgMediaSource_GetSequencePath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

