#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: LuaMachine

#include "Basic.hpp"

#include "LuaMachine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LuaMachine.LuaState.ToByteCode
// 0x0040 (0x0040 - 0x0000)
struct LuaState_ToByteCode final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CodePath;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorString;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.GetLuaBlueprintPackageTable
// 0x0050 (0x0050 - 0x0000)
struct LuaState_GetLuaBlueprintPackageTable final
{
public:
	class FString                                 PackageName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.GetLuaUserDataField
// 0x0090 (0x0090 - 0x0000)
struct LuaState_GetLuaUserDataField final
{
public:
	struct FLuaValue                              UserData;                                          // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0050(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.GetLuaValueFromProperty
// 0x0058 (0x0058 - 0x0000)
struct LuaState_GetLuaValueFromProperty final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0018(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.LuaGetInfo
// 0x0050 (0x0050 - 0x0000)
struct LuaState_LuaGetInfo final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLuaDebug                              ReturnValue;                                       // 0x0008(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.LuaGetLocals
// 0x0058 (0x0058 - 0x0000)
struct LuaState_LuaGetLocals final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FLuaValue>         ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.NewLuaUserDataObject
// 0x0050 (0x0050 - 0x0000)
struct LuaState_NewLuaUserDataObject final
{
public:
	TSubclassOf<class ULuaUserDataObject>         LuaUserDataObjectClass;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTrackObject;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLuaValue                              ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.ReceiveLuaCallHook
// 0x0048 (0x0048 - 0x0000)
struct LuaState_ReceiveLuaCallHook final
{
public:
	struct FLuaDebug                              LuaDebug;                                          // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.ReceiveLuaError
// 0x0010 (0x0010 - 0x0000)
struct LuaState_ReceiveLuaError final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.ReceiveLuaLevelAddedToWorld
// 0x0010 (0x0010 - 0x0000)
struct LuaState_ReceiveLuaLevelAddedToWorld final
{
public:
	class ULevel*                                 Level;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 World;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.ReceiveLuaLevelRemovedFromWorld
// 0x0010 (0x0010 - 0x0000)
struct LuaState_ReceiveLuaLevelRemovedFromWorld final
{
public:
	class ULevel*                                 Level;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 World;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.ReceiveLuaLineHook
// 0x0048 (0x0048 - 0x0000)
struct LuaState_ReceiveLuaLineHook final
{
public:
	struct FLuaDebug                              LuaDebug;                                          // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.ReceiveLuaReturnHook
// 0x0048 (0x0048 - 0x0000)
struct LuaState_ReceiveLuaReturnHook final
{
public:
	struct FLuaDebug                              LuaDebug;                                          // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.SetLuaUserDataField
// 0x0090 (0x0090 - 0x0000)
struct LuaState_SetLuaUserDataField final
{
public:
	struct FLuaValue                              UserData;                                          // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              Value;                                             // 0x0050(0x0040)(Parm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.SetPropertyFromLuaValue
// 0x0060 (0x0060 - 0x0000)
struct LuaState_SetPropertyFromLuaValue final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              Value;                                             // 0x0018(0x0040)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LuaMachine.LuaState.StructToLuaTable
// 0x0058 (0x0058 - 0x0000)
struct LuaState_StructToLuaTable final
{
public:
	class UScriptStruct*                          InScriptStruct;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 StructData;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0018(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaState.GetSelfLuaState
// 0x0008 (0x0008 - 0x0000)
struct LuaState_GetSelfLuaState final
{
public:
	TSubclassOf<class ULuaState>                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.AssignLuaValueToLuaState
// 0x0090 (0x0090 - 0x0000)
struct LuaBlueprintFunctionLibrary_AssignLuaValueToLuaState final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              Value;                                             // 0x0008(0x0040)(Parm, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0048(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0050(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_BoolToLuaValue
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_BoolToLuaValue final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLuaValue                              ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_FloatToLuaValue
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_FloatToLuaValue final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLuaValue                              ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_IntToLuaValue
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_IntToLuaValue final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLuaValue                              ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_LuaValueToBool
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_LuaValueToBool final
{
public:
	struct FLuaValue                              Value;                                             // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_LuaValueToClass
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_LuaValueToClass final
{
public:
	struct FLuaValue                              Value;                                             // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_LuaValueToFloat
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_LuaValueToFloat final
{
public:
	struct FLuaValue                              Value;                                             // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_LuaValueToFVector
// 0x0050 (0x0050 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_LuaValueToFVector final
{
public:
	struct FLuaValue                              Value;                                             // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0040(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_LuaValueToInt
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_LuaValueToInt final
{
public:
	struct FLuaValue                              Value;                                             // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_LuaValueToName
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_LuaValueToName final
{
public:
	struct FLuaValue                              Value;                                             // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_LuaValueToObject
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_LuaValueToObject final
{
public:
	struct FLuaValue                              Value;                                             // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_LuaValueToString
// 0x0050 (0x0050 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_LuaValueToString final
{
public:
	struct FLuaValue                              Value;                                             // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_LuaValueToText
// 0x0058 (0x0058 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_LuaValueToText final
{
public:
	struct FLuaValue                              Value;                                             // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0040(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_NameToLuaValue
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_NameToLuaValue final
{
public:
	class FName                                   Value;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_ObjectToLuaValue
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_ObjectToLuaValue final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_StringToLuaValue
// 0x0050 (0x0050 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_StringToLuaValue final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.Conv_TextToLuaValue
// 0x0058 (0x0058 - 0x0000)
struct LuaBlueprintFunctionLibrary_Conv_TextToLuaValue final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0018(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.GetLuaComponentAsLuaValue
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_GetLuaComponentAsLuaValue final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.GetLuaComponentByNameAsLuaValue
// 0x0058 (0x0058 - 0x0000)
struct LuaBlueprintFunctionLibrary_GetLuaComponentByNameAsLuaValue final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param_Name;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0018(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.GetLuaComponentByStateAndNameAsLuaValue
// 0x0060 (0x0060 - 0x0000)
struct LuaBlueprintFunctionLibrary_GetLuaComponentByStateAndNameAsLuaValue final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param_Name;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0020(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.GetLuaComponentByStateAsLuaValue
// 0x0050 (0x0050 - 0x0000)
struct LuaBlueprintFunctionLibrary_GetLuaComponentByStateAsLuaValue final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.GetLuaReflectionType
// 0x0020 (0x0020 - 0x0000)
struct LuaBlueprintFunctionLibrary_GetLuaReflectionType final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param_Name;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELuaReflectionType                            LuaReflectionTypes;                                // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaComponentGetField
// 0x0090 (0x0090 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaComponentGetField final
{
public:
	struct FLuaValue                              LuaComponent;                                      // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0050(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaCreateBool
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaCreateBool final
{
public:
	bool                                          bInBool;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLuaValue                              ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaCreateInteger
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaCreateInteger final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLuaValue                              ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaCreateLazyTable
// 0x0050 (0x0050 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaCreateLazyTable final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaCreateNil
// 0x0040 (0x0040 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaCreateNil final
{
public:
	struct FLuaValue                              ReturnValue;                                       // 0x0000(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaCreateNumber
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaCreateNumber final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLuaValue                              ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaCreateObject
// 0x0048 (0x0048 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaCreateObject final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaCreateObjectInState
// 0x0058 (0x0058 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaCreateObjectInState final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0018(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaCreateString
// 0x0050 (0x0050 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaCreateString final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaCreateTable
// 0x0050 (0x0050 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaCreateTable final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaCreateThread
// 0x0090 (0x0090 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaCreateThread final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              Value;                                             // 0x0010(0x0040)(Parm, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0050(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaCreateUFunction
// 0x0058 (0x0058 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaCreateUFunction final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FunctionName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0018(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaGCCollect
// 0x0010 (0x0010 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaGCCollect final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaGCRestart
// 0x0010 (0x0010 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaGCRestart final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaGCStop
// 0x0010 (0x0010 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaGCStop final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaGetGlobal
// 0x0060 (0x0060 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaGetGlobal final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param_Name;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0020(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaGetState
// 0x0018 (0x0018 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaGetState final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULuaState*                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaGetTop
// 0x0018 (0x0018 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaGetTop final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaGetUsedMemory
// 0x0018 (0x0018 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaGetUsedMemory final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaGlobalCall
// 0x0070 (0x0070 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaGlobalCall final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param_Name;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLuaValue>                      Args;                                              // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0030(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaGlobalCallMulti
// 0x0040 (0x0040 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaGlobalCallMulti final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param_Name;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLuaValue>                      Args;                                              // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLuaValue>                      ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaGlobalCallValue
// 0x00A0 (0x00A0 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaGlobalCallValue final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              Value;                                             // 0x0010(0x0040)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FLuaValue>                      Args;                                              // 0x0050(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0060(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaGlobalCallValueMulti
// 0x0070 (0x0070 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaGlobalCallValueMulti final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              Value;                                             // 0x0010(0x0040)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FLuaValue>                      Args;                                              // 0x0050(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLuaValue>                      ReturnValue;                                       // 0x0060(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaHttpRequest
// 0x0120 (0x0120 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaHttpRequest final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Method;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 URL;                                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Headers;                                           // 0x0030(0x0050)(Parm, NativeAccessSpecifierPublic)
	struct FLuaValue                              Body;                                              // 0x0080(0x0040)(Parm, NativeAccessSpecifierPublic)
	struct FLuaValue                              Context;                                           // 0x00C0(0x0040)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLuaValue& Context, const struct FLuaValue& Response)> ResponseReceived;                                  // 0x0100(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLuaValue& Context)> Error;                                             // 0x0110(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaLoadPakFile
// 0x0058 (0x0058 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaLoadPakFile final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Mountpoint;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLuaValue>                      Assets;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ContentPath;                                       // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetRegistryPath;                                 // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaNewLuaUserDataObject
// 0x0060 (0x0060 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaNewLuaUserDataObject final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaUserDataObject>         UserDataObjectClass;                               // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTrackObject;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLuaValue                              ReturnValue;                                       // 0x0020(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaRunByteCode
// 0x0070 (0x0070 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaRunByteCode final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ByteCode;                                          // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 CodePath;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0030(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaRunCodeAsset
// 0x0058 (0x0058 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaRunCodeAsset final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULuaCode*                               CodeAsset;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0018(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaRunFile
// 0x0068 (0x0068 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaRunFile final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreNonExistent;                                // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLuaValue                              ReturnValue;                                       // 0x0028(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaRunNonContentFile
// 0x0068 (0x0068 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaRunNonContentFile final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreNonExistent;                                // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLuaValue                              ReturnValue;                                       // 0x0028(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaRunString
// 0x0070 (0x0070 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaRunString final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CodeString;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CodePath;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              ReturnValue;                                       // 0x0030(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaRunURL
// 0x00B0 (0x00B0 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaRunURL final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 URL;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Headers;                                           // 0x0020(0x0050)(Parm, NativeAccessSpecifierPublic)
	class FString                                 SecurityHeader;                                    // 0x0070(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SignaturePublicExponent;                           // 0x0080(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SignatureModulus;                                  // 0x0090(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLuaValue& ReturnValue, bool bWasSuccessful, int32 StatusCode)> Completed;                                         // 0x00A0(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaSetGlobal
// 0x0060 (0x0060 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaSetGlobal final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param_Name;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              Value;                                             // 0x0020(0x0040)(Parm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaSetUserDataMetaTable
// 0x0050 (0x0050 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaSetUserDataMetaTable final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaState>                  State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaValue                              MetaTable;                                         // 0x0010(0x0040)(Parm, NativeAccessSpecifierPublic)
};

// Function LuaMachine.LuaBlueprintFunctionLibrary.LuaStateDestroy
// 0x0010 (0x0010 - 0x0000)
struct LuaBlueprintFunctionLibrary_LuaStateDestroy final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
