#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: MasterLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Enum_LightType_structs.hpp"
#include "S_MasterLight_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MasterLight.MasterLight_C
// 0x0098 (0x02B8 - 0x0220)
class AMasterLight_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SpotLightDirection;                                // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LightRepresentation;                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        LightComponent;                                    // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_MasterLight                         Light_Data;                                        // 0x0250(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_LightType                                Light_Type;                                        // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetUniqueID(struct FGuid* Guid);
	void GenerateUniqueID(struct FGuid* Guid);
	void UpdateGameView(bool IsGameView, bool* Completed);
	void SetRectLightData();
	void SetSpotLightData();
	void SetPointLightData();
	void SetLightParameters();
	void ChangeLightType(const struct FS_MasterLight& LightData);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_MasterLight(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MasterLight_C">();
	}
	static class AMasterLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMasterLight_C>();
	}
};

}

