#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: OculusMR

#include "Basic.hpp"

#include "OculusMR_structs.hpp"


namespace SDK::Params
{

// Function OculusMR.OculusMR_PlaneMeshComponent.AddCustomMeshTriangles
// 0x0010 (0x0010 - 0x0000)
struct OculusMR_PlaneMeshComponent_AddCustomMeshTriangles final
{
public:
	TArray<struct FOculusMR_PlaneMeshTriangle>    Triangles;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMR_PlaneMeshComponent.SetCustomMeshTriangles
// 0x0018 (0x0018 - 0x0000)
struct OculusMR_PlaneMeshComponent_SetCustomMeshTriangles final
{
public:
	TArray<struct FOculusMR_PlaneMeshTriangle>    Triangles;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OculusMR.OculusMR_Settings.BindToTrackedCameraIndexIfAvailable
// 0x0004 (0x0004 - 0x0000)
struct OculusMR_Settings_BindToTrackedCameraIndexIfAvailable final
{
public:
	int32                                         InTrackedCameraIndex;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMR_Settings.GetBindToTrackedCameraIndex
// 0x0004 (0x0004 - 0x0000)
struct OculusMR_Settings_GetBindToTrackedCameraIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMR_Settings.GetCapturingCamera
// 0x0001 (0x0001 - 0x0000)
struct OculusMR_Settings_GetCapturingCamera final
{
public:
	EOculusMR_CameraDeviceEnum                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMR_Settings.GetCompositionMethod
// 0x0001 (0x0001 - 0x0000)
struct OculusMR_Settings_GetCompositionMethod final
{
public:
	EOculusMR_CompositionMethod                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMR_Settings.GetIsCasting
// 0x0001 (0x0001 - 0x0000)
struct OculusMR_Settings_GetIsCasting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMR_Settings.SetCapturingCamera
// 0x0001 (0x0001 - 0x0000)
struct OculusMR_Settings_SetCapturingCamera final
{
public:
	EOculusMR_CameraDeviceEnum                    Val;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMR_Settings.SetCompositionMethod
// 0x0001 (0x0001 - 0x0000)
struct OculusMR_Settings_SetCompositionMethod final
{
public:
	EOculusMR_CompositionMethod                   Val;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMR_Settings.SetIsCasting
// 0x0001 (0x0001 - 0x0000)
struct OculusMR_Settings_SetIsCasting final
{
public:
	bool                                          Val;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMRFunctionLibrary.GetMrcScalingFactor
// 0x0004 (0x0004 - 0x0000)
struct OculusMRFunctionLibrary_GetMrcScalingFactor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMRFunctionLibrary.GetOculusMRSettings
// 0x0008 (0x0008 - 0x0000)
struct OculusMRFunctionLibrary_GetOculusMRSettings final
{
public:
	class UOculusMR_Settings*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMRFunctionLibrary.GetTrackingReferenceComponent
// 0x0008 (0x0008 - 0x0000)
struct OculusMRFunctionLibrary_GetTrackingReferenceComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMRFunctionLibrary.IsMrcActive
// 0x0001 (0x0001 - 0x0000)
struct OculusMRFunctionLibrary_IsMrcActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMRFunctionLibrary.IsMrcEnabled
// 0x0001 (0x0001 - 0x0000)
struct OculusMRFunctionLibrary_IsMrcEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusMR.OculusMRFunctionLibrary.SetMrcScalingFactor
// 0x0008 (0x0008 - 0x0000)
struct OculusMRFunctionLibrary_SetMrcScalingFactor final
{
public:
	float                                         ScalingFactor;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OculusMR.OculusMRFunctionLibrary.SetTrackingReferenceComponent
// 0x0010 (0x0010 - 0x0000)
struct OculusMRFunctionLibrary_SetTrackingReferenceComponent final
{
public:
	class USceneComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

