#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: OculusHMD

#include "Basic.hpp"

#include "HeadMountedDisplay_structs.hpp"
#include "OculusHMD_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function OculusHMD.OculusFunctionLibrary.AddLoadingSplashScreen
// 0x0038 (0x0038 - 0x0000)
struct OculusFunctionLibrary_AddLoadingSplashScreen final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TranslationInMeters;                               // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              SizeInMeters;                                      // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               DeltaRotation;                                     // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bClearBeforeAdd;                                   // 0x0034(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OculusHMD.OculusFunctionLibrary.EnableOrientationTracking
// 0x0001 (0x0001 - 0x0000)
struct OculusFunctionLibrary_EnableOrientationTracking final
{
public:
	bool                                          bOrientationTracking;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.EnablePositionTracking
// 0x0001 (0x0001 - 0x0000)
struct OculusFunctionLibrary_EnablePositionTracking final
{
public:
	bool                                          bPositionTracking;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetAvailableDisplayFrequencies
// 0x0010 (0x0010 - 0x0000)
struct OculusFunctionLibrary_GetAvailableDisplayFrequencies final
{
public:
	TArray<float>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetBaseRotationAndBaseOffsetInMeters
// 0x0018 (0x0018 - 0x0000)
struct OculusFunctionLibrary_GetBaseRotationAndBaseOffsetInMeters final
{
public:
	struct FRotator                               OutRotation;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                OutBaseOffsetInMeters;                             // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetBaseRotationAndPositionOffset
// 0x0018 (0x0018 - 0x0000)
struct OculusFunctionLibrary_GetBaseRotationAndPositionOffset final
{
public:
	struct FRotator                               OutRot;                                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                OutPosOffset;                                      // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetCurrentDisplayFrequency
// 0x0004 (0x0004 - 0x0000)
struct OculusFunctionLibrary_GetCurrentDisplayFrequency final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetDeviceName
// 0x0010 (0x0010 - 0x0000)
struct OculusFunctionLibrary_GetDeviceName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetDeviceType
// 0x0001 (0x0001 - 0x0000)
struct OculusFunctionLibrary_GetDeviceType final
{
public:
	EOculusDeviceType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetFixedFoveatedRenderingLevel
// 0x0001 (0x0001 - 0x0000)
struct OculusFunctionLibrary_GetFixedFoveatedRenderingLevel final
{
public:
	EFixedFoveatedRenderingLevel                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetGPUFrameTime
// 0x0004 (0x0004 - 0x0000)
struct OculusFunctionLibrary_GetGPUFrameTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetGPUUtilization
// 0x0008 (0x0008 - 0x0000)
struct OculusFunctionLibrary_GetGPUUtilization final
{
public:
	bool                                          IsGPUAvailable;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GPUUtilization;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetGuardianDimensions
// 0x0010 (0x0010 - 0x0000)
struct OculusFunctionLibrary_GetGuardianDimensions final
{
public:
	EBoundaryType                                 BoundaryType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetGuardianPoints
// 0x0018 (0x0018 - 0x0000)
struct OculusFunctionLibrary_GetGuardianPoints final
{
public:
	EBoundaryType                                 BoundaryType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsePawnSpace;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetHmdColorDesc
// 0x0001 (0x0001 - 0x0000)
struct OculusFunctionLibrary_GetHmdColorDesc final
{
public:
	EColorSpace                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetNodeGuardianIntersection
// 0x0024 (0x0024 - 0x0000)
struct OculusFunctionLibrary_GetNodeGuardianIntersection final
{
public:
	ETrackedDeviceType                            DeviceType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoundaryType                                 BoundaryType;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuardianTestResult                    ReturnValue;                                       // 0x0004(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetPlayAreaTransform
// 0x0030 (0x0030 - 0x0000)
struct OculusFunctionLibrary_GetPlayAreaTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetPointGuardianIntersection
// 0x0030 (0x0030 - 0x0000)
struct OculusFunctionLibrary_GetPointGuardianIntersection final
{
public:
	struct FVector                                Point;                                             // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoundaryType                                 BoundaryType;                                      // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuardianTestResult                    ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetPose
// 0x0034 (0x0034 - 0x0000)
struct OculusFunctionLibrary_GetPose final
{
public:
	struct FRotator                               DeviceRotation;                                    // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                DevicePosition;                                    // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NeckPosition;                                      // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOrienationForPlayerCamera;                     // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePositionForPlayerCamera;                       // 0x0025(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PositionScale;                                     // 0x0028(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetRawSensorData
// 0x0038 (0x0038 - 0x0000)
struct OculusFunctionLibrary_GetRawSensorData final
{
public:
	struct FVector                                AngularAcceleration;                               // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinearAcceleration;                                // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AngularVelocity;                                   // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinearVelocity;                                    // 0x0024(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeInSeconds;                                     // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETrackedDeviceType                            DeviceType;                                        // 0x0034(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OculusHMD.OculusFunctionLibrary.GetSystemHmd3DofModeEnabled
// 0x0001 (0x0001 - 0x0000)
struct OculusFunctionLibrary_GetSystemHmd3DofModeEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.GetUserProfile
// 0x0050 (0x0050 - 0x0000)
struct OculusFunctionLibrary_GetUserProfile final
{
public:
	struct FHmdUserProfile                        Profile;                                           // 0x0000(0x0048)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OculusHMD.OculusFunctionLibrary.HasInputFocus
// 0x0001 (0x0001 - 0x0000)
struct OculusFunctionLibrary_HasInputFocus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.HasSystemOverlayPresent
// 0x0001 (0x0001 - 0x0000)
struct OculusFunctionLibrary_HasSystemOverlayPresent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.IsDeviceTracked
// 0x0002 (0x0002 - 0x0000)
struct OculusFunctionLibrary_IsDeviceTracked final
{
public:
	ETrackedDeviceType                            DeviceType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.IsGuardianConfigured
// 0x0001 (0x0001 - 0x0000)
struct OculusFunctionLibrary_IsGuardianConfigured final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.IsGuardianDisplayed
// 0x0001 (0x0001 - 0x0000)
struct OculusFunctionLibrary_IsGuardianDisplayed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.SetBaseRotationAndBaseOffsetInMeters
// 0x001C (0x001C - 0x0000)
struct OculusFunctionLibrary_SetBaseRotationAndBaseOffsetInMeters final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                BaseOffsetInMeters;                                // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrientPositionSelector                       Options;                                           // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OculusHMD.OculusFunctionLibrary.SetBaseRotationAndPositionOffset
// 0x001C (0x001C - 0x0000)
struct OculusFunctionLibrary_SetBaseRotationAndPositionOffset final
{
public:
	struct FRotator                               BaseRot;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                PosOffset;                                         // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrientPositionSelector                       Options;                                           // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OculusHMD.OculusFunctionLibrary.SetClientColorDesc
// 0x0001 (0x0001 - 0x0000)
struct OculusFunctionLibrary_SetClientColorDesc final
{
public:
	EColorSpace                                   ColorSpace;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.SetColorScaleAndOffset
// 0x0024 (0x0024 - 0x0000)
struct OculusFunctionLibrary_SetColorScaleAndOffset final
{
public:
	struct FLinearColor                           ColorScale;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorOffset;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyToAllLayers;                                 // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OculusHMD.OculusFunctionLibrary.SetCPUAndGPULevels
// 0x0008 (0x0008 - 0x0000)
struct OculusFunctionLibrary_SetCPUAndGPULevels final
{
public:
	int32                                         CPULevel;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GPULevel;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.SetDisplayFrequency
// 0x0004 (0x0004 - 0x0000)
struct OculusFunctionLibrary_SetDisplayFrequency final
{
public:
	float                                         RequestedFrequency;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.SetFixedFoveatedRenderingLevel
// 0x0002 (0x0002 - 0x0000)
struct OculusFunctionLibrary_SetFixedFoveatedRenderingLevel final
{
public:
	EFixedFoveatedRenderingLevel                  Level;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDynamic;                                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.SetGuardianVisibility
// 0x0001 (0x0001 - 0x0000)
struct OculusFunctionLibrary_SetGuardianVisibility final
{
public:
	bool                                          GuardianVisible;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.SetPositionScale3D
// 0x000C (0x000C - 0x0000)
struct OculusFunctionLibrary_SetPositionScale3D final
{
public:
	struct FVector                                PosScale3D;                                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OculusHMD.OculusFunctionLibrary.SetReorientHMDOnControllerRecenter
// 0x0001 (0x0001 - 0x0000)
struct OculusFunctionLibrary_SetReorientHMDOnControllerRecenter final
{
public:
	bool                                          RecenterMode;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

