#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: OculusInput

#include "Basic.hpp"

#include "OculusInput_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class OculusInput.OculusHandComponent
// 0x00A0 (0x08A0 - 0x0800)
class UOculusHandComponent final : public UPoseableMeshComponent
{
public:
	EOculusHandType                               SkeletonType;                                      // 0x0800(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOculusHandType                               MeshType;                                          // 0x0801(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConfidenceBehavior                           ConfidenceBehavior;                                // 0x0802(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESystemGestureBehavior                        SystemGestureBehavior;                             // 0x0803(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_804[0x4];                                      // 0x0804(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     SystemGestureMaterial;                             // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitializePhysics;                                // 0x0810(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateHandScale;                                  // 0x0811(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_812[0x6];                                      // 0x0812(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     MaterialOverride;                                  // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EBone, class FName>                      BoneNameMappings;                                  // 0x0820(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FOculusCapsuleCollider>         CollisionCapsules;                                 // 0x0870(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bSkeletalMeshInitialized;                          // 0x0880(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_881[0x1F];                                     // 0x0881(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OculusHandComponent">();
	}
	static class UOculusHandComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOculusHandComponent>();
	}
};

// Class OculusInput.OculusInputFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UOculusInputFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FString GetBoneName(EBone BoneId);
	static struct FQuat GetBoneRotation(const EOculusHandType DeviceHand, const EBone BoneId, const int32 ControllerIndex);
	static EOculusHandType GetDominantHand(const int32 ControllerIndex);
	static float GetHandScale(const EOculusHandType DeviceHand, const int32 ControllerIndex);
	static bool GetHandSkeletalMesh(class USkeletalMesh* HandSkeletalMesh, EOculusHandType SkeletonType, EOculusHandType MeshType, const float WorldToMeters);
	static struct FTransform GetPointerPose(const EOculusHandType DeviceHand, const int32 ControllerIndex);
	static ETrackingConfidence GetTrackingConfidence(const EOculusHandType DeviceHand, const int32 ControllerIndex);
	static TArray<struct FOculusCapsuleCollider> InitializeHandPhysics(EOculusHandType SkeletonType, class USkinnedMeshComponent* HandComponent, const float WorldToMeters);
	static bool IsHandTrackingEnabled();
	static bool IsPointerPoseValid(const EOculusHandType DeviceHand, const int32 ControllerIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OculusInputFunctionLibrary">();
	}
	static class UOculusInputFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOculusInputFunctionLibrary>();
	}
};

}

