#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: Planet_Sun_MaterialStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Planet_Sun_MaterialStruct.Planet_Sun_MaterialStruct
// 0x0040 (0x0040 - 0x0000)
struct FPlanet_Sun_MaterialStruct final
{
public:
	struct FLinearColor                           Color_45_3DEFD49E45F2DC7553870FA9A4F9F2AE;         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinTemperature_K_29_BAFAF885419A2C5AACAAE7B35E3BE313; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTemperature_K_30_8D952DAD4458027E4F0C9EAD29F03E20; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FresnelBr_32_AB90EAD54D5DB056F9FA8C8E979C4F22;     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FresnelExp_33_1D47DF1A4388A58C12BD6B9440B272F0;    // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FresnelFrac_34_1B7C85C04872752B04827F99705BBA4F;   // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlowAffect_37_02535CB340295E78BAFE2C91791A72C5;    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlowScale_38_75BF48F94D1072496D25408A49B6A583;     // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FuryScale_39_8D61A4794FBBC1EC3524BBAD7564825B;     // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed1_40_29F20F2D438952D774DDC7B9F2979131;        // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed2_41_1923B314450537860987D7BC9EB6B566;        // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed3_42_EEE5CD0B4245FAEEEDEC68934F544A92;        // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SunPower_43_FF617D0F485EDCE585D970B227DB58A4;      // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

