#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: Planet_Moon_MaterialStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Planet_Moon_MaterialStruct.Planet_Moon_MaterialStruct
// 0x0068 (0x0068 - 0x0000)
struct FPlanet_Moon_MaterialStruct final
{
public:
	struct FLinearColor                           Color1_38_5F1AA92C440EEA269B8810B98163B6A1;        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color2_39_51E512E94AFF9BC9794F9CA49F9346C5;        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color3_40_EF9F2AA2440711635596A295873C0EAA;        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MixCharacter1_41_1A65AC9F4A3082BEDA80F7BE3BE8A60B; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MixCharacter2_42_FF82CB984CB41DBB5ACFF3A88F4A19B8; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Character1_43_4F1E3F6F444394C142A541B897E01999;    // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Character2_44_78C3901A486BFF27AACD63AED5463DF7;    // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Character3_45_57DA3806451ECDF61905EC9880D417C9;    // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale1_46_D5904D16484B5EA7C55336A17EE032DB;        // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale2_47_52833611493E14CBA46D35A1EC83C4BB;        // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VerticalCorrection_27_1F81B90A4CB2F06CC017908A111F7072; // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverlayMax_31_9609F9A0460A1C290374858DEA236AD1;    // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverlayMin_33_FFD9CA5E48E7AEBD53E3B5A168F5B1C9;    // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverlayScale_35_0C0BFB0547539962C34F8A840BF0484B;  // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverlayVertCorr_48_8B03E8BC40D4C6D81A65B5904E1D36A4; // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             NormalCraters_51_28029B734D5E212E79B6E0A0C6A7B203; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

