#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: PostProcess_Struct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PostProcess_MaterialStruct_structs.hpp"


namespace SDK
{

// UserDefinedStruct PostProcess_Struct.PostProcess_Struct
// 0x05C0 (0x05C0 - 0x0000)
struct FPostProcess_Struct final
{
public:
	struct FPostProcessSettings                   PP_Settings_2_6E09E90745D0B2E70C8D06BC8BBE7553;    // 0x0000(0x0560)(Edit, BlueprintVisible)
	float                                         Priority_9_11A49B5841A8A37BCA679388CE063E06;       // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendRadius_8_5F3892804661F21A4A9182BEE2866F09;    // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled_12_42CFF7A9430DC3E9A9D03E9C2991A550;       // 0x0568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Unbound_14_1B316DDC45AE6E956500D4B521998759;       // 0x0569(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56A[0x2];                                      // 0x056A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendWeight_17_B889A5384EDCA609B40AE2A15F232D09;   // 0x056C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPostProcess_MaterialStruct>    MaterialList_23_3AB51A4C4FEF53A7ACFC88A18B3FE225;  // 0x0570(0x0010)(Edit, BlueprintVisible)
	struct FTransform                             Transform_26_EC898A554EE9B3D39F696B99EFA7FDD0;     // 0x0580(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	int32                                         UniqueID_31_842685CB4A059C0CB875A592C79D477C;      // 0x05B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

