#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: RiverData

#include "Basic.hpp"

#include "RiverVisualData_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct RiverData.RiverData
// 0x0048 (0x0048 - 0x0000)
struct FRiverData final
{
public:
	TArray<struct FSplinePoint>                   SplinePoints_4_2DF57ED9426A08EA1C9E42AF66DB9A46;   // 0x0000(0x0010)(Edit, BlueprintVisible)
	float                                         RiverForce_9_1881C5814BFC6EAA597010A394627C0C;     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CorrectionForce_11_3BB3C7DB489E9AF0B6D48BBA83508D7A; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BuoyancyForce_14_275E55C94A783A01EA5F45914CD52FB7; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRiverVisualData                       VisualRiverData_17_D5FD99A943D870F18753699D4A00C579; // 0x001C(0x0028)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

