#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: Rotator3

#include "Basic.hpp"

#include "S_FullLaneComposition_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EventValues_structs.hpp"
#include "EventDefaults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_Editor_Themes_structs.hpp"
#include "GolfIt_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Rotator3.Rotator3_C
// 0x0150 (0x0370 - 0x0220)
class ARotator3_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RotationSpeedYaw;                                  // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            StaticMesh;                                        // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationSpeedPitch;                                // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationSpeedRoll;                                 // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             MaterialSaved;                                     // 0x0258(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	E_Editor_Themes                               Categorie;                                         // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MaterialFound;                                     // 0x0269(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A[0x2];                                      // 0x026A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UniqueId;                                          // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Parent;                                            // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGolfItBaseGoal*                        Goal;                                              // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EventDefaults>                         EventTypeQue;                                      // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FEventValues>                   EventValuesQue;                                    // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         QueID;                                             // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DurationDone;                                      // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TransformOrigin;                                   // 0x02B0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             TransformTarget;                                   // 0x02E0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasCustomObject;                                   // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Refresh;                                           // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0x2];                                      // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Offset;                                            // 0x0314(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             TransformSave;                                     // 0x0320(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FS_FullLaneComposition                 LaneComposition;                                   // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartOnMapLoad;                                    // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Rotator3(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ForceBack();
	void ReceiveTick(float DeltaSeconds);
	void StartDurationTransform(float Param_Duration, const struct FTransform& TargetTransform);
	void StopDynamicEvent();
	void ContinueEvent();
	void ReStartDynamicEvent();
	void NextEvent();
	void AddEvent(const struct FEventSingle& Event);
	void SetParent(class AActor* Param_Parent);
	void ReceiveDestroyed();
	void SetUniqueID(int32 Param_UniqueId);
	void SetCategorieMulticast(E_Editor_Themes Param_Categorie);
	void StartFunction(int32 Hole);
	void EndFunction(int32 Hole);
	void DestroyAttachedComponent(class UActorComponent* ComponentToDestroy);
	void SetIntegerEventID(int32 Param_UniqueId);
	void StartAddRotation(const struct FRotatorStruct& RotationAdd, float Delay);
	void SetDefaults();
	void ResetToDefault();
	void UserConstructionScript();
	void SetRotatorSettings(const struct FRotatorStruct& NewSettings);
	void TransformActorInDuration(const struct FTransform& Target, float Tick);
	void RemoveAttachedDynamicMeshes();
	void SpawnGoals(class FName SocketName, const struct FTransform& Transform);
	void StartEvent(EventDefaults EventDefaults, const struct FEventValues& EventValues, float* Delay);
	void CheckIfUniqueID(int32 UnqieID, bool* HasID);
	void GetUniqueID(int32* UniqeID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Rotator3_C">();
	}
	static class ARotator3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARotator3_C>();
	}
};

}

