#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: RuntimeMeshComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "RuntimeMeshComponent_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class RuntimeMeshComponent.RuntimeMeshComponentEngineSubsystem
// 0x0030 (0x0060 - 0x0030)
class URuntimeMeshComponentEngineSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshComponentEngineSubsystem">();
	}
	static class URuntimeMeshComponentEngineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshComponentEngineSubsystem>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshProviderTargetInterface
// 0x0000 (0x0028 - 0x0028)
class URuntimeMeshProviderTargetInterface : public UObject
{
public:
	void ClearSection(int32 LODIndex, int32 SectionId);
	void ConfigureLODs(const TArray<struct FRuntimeMeshLODProperties>& InLODs);
	void CreateSection(int32 LODIndex, int32 SectionId, const struct FRuntimeMeshSectionProperties& SectionProperties);
	class UMaterialInterface* GetMaterial(int32 SlotIndex);
	int32 GetMaterialIndex(class FName MaterialSlotName);
	struct FRuntimeMeshMaterialSlot GetMaterialSlot(int32 SlotIndex);
	TArray<class FName> GetMaterialSlotNames();
	TArray<struct FRuntimeMeshMaterialSlot> GetMaterialSlots();
	int32 GetNumMaterials();
	void MarkAllLODsDirty();
	void MarkCollisionDirty();
	void MarkLODDirty(int32 LODIndex);
	void MarkSectionDirty(int32 LODIndex, int32 SectionId);
	void RemoveSection(int32 LODIndex, int32 SectionId);
	void SetLODScreenSize(int32 LODIndex, float ScreenSize);
	void SetSectionCastsShadow(int32 LODIndex, int32 SectionId, bool bCastsShadow);
	void SetSectionVisibility(int32 LODIndex, int32 SectionId, bool bIsVisible);
	void SetupMaterialSlot(int32 MaterialSlot, class FName SlotName, class UMaterialInterface* InMaterial);

	bool IsMaterialSlotNameValid(class FName MaterialSlotName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshProviderTargetInterface">();
	}
	static class URuntimeMeshProviderTargetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshProviderTargetInterface>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshComponentSettings
// 0x0028 (0x0060 - 0x0038)
class URuntimeMeshComponentSettings final : public UDeveloperSettings
{
public:
	ERuntimeMeshUpdateFrequency                   DefaultUpdateFrequency;                            // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUse32BitIndicesByDefault;                         // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHighPrecisionTexCoordsByDefault;               // 0x003A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHighPrecisionTangentsByDefault;                // 0x003B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookCollisionAsync;                               // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERuntimeMeshCollisionCookingMode              DefaultCookingMode;                                // 0x003D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInt32Range                            MinMaxThreadPoolThreads;                           // 0x0040(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SystemThreadDivisor;                               // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERuntimeMeshThreadingPriority                 ThreadPriority;                                    // 0x0054(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ThreadStackSize;                                   // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAllowedTimePerTick;                             // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshComponentSettings">();
	}
	static class URuntimeMeshComponentSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshComponentSettings>();
	}
};

// Class RuntimeMeshComponent.RuntimeMesh
// 0x0448 (0x0470 - 0x0028)
class URuntimeMesh final : public URuntimeMeshProviderTargetInterface
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class URuntimeMeshProvider*                   MeshProviderPtr;                                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UBodySetup*                             BodySetup;                                         // 0x0048(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FRuntimeMeshCollisionSourceSectionInfo> CollisionSource;                                   // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FRuntimeMeshAsyncBodySetupData> AsyncBodySetupQueue;                               // 0x0060(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x2F8];                                     // 0x0070(0x02F8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRuntimeMeshMaterialSlot>       MaterialSlots;                                     // 0x0368(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class FName, int32>                      SlotNameLookup;                                    // 0x0378(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C8[0x98];                                     // 0x03C8(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             CollisionUpdated;                                  // 0x0460(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	class UBodySetup* GetBodySetup();
	class URuntimeMeshProvider* GetProviderPtr();
	void Initialize(class URuntimeMeshProvider* Provider);
	void Reset();

	struct FRuntimeMeshCollisionHitInfo GetHitSource(int32 FaceIndex) const;
	struct FBoxSphereBounds GetLocalBounds() const;
	bool IsInitialized() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMesh">();
	}
	static class URuntimeMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMesh>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshComponent
// 0x0010 (0x0490 - 0x0480)
#pragma pack(push, 0x1)
class alignas(0x10) URuntimeMeshComponent : public UMeshComponent
{
public:
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class URuntimeMesh*                           RuntimeMeshReference;                              // 0x0480(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class URuntimeMesh* GetOrCreateRuntimeMesh();
	class URuntimeMeshProvider* GetProvider();
	ERuntimeMeshMobility GetRuntimeMeshMobility();
	void Initialize(class URuntimeMeshProvider* Provider);
	void SetRuntimeMesh(class URuntimeMesh* NewMesh);
	void SetRuntimeMeshMobility(ERuntimeMeshMobility NewMobility);
	void SetupMaterialSlot(int32 MaterialSlot, class FName SlotName, class UMaterialInterface* InMaterial);

	struct FRuntimeMeshCollisionHitInfo GetHitSource(int32 FaceIndex) const;
	TArray<struct FRuntimeMeshMaterialSlot> GetMaterialSlots() const;
	class URuntimeMesh* GetRuntimeMesh() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshComponent">();
	}
	static class URuntimeMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshComponent>();
	}
};
#pragma pack(pop)

// Class RuntimeMeshComponent.RuntimeMeshComponentStatic
// 0x0020 (0x04B0 - 0x0490)
class URuntimeMeshComponentStatic final : public URuntimeMeshComponent
{
public:
	class URuntimeMesh*                           RuntimeMesh;                                       // 0x0488(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URuntimeMeshProviderStatic*             StaticProvider;                                    // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URuntimeMeshModifierNormals*            NormalsModifier;                                   // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URuntimeMeshModifierAdjacency*          AdjacencyModifier;                                 // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A8[0x8];                                      // 0x04A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearSection(int32 LODIndex, int32 SectionId);
	void CreateSection_Blueprint(int32 LODIndex, int32 SectionId, const struct FRuntimeMeshSectionProperties& SectionProperties, const struct FRuntimeMeshRenderableMeshData& SectionData);
	void CreateSectionFromComponents(int32 LODIndex, int32 SectionIndex, int32 MaterialSlot, const TArray<struct FVector>& Vertices, const TArray<int32>& Triangles, const TArray<struct FVector>& Normals, const TArray<struct FVector2D>& UV0, const TArray<struct FVector2D>& UV1, const TArray<struct FVector2D>& UV2, const TArray<struct FVector2D>& UV3, const TArray<struct FLinearColor>& VertexColors, const TArray<struct FRuntimeMeshTangent>& Tangents, ERuntimeMeshUpdateFrequency UpdateFrequency, bool bCreateCollision);
	void DisableNormalTangentGeneration();
	void DisableTessellationTrianglesGeneration();
	void EnabledTessellationTrianglesGeneration();
	void EnableNormalTangentGeneration();
	struct FRuntimeMeshRenderableMeshData GetSectionRenderDataAndClear(int32 LODIndex, int32 SectionId);
	class URuntimeMeshProviderStatic* GetStaticProvider();
	void RemoveAllSectionsForLOD(int32 LODIndex);
	void SetCollisionMesh(const struct FRuntimeMeshCollisionData& NewCollisionMesh);
	void SetCollisionSettings(const struct FRuntimeMeshCollisionSettings& NewCollisionSettings);
	void SetRenderableLODForCollision(int32 LODIndex);
	void SetRenderableSectionAffectsCollision(int32 SectionId, bool bCollisionEnabled);
	void UpdateSection_Blueprint(int32 LODIndex, int32 SectionId, const struct FRuntimeMeshRenderableMeshData& SectionData);
	void UpdateSectionFromComponents(int32 LODIndex, int32 SectionIndex, const TArray<struct FVector>& Vertices, const TArray<int32>& Triangles, const TArray<struct FVector>& Normals, const TArray<struct FVector2D>& UV0, const TArray<struct FVector2D>& UV1, const TArray<struct FVector2D>& UV2, const TArray<struct FVector2D>& UV3, const TArray<struct FLinearColor>& VertexColors, const TArray<struct FRuntimeMeshTangent>& Tangents);

	bool DoesSectionHaveValidMeshData(int32 LODIndex, int32 SectionId) const;
	struct FRuntimeMeshCollisionData GetCollisionMesh() const;
	struct FRuntimeMeshCollisionSettings GetCollisionSettings() const;
	int32 GetLastSectionId(int32 LODIndex) const;
	int32 GetLODForMeshCollision() const;
	struct FBoxSphereBounds GetSectionBounds(int32 LODIndex, int32 SectionId) const;
	TArray<int32> GetSectionIds(int32 LODIndex) const;
	struct FRuntimeMeshSectionProperties GetSectionProperties(int32 LODIndex, int32 SectionId) const;
	struct FRuntimeMeshRenderableMeshData GetSectionRenderData(int32 LODIndex, int32 SectionId) const;
	TSet<int32> GetSectionsForMeshCollision() const;
	bool HasNormalTangentGenerationEnabled() const;
	bool HasTessellationTriangleGenerationEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshComponentStatic">();
	}
	static class URuntimeMeshComponentStatic* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshComponentStatic>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshActor
// 0x0008 (0x0228 - 0x0220)
class ARuntimeMeshActor final : public AActor
{
public:
	class URuntimeMeshComponent*                  RuntimeMeshComponent;                              // 0x0220(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	ERuntimeMeshMobility GetRuntimeMeshMobility();
	void SetRuntimeMeshMobility(ERuntimeMeshMobility NewMobility);

	class URuntimeMeshComponent* GetRuntimeMeshComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshActor">();
	}
	static class ARuntimeMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARuntimeMeshActor>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshBlueprintFunctions
// 0x0000 (0x0028 - 0x0028)
class URuntimeMeshBlueprintFunctions final : public UBlueprintFunctionLibrary
{
public:
	static void AddCollisionBox(struct FRuntimeMeshCollisionSettings& Settings, struct FRuntimeMeshCollisionSettings* OutSettings, const struct FRuntimeMeshCollisionBox& NewBox);
	static void AddCollisionCapsule(struct FRuntimeMeshCollisionSettings& Settings, struct FRuntimeMeshCollisionSettings* OutSettings, const struct FRuntimeMeshCollisionCapsule& NewCapsule);
	static void AddCollisionConvex(struct FRuntimeMeshCollisionSettings& Settings, struct FRuntimeMeshCollisionSettings* OutSettings, const struct FRuntimeMeshCollisionConvexMesh& NewConvex);
	static void AddCollisionMaterialIndex(struct FRuntimeMeshCollisionMaterialIndexStream& Stream, struct FRuntimeMeshCollisionMaterialIndexStream* OutStream, int32 NewIndex, int32* OutIndex);
	static void AddCollisionSphere(struct FRuntimeMeshCollisionSettings& Settings, struct FRuntimeMeshCollisionSettings* OutSettings, const struct FRuntimeMeshCollisionSphere& NewSphere);
	static void AddCollisionTexCoord(struct FRuntimeMeshVertexTexCoordStream& Stream, struct FRuntimeMeshVertexTexCoordStream* OutStream, const struct FVector2D& InTexCoord, int32* OutIndex);
	static void AddCollisionTriangle(struct FRuntimeMeshCollisionTriangleStream& Stream, struct FRuntimeMeshCollisionTriangleStream* OutStream, int32 NewIndexA, int32 NewIndexB, int32 NewIndexC, int32* OutTriangleIndex);
	static void AddCollisionVertex(struct FRuntimeMeshCollisionVertexStream& Stream, struct FRuntimeMeshCollisionVertexStream* OutStream, const struct FVector& InVertex, int32* OutIndex);
	static void AddColor(struct FRuntimeMeshVertexColorStream& Stream, struct FRuntimeMeshVertexColorStream* OutStream, const struct FLinearColor& InColor, int32* OutIndex);
	static void AddIndex(struct FRuntimeMeshTriangleStream& Stream, struct FRuntimeMeshTriangleStream* OutStream, int32 NewIndex, int32* OutIndex);
	static void AddNormalAndTangent(struct FRuntimeMeshVertexTangentStream& Stream, struct FRuntimeMeshVertexTangentStream* OutStream, const struct FVector& InNormal, const struct FVector& InTangent, int32* OutIndex);
	static void AddPosition(struct FRuntimeMeshVertexPositionStream& Stream, struct FRuntimeMeshVertexPositionStream* OutStream, const struct FVector& InPosition, int32* OutIndex);
	static void AddTangents(struct FRuntimeMeshVertexTangentStream& Stream, struct FRuntimeMeshVertexTangentStream* OutStream, const struct FVector& InTangentX, const struct FVector& InTangentY, const struct FVector& InTangentZ, int32* OutIndex);
	static void AddTexCoord(struct FRuntimeMeshVertexTexCoordStream& Stream, struct FRuntimeMeshVertexTexCoordStream* OutStream, int32* OutIndex, const struct FVector2D& InTexCoord, int32 ChannelId);
	static void AddTriangle(struct FRuntimeMeshTriangleStream& Stream, struct FRuntimeMeshTriangleStream* OutStream, int32 NewIndexA, int32 NewIndexB, int32 NewIndexC);
	static void AppendColors(struct FRuntimeMeshVertexColorStream& Stream, struct FRuntimeMeshVertexColorStream* OutStream, const struct FRuntimeMeshVertexColorStream& InOther);
	static void AppendPositions(struct FRuntimeMeshVertexPositionStream& Stream, struct FRuntimeMeshVertexPositionStream* OutStream, const struct FRuntimeMeshVertexPositionStream& InOther);
	static void AppendTangents(struct FRuntimeMeshVertexTangentStream& Stream, struct FRuntimeMeshVertexTangentStream* OutStream, const struct FRuntimeMeshVertexTangentStream& InOther);
	static void AppendTexCoords(struct FRuntimeMeshVertexTexCoordStream& Stream, struct FRuntimeMeshVertexTexCoordStream* OutStream, const struct FRuntimeMeshVertexTexCoordStream& InOther);
	static void AppendTriangles(struct FRuntimeMeshTriangleStream& Stream, struct FRuntimeMeshTriangleStream* OutStream, const struct FRuntimeMeshTriangleStream& InOther);
	static struct FRuntimeMeshRenderableMeshData CreateRenderableMeshData(bool bWantsHighPrecisionTangents, bool bWantsHighPrecisionTexCoords, uint8 Param_NumTexCoords, bool bWants32BitIndices);
	static void EmptyCollisionMaterialIndices(struct FRuntimeMeshCollisionMaterialIndexStream& Stream, struct FRuntimeMeshCollisionMaterialIndexStream* OutStream, int32 Slack);
	static void EmptyCollisionTexCoords(struct FRuntimeMeshVertexTexCoordStream& Stream, struct FRuntimeMeshVertexTexCoordStream* OutStream, int32 Slack);
	static void EmptyCollisionTriangles(struct FRuntimeMeshCollisionTriangleStream& Stream, struct FRuntimeMeshCollisionTriangleStream* OutStream, int32 Slack);
	static void EmptyCollisionVertices(struct FRuntimeMeshCollisionVertexStream& Stream, struct FRuntimeMeshCollisionVertexStream* OutStream, int32 Slack);
	static void EmptyColors(struct FRuntimeMeshVertexColorStream& Stream, struct FRuntimeMeshVertexColorStream* OutStream, int32 Slack);
	static void EmptyPositions(struct FRuntimeMeshVertexPositionStream& Stream, struct FRuntimeMeshVertexPositionStream* OutStream, int32 Slack);
	static void EmptyTangents(struct FRuntimeMeshVertexTangentStream& Stream, struct FRuntimeMeshVertexTangentStream* OutStream, int32 Slack);
	static void EmptyTexCoords(struct FRuntimeMeshVertexTexCoordStream& Stream, struct FRuntimeMeshVertexTexCoordStream* OutStream, int32 Slack);
	static void EmptyTriangles(struct FRuntimeMeshTriangleStream& Stream, struct FRuntimeMeshTriangleStream* OutStream, int32 Slack);
	static struct FRuntimeMeshTriangleStream GetAdjacencyTriangleStream(struct FRuntimeMeshRenderableMeshData& MeshData, struct FRuntimeMeshRenderableMeshData* OutMeshData);
	static void GetBounds(struct FRuntimeMeshVertexPositionStream& Stream, struct FRuntimeMeshVertexPositionStream* OutStream, struct FBox* OutBounds);
	static void GetCollisionMaterialIndex(struct FRuntimeMeshCollisionMaterialIndexStream& Stream, struct FRuntimeMeshCollisionMaterialIndexStream* OutStream, int32 Param_Index, int32* OutIndex);
	static struct FRuntimeMeshCollisionMaterialIndexStream GetCollisionMaterialIndexStream(struct FRuntimeMeshCollisionData& CollisionData, struct FRuntimeMeshCollisionData* OutCollisionData);
	static void GetCollisionTexCoord(struct FRuntimeMeshVertexTexCoordStream& Stream, struct FRuntimeMeshVertexTexCoordStream* OutStream, int32 Param_Index, struct FVector2D* OutTexCoord, int32 ChannelId);
	static struct FRuntimeMeshCollisionTexCoordStream GetCollisionTexCoordStream(struct FRuntimeMeshCollisionData& CollisionData, struct FRuntimeMeshCollisionData* OutCollisionData);
	static void GetCollisionTriangle(struct FRuntimeMeshCollisionTriangleStream& Stream, struct FRuntimeMeshCollisionTriangleStream* OutStream, int32 Param_Index, int32* OutIndexA, int32* OutIndexB, int32* OutIndexC);
	static struct FRuntimeMeshCollisionTriangleStream GetCollisionTriangleStream(struct FRuntimeMeshCollisionData& CollisionData, struct FRuntimeMeshCollisionData* OutCollisionData);
	static void GetCollisionVertex(struct FRuntimeMeshCollisionVertexStream& Stream, struct FRuntimeMeshCollisionVertexStream* OutStream, int32 Param_Index, struct FVector* OutVertex);
	static struct FRuntimeMeshCollisionVertexStream GetCollisionVertexStream(struct FRuntimeMeshCollisionData& CollisionData, struct FRuntimeMeshCollisionData* OutCollisionData);
	static void GetColor(struct FRuntimeMeshVertexColorStream& Stream, struct FRuntimeMeshVertexColorStream* OutStream, int32 Param_Index, struct FLinearColor* OutColor);
	static struct FRuntimeMeshVertexColorStream GetColorStream(struct FRuntimeMeshRenderableMeshData& MeshData, struct FRuntimeMeshRenderableMeshData* OutMeshData);
	static void GetNormal(struct FRuntimeMeshVertexTangentStream& Stream, struct FRuntimeMeshVertexTangentStream* OutStream, int32 Param_Index, struct FVector* OutNormal);
	static void GetPosition(struct FRuntimeMeshVertexPositionStream& Stream, struct FRuntimeMeshVertexPositionStream* OutStream, int32 Param_Index, struct FVector* OutPosition);
	static struct FRuntimeMeshVertexPositionStream GetPositionStream(struct FRuntimeMeshRenderableMeshData& MeshData, struct FRuntimeMeshRenderableMeshData* OutMeshData);
	static void GetTangent(struct FRuntimeMeshVertexTangentStream& Stream, struct FRuntimeMeshVertexTangentStream* OutStream, int32 Param_Index, struct FVector* OutTangent);
	static void GetTangents(struct FRuntimeMeshVertexTangentStream& Stream, struct FRuntimeMeshVertexTangentStream* OutStream, int32 Param_Index, struct FVector* OutTangentX, struct FVector* OutTangentY, struct FVector* OutTangentZ);
	static struct FRuntimeMeshVertexTangentStream GetTangentStream(struct FRuntimeMeshRenderableMeshData& MeshData, struct FRuntimeMeshRenderableMeshData* OutMeshData);
	static void GetTexCoord(struct FRuntimeMeshVertexTexCoordStream& Stream, struct FRuntimeMeshVertexTexCoordStream* OutStream, int32 Param_Index, int32 ChannelId, struct FVector2D* OutTexCoord);
	static struct FRuntimeMeshVertexTexCoordStream GetTexCoordStream(struct FRuntimeMeshRenderableMeshData& MeshData, struct FRuntimeMeshRenderableMeshData* OutMeshData);
	static struct FRuntimeMeshTriangleStream GetTriangleStream(struct FRuntimeMeshRenderableMeshData& MeshData, struct FRuntimeMeshRenderableMeshData* OutMeshData);
	static void GetVertexIndex(struct FRuntimeMeshTriangleStream& Stream, struct FRuntimeMeshTriangleStream* OutStream, int32 Param_Index, int32* OutIndex);
	static void NumCollisionMaterialIndices(struct FRuntimeMeshCollisionMaterialIndexStream& Stream, struct FRuntimeMeshCollisionMaterialIndexStream* OutStream, int32* OutNumIndices);
	static void NumCollisionTexCoordChannels(struct FRuntimeMeshVertexTexCoordStream& Stream, struct FRuntimeMeshVertexTexCoordStream* OutStream, int32* OutNumTexCoordChannels);
	static void NumCollisionTexCoords(struct FRuntimeMeshCollisionTexCoordStream& Stream, struct FRuntimeMeshCollisionTexCoordStream* OutStream, int32 ChannelId, int32* OutNumTexCoords);
	static void NumCollisionTriangles(struct FRuntimeMeshCollisionTriangleStream& Stream, struct FRuntimeMeshCollisionTriangleStream* OutStream, int32* OutNumTriangles);
	static void NumCollisionVertices(struct FRuntimeMeshCollisionVertexStream& Stream, struct FRuntimeMeshCollisionVertexStream* OutStream, int32* OutNumVertices);
	static void NumColors(struct FRuntimeMeshVertexColorStream& Stream, struct FRuntimeMeshVertexColorStream* OutStream, int32* OutNumColors);
	static void NumIndices(struct FRuntimeMeshTriangleStream& Stream, struct FRuntimeMeshTriangleStream* OutStream, int32* OutNumIndices);
	static void NumPositions(struct FRuntimeMeshVertexPositionStream& Stream, struct FRuntimeMeshVertexPositionStream* OutStream, int32* OutNumPositions);
	static void NumTangents(struct FRuntimeMeshVertexTangentStream& Stream, struct FRuntimeMeshVertexTangentStream* OutStream, int32* OutNumTangents);
	static void NumTexCoordChannels(struct FRuntimeMeshVertexTexCoordStream& Stream, struct FRuntimeMeshVertexTexCoordStream* OutStream, int32* OutNumTexCoordChannels);
	static void NumTexCoords(struct FRuntimeMeshVertexTexCoordStream& Stream, struct FRuntimeMeshVertexTexCoordStream* OutStream, int32* OutNumTexCoords);
	static void NumTriangles(struct FRuntimeMeshTriangleStream& Stream, struct FRuntimeMeshTriangleStream* OutStream, int32* OutNumTriangles);
	static void SeCollisionMaterialIndex(struct FRuntimeMeshCollisionMaterialIndexStream& Stream, struct FRuntimeMeshCollisionMaterialIndexStream* OutStream, int32 Param_Index, int32 NewIndex);
	static void SetCollisionTexCoord(struct FRuntimeMeshVertexTexCoordStream& Stream, struct FRuntimeMeshVertexTexCoordStream* OutStream, int32 Param_Index, const struct FVector2D& NewTexCoord, int32 ChannelId);
	static void SetCollisionVertex(struct FRuntimeMeshCollisionVertexStream& Stream, struct FRuntimeMeshCollisionVertexStream* OutStream, int32 Param_Index, const struct FVector& NewVertex);
	static void SetColor(struct FRuntimeMeshVertexColorStream& Stream, struct FRuntimeMeshVertexColorStream* OutStream, int32 Param_Index, const struct FLinearColor& NewColor);
	static void SetNormal(struct FRuntimeMeshVertexTangentStream& Stream, struct FRuntimeMeshVertexTangentStream* OutStream, int32 Param_Index, const struct FVector& NewNormal);
	static void SetNumCollisionMaterialIndices(struct FRuntimeMeshCollisionMaterialIndexStream& Stream, struct FRuntimeMeshCollisionMaterialIndexStream* OutStream, int32 NewNum, bool bAllowShrinking);
	static void SetNumCollisionTexCoords(struct FRuntimeMeshCollisionTexCoordStream& Stream, struct FRuntimeMeshCollisionTexCoordStream* OutStream, int32 NewNumChannels, int32 NewNumTexCoords, bool bAllowShrinking);
	static void SetNumCollisionTriangles(struct FRuntimeMeshCollisionTriangleStream& Stream, struct FRuntimeMeshCollisionTriangleStream* OutStream, int32 NewNum, bool bAllowShrinking);
	static void SetNumCollisionVertices(struct FRuntimeMeshCollisionVertexStream& Stream, struct FRuntimeMeshCollisionVertexStream* OutStream, int32 NewNum, bool bAllowShrinking);
	static void SetNumColors(struct FRuntimeMeshVertexColorStream& Stream, struct FRuntimeMeshVertexColorStream* OutStream, int32 NewNum, bool bAllowShrinking);
	static void SetNumPositions(struct FRuntimeMeshVertexPositionStream& Stream, struct FRuntimeMeshVertexPositionStream* OutStream, int32 NewNum, bool bAllowShrinking);
	static void SetNumTangents(struct FRuntimeMeshVertexTangentStream& Stream, struct FRuntimeMeshVertexTangentStream* OutStream, int32 NewNum, bool bAllowShrinking);
	static void SetNumTexCoords(struct FRuntimeMeshVertexTexCoordStream& Stream, struct FRuntimeMeshVertexTexCoordStream* OutStream, int32 NewNum, bool bAllowShrinking);
	static void SetNumTriangles(struct FRuntimeMeshTriangleStream& Stream, struct FRuntimeMeshTriangleStream* OutStream, int32 NewNum, bool bAllowShrinking);
	static void SetPosition(struct FRuntimeMeshVertexPositionStream& Stream, struct FRuntimeMeshVertexPositionStream* OutStream, int32 Param_Index, const struct FVector& NewPosition);
	static void SetTangent(struct FRuntimeMeshVertexTangentStream& Stream, struct FRuntimeMeshVertexTangentStream* OutStream, int32 Param_Index, const struct FVector& NewTangent);
	static void SetTangents(struct FRuntimeMeshVertexTangentStream& Stream, struct FRuntimeMeshVertexTangentStream* OutStream, int32 Param_Index, const struct FVector& InTangentX, const struct FVector& InTangentY, const struct FVector& InTangentZ);
	static void SetTexCoord(struct FRuntimeMeshVertexTexCoordStream& Stream, struct FRuntimeMeshVertexTexCoordStream* OutStream, int32 Param_Index, const struct FVector2D& NewTexCoord, int32 ChannelId);
	static void SetVertexIndex(struct FRuntimeMeshTriangleStream& Stream, struct FRuntimeMeshTriangleStream* OutStream, int32 Param_Index, int32 NewIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshBlueprintFunctions">();
	}
	static class URuntimeMeshBlueprintFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshBlueprintFunctions>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshModifier
// 0x0000 (0x0028 - 0x0028)
class URuntimeMeshModifier : public UObject
{
public:
	void ApplyToCollisionMesh(struct FRuntimeMeshCollisionData* MeshData);
	void ApplyToMesh(struct FRuntimeMeshRenderableMeshData* MeshData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshModifier">();
	}
	static class URuntimeMeshModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshModifier>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshModifierAdjacency
// 0x0000 (0x0028 - 0x0028)
class URuntimeMeshModifierAdjacency final : public URuntimeMeshModifier
{
public:
	static void CalculateTessellationIndices(struct FRuntimeMeshRenderableMeshData* MeshData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshModifierAdjacency">();
	}
	static class URuntimeMeshModifierAdjacency* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshModifierAdjacency>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshModifierNormals
// 0x0008 (0x0030 - 0x0028)
class URuntimeMeshModifierNormals final : public URuntimeMeshModifier
{
public:
	bool                                          bComputeSmoothNormals;                             // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void CalculateNormalsTangents(struct FRuntimeMeshRenderableMeshData* MeshData, bool bInComputeSmoothNormals);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshModifierNormals">();
	}
	static class URuntimeMeshModifierNormals* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshModifierNormals>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshProvider
// 0x0030 (0x0058 - 0x0028)
class URuntimeMeshProvider : public URuntimeMeshProviderTargetInterface
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CollisionUpdateCompleted();
	bool GetAllSectionsMeshForLOD(int32 LODIndex, TMap<int32, struct FRuntimeMeshSectionData>* MeshDatas);
	struct FBoxSphereBounds GetBounds();
	bool GetCollisionMesh(struct FRuntimeMeshCollisionData* CollisionData);
	struct FRuntimeMeshCollisionSettings GetCollisionSettings();
	bool GetSectionMeshForLOD(int32 LODIndex, int32 SectionId, struct FRuntimeMeshRenderableMeshData* MeshData);
	bool HasCollisionMesh();
	void Initialize();
	bool IsThreadSafe();
	void Shutdown();

	bool IsBound() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshProvider">();
	}
	static class URuntimeMeshProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshProvider>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshProviderPassthrough
// 0x0010 (0x0068 - 0x0058)
class URuntimeMeshProviderPassthrough : public URuntimeMeshProvider
{
public:
	class URuntimeMeshProvider*                   ChildProvider;                                     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetChildProvider(class URuntimeMeshProvider* InProvider);

	class URuntimeMeshProvider* GetChildProvider() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshProviderPassthrough">();
	}
	static class URuntimeMeshProviderPassthrough* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshProviderPassthrough>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshProviderBox
// 0x0040 (0x0098 - 0x0058)
class URuntimeMeshProviderBox final : public URuntimeMeshProvider
{
public:
	uint8                                         Pad_58[0x28];                                      // 0x0058(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoxRadius;                                         // 0x0080(0x000C)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetBoxMaterial(class UMaterialInterface* InMaterial);
	void SetBoxRadius(const struct FVector& InRadius);

	class UMaterialInterface* GetBoxMaterial() const;
	struct FVector GetBoxRadius() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshProviderBox">();
	}
	static class URuntimeMeshProviderBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshProviderBox>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshProviderCollision
// 0x0170 (0x01D8 - 0x0068)
class URuntimeMeshProviderCollision final : public URuntimeMeshProviderPassthrough
{
public:
	int32                                         LODForMeshCollision;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FRuntimeMeshRenderableCollisionData> RenderableCollisionData;                           // 0x0070(0x0050)(NativeAccessSpecifierPrivate)
	TSet<int32>                                   SectionsAffectingCollision;                        // 0x00C0(0x0050)(NativeAccessSpecifierPrivate)
	struct FRuntimeMeshCollisionSettings          CollisionSettings;                                 // 0x0110(0x0048)(NativeAccessSpecifierPrivate)
	struct FRuntimeMeshCollisionData              CollisionMesh;                                     // 0x0158(0x0058)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B0[0x28];                                     // 0x01B0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCollisionMesh(const struct FRuntimeMeshCollisionData& NewCollisionMesh);
	void SetCollisionSettings(const struct FRuntimeMeshCollisionSettings& NewCollisionSettings);
	void SetRenderableLODForCollision(int32 LODIndex);
	void SetRenderableSectionAffectsCollision(int32 SectionId, bool bCollisionEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshProviderCollision">();
	}
	static class URuntimeMeshProviderCollision* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshProviderCollision>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshProviderMemoryCache
// 0x01B0 (0x0218 - 0x0068)
class URuntimeMeshProviderMemoryCache final : public URuntimeMeshProviderPassthrough
{
public:
	uint8                                         Pad_68[0x1B0];                                     // 0x0068(0x01B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearCache();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshProviderMemoryCache">();
	}
	static class URuntimeMeshProviderMemoryCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshProviderMemoryCache>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshProviderModifiers
// 0x0010 (0x0078 - 0x0068)
class URuntimeMeshProviderModifiers final : public URuntimeMeshProviderPassthrough
{
public:
	TArray<class URuntimeMeshModifier*>           Modifiers;                                         // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void AddModifier(class URuntimeMeshModifier* NewModifier);
	void RemoveModifier(class URuntimeMeshModifier* ModifierToRemove);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshProviderModifiers">();
	}
	static class URuntimeMeshProviderModifiers* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshProviderModifiers>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshProviderPlane
// 0x0088 (0x00F0 - 0x0068)
class URuntimeMeshProviderPlane final : public URuntimeMeshProviderPassthrough
{
public:
	uint8                                         Pad_68[0x2C];                                      // 0x0068(0x002C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocationA;                                         // 0x0094(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                LocationB;                                         // 0x00A0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                LocationC;                                         // 0x00AC(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<int32>                                 VertsAB;                                           // 0x00B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<int32>                                 VertsAC;                                           // 0x00C8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<float>                                 ScreenSize;                                        // 0x00D8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     Material;                                          // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshProviderPlane">();
	}
	static class URuntimeMeshProviderPlane* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshProviderPlane>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshProviderSphere
// 0x0050 (0x00A8 - 0x0058)
class URuntimeMeshProviderSphere final : public URuntimeMeshProvider
{
public:
	uint8                                         Pad_58[0x28];                                      // 0x0058(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxLOD;                                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SphereRadius;                                      // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MaxLatitudeSegments;                               // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MinLatitudeSegments;                               // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MaxLongitudeSegments;                              // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MinLongitudeSegments;                              // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LODMultiplier;                                     // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     SphereMaterial;                                    // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetLODMultiplier(float InLODMultiplier);
	void SetMaxLatitudeSegments(int32 InMaxLatitudeSegments);
	void SetMaxLongitudeSegments(int32 InMaxLongitudeSegments);
	void SetMinLatitudeSegments(int32 InMinLatitudeSegments);
	void SetMinLongitudeSegments(int32 InMinLongitudeSegments);
	void SetSphereMaterial(class UMaterialInterface* InSphereMaterial);
	void SetSphereRadius(float InSphereRadius);

	float GetLODMultiplier() const;
	int32 GetMaxLatitudeSegments() const;
	int32 GetMaxLongitudeSegments() const;
	int32 GetMinLatitudeSegments() const;
	int32 GetMinLongitudeSegments() const;
	class UMaterialInterface* GetSphereMaterial() const;
	float GetSphereRadius() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshProviderSphere">();
	}
	static class URuntimeMeshProviderSphere* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshProviderSphere>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshProviderStatic
// 0x0200 (0x0258 - 0x0058)
class URuntimeMeshProviderStatic final : public URuntimeMeshProvider
{
public:
	bool                                          StoreEditorGeneratedDataForGame;                   // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x1EF];                                     // 0x0059(0x01EF)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URuntimeMeshModifier*>           CurrentMeshModifiers;                              // 0x0248(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)

public:
	void CreateSection_Blueprint(int32 LODIndex, int32 SectionId, const struct FRuntimeMeshSectionProperties& SectionProperties, const struct FRuntimeMeshRenderableMeshData& SectionData);
	void CreateSectionFromComponents(int32 LODIndex, int32 SectionIndex, int32 MaterialSlot, const TArray<struct FVector>& Vertices, const TArray<int32>& Triangles, const TArray<struct FVector>& Normals, const TArray<struct FVector2D>& UV0, const TArray<struct FVector2D>& UV1, const TArray<struct FVector2D>& UV2, const TArray<struct FVector2D>& UV3, const TArray<struct FLinearColor>& VertexColors, const TArray<struct FRuntimeMeshTangent>& Tangents, ERuntimeMeshUpdateFrequency UpdateFrequency, bool bCreateCollision);
	struct FRuntimeMeshRenderableMeshData GetSectionRenderDataAndClear(int32 LODIndex, int32 SectionId);
	void RegisterModifier(class URuntimeMeshModifier* Modifier);
	void RemoveAllSectionsForLOD(int32 LODIndex);
	void SetCollisionMesh(const struct FRuntimeMeshCollisionData& NewCollisionMesh);
	void SetCollisionSettings(const struct FRuntimeMeshCollisionSettings& NewCollisionSettings);
	void SetRenderableLODForCollision(int32 LODIndex);
	void SetRenderableSectionAffectsCollision(int32 SectionId, bool bCollisionEnabled, bool bForceUpdate);
	void SetShouldSerializeMeshData(bool bIsSerialized);
	void UnRegisterModifier(class URuntimeMeshModifier* Modifier);
	void UpdateSection_Blueprint(int32 LODIndex, int32 SectionId, const struct FRuntimeMeshRenderableMeshData& SectionData);
	void UpdateSectionFromComponents(int32 LODIndex, int32 SectionIndex, const TArray<struct FVector>& Vertices, const TArray<int32>& Triangles, const TArray<struct FVector>& Normals, const TArray<struct FVector2D>& UV0, const TArray<struct FVector2D>& UV1, const TArray<struct FVector2D>& UV2, const TArray<struct FVector2D>& UV3, const TArray<struct FLinearColor>& VertexColors, const TArray<struct FRuntimeMeshTangent>& Tangents);

	bool DoesSectionHaveValidMeshData(int32 LODIndex, int32 SectionId) const;
	struct FRuntimeMeshCollisionData GetCollisionMeshStatic() const;
	struct FRuntimeMeshCollisionSettings GetCollisionSettingsStatic() const;
	int32 GetLastSectionId(int32 LODIndex) const;
	int32 GetLODForMeshCollision() const;
	struct FBoxSphereBounds GetSectionBounds(int32 LODIndex, int32 SectionId) const;
	TArray<int32> GetSectionIds(int32 LODIndex) const;
	struct FRuntimeMeshSectionProperties GetSectionProperties(int32 LODIndex, int32 SectionId) const;
	struct FRuntimeMeshRenderableMeshData GetSectionRenderData(int32 LODIndex, int32 SectionId) const;
	TSet<int32> GetSectionsForMeshCollision() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshProviderStatic">();
	}
	static class URuntimeMeshProviderStatic* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshProviderStatic>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshProviderStaticMesh
// 0x0010 (0x0068 - 0x0058)
class URuntimeMeshProviderStaticMesh final : public URuntimeMeshProvider
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MaxLOD;                                            // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ComplexCollisionLOD;                               // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetComplexCollisionLOD(int32 InLOD);
	void SetMaxLOD(int32 InMaxLOD);
	void SetStaticMesh(class UStaticMesh* InStaticMesh);

	int32 GetComplexCollisionLOD() const;
	int32 GetMaxLOD() const;
	class UStaticMesh* GetStaticMesh() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuntimeMeshProviderStaticMesh">();
	}
	static class URuntimeMeshProviderStaticMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeMeshProviderStaticMesh>();
	}
};

// Class RuntimeMeshComponent.RuntimeMeshSlicer
// 0x0000 (0x0028 - 0x0028)
class URuntimeMeshSlicer final : public UBlueprintFunctionLibrary
{
public:
