#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: RuntimeMeshComponent

#include "Basic.hpp"

#include "RuntimeMeshComponent_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.ClearSection
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshProviderTargetInterface_ClearSection final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.ConfigureLODs
// 0x0010 (0x0010 - 0x0000)
struct RuntimeMeshProviderTargetInterface_ConfigureLODs final
{
public:
	TArray<struct FRuntimeMeshLODProperties>      InLODs;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.CreateSection
// 0x0018 (0x0018 - 0x0000)
struct RuntimeMeshProviderTargetInterface_CreateSection final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeMeshSectionProperties          SectionProperties;                                 // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.GetMaterial
// 0x0010 (0x0010 - 0x0000)
struct RuntimeMeshProviderTargetInterface_GetMaterial final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.GetMaterialIndex
// 0x000C (0x000C - 0x0000)
struct RuntimeMeshProviderTargetInterface_GetMaterialIndex final
{
public:
	class FName                                   MaterialSlotName;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.GetMaterialSlot
// 0x0018 (0x0018 - 0x0000)
struct RuntimeMeshProviderTargetInterface_GetMaterialSlot final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeMeshMaterialSlot               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.GetMaterialSlotNames
// 0x0010 (0x0010 - 0x0000)
struct RuntimeMeshProviderTargetInterface_GetMaterialSlotNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.GetMaterialSlots
// 0x0010 (0x0010 - 0x0000)
struct RuntimeMeshProviderTargetInterface_GetMaterialSlots final
{
public:
	TArray<struct FRuntimeMeshMaterialSlot>       ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.GetNumMaterials
// 0x0004 (0x0004 - 0x0000)
struct RuntimeMeshProviderTargetInterface_GetNumMaterials final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.MarkLODDirty
// 0x0004 (0x0004 - 0x0000)
struct RuntimeMeshProviderTargetInterface_MarkLODDirty final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.MarkSectionDirty
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshProviderTargetInterface_MarkSectionDirty final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.RemoveSection
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshProviderTargetInterface_RemoveSection final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.SetLODScreenSize
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshProviderTargetInterface_SetLODScreenSize final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenSize;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.SetSectionCastsShadow
// 0x000C (0x000C - 0x0000)
struct RuntimeMeshProviderTargetInterface_SetSectionCastsShadow final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCastsShadow;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.SetSectionVisibility
// 0x000C (0x000C - 0x0000)
struct RuntimeMeshProviderTargetInterface_SetSectionVisibility final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVisible;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.SetupMaterialSlot
// 0x0018 (0x0018 - 0x0000)
struct RuntimeMeshProviderTargetInterface_SetupMaterialSlot final
{
public:
	int32                                         MaterialSlot;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotName;                                          // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     InMaterial;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshProviderTargetInterface.IsMaterialSlotNameValid
// 0x000C (0x000C - 0x0000)
struct RuntimeMeshProviderTargetInterface_IsMaterialSlotNameValid final
{
public:
	class FName                                   MaterialSlotName;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RuntimeMeshComponent.RuntimeMesh.GetBodySetup
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMesh_GetBodySetup final
{
public:
	class UBodySetup*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMesh.GetProviderPtr
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMesh_GetProviderPtr final
{
public:
	class URuntimeMeshProvider*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMesh.Initialize
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMesh_Initialize final
{
public:
	class URuntimeMeshProvider*                   Provider;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMesh.GetHitSource
// 0x0028 (0x0028 - 0x0000)
struct RuntimeMesh_GetHitSource final
{
public:
	int32                                         FaceIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeMeshCollisionHitInfo           ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMesh.GetLocalBounds
// 0x001C (0x001C - 0x0000)
struct RuntimeMesh_GetLocalBounds final
{
public:
	struct FBoxSphereBounds                       ReturnValue;                                       // 0x0000(0x001C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMesh.IsInitialized
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMesh_IsInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponent.GetOrCreateRuntimeMesh
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshComponent_GetOrCreateRuntimeMesh final
{
public:
	class URuntimeMesh*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponent.GetProvider
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshComponent_GetProvider final
{
public:
	class URuntimeMeshProvider*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponent.GetRuntimeMeshMobility
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMeshComponent_GetRuntimeMeshMobility final
{
public:
	ERuntimeMeshMobility                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponent.Initialize
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshComponent_Initialize final
{
public:
	class URuntimeMeshProvider*                   Provider;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponent.SetRuntimeMesh
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshComponent_SetRuntimeMesh final
{
public:
	class URuntimeMesh*                           NewMesh;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponent.SetRuntimeMeshMobility
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMeshComponent_SetRuntimeMeshMobility final
{
public:
	ERuntimeMeshMobility                          NewMobility;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponent.SetupMaterialSlot
// 0x0018 (0x0018 - 0x0000)
struct RuntimeMeshComponent_SetupMaterialSlot final
{
public:
	int32                                         MaterialSlot;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotName;                                          // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     InMaterial;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponent.GetHitSource
// 0x0028 (0x0028 - 0x0000)
struct RuntimeMeshComponent_GetHitSource final
{
public:
	int32                                         FaceIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeMeshCollisionHitInfo           ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponent.GetMaterialSlots
// 0x0010 (0x0010 - 0x0000)
struct RuntimeMeshComponent_GetMaterialSlots final
{
public:
	TArray<struct FRuntimeMeshMaterialSlot>       ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponent.GetRuntimeMesh
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshComponent_GetRuntimeMesh final
{
public:
	class URuntimeMesh*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.ClearSection
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshComponentStatic_ClearSection final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.CreateSection_Blueprint
// 0x0098 (0x0098 - 0x0000)
struct RuntimeMeshComponentStatic_CreateSection_Blueprint final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeMeshSectionProperties          SectionProperties;                                 // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRuntimeMeshRenderableMeshData         SectionData;                                       // 0x0018(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.CreateSectionFromComponents
// 0x00A8 (0x00A8 - 0x0000)
struct RuntimeMeshComponentStatic_CreateSectionFromComponents final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialSlot;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Vertices;                                          // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 Triangles;                                         // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Normals;                                           // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV0;                                               // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV1;                                               // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV2;                                               // 0x0060(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV3;                                               // 0x0070(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   VertexColors;                                      // 0x0080(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FRuntimeMeshTangent>            Tangents;                                          // 0x0090(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	ERuntimeMeshUpdateFrequency                   UpdateFrequency;                                   // 0x00A0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateCollision;                                  // 0x00A1(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.GetSectionRenderDataAndClear
// 0x0088 (0x0088 - 0x0000)
struct RuntimeMeshComponentStatic_GetSectionRenderDataAndClear final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeMeshRenderableMeshData         ReturnValue;                                       // 0x0008(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.GetStaticProvider
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshComponentStatic_GetStaticProvider final
{
public:
	class URuntimeMeshProviderStatic*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.RemoveAllSectionsForLOD
// 0x0004 (0x0004 - 0x0000)
struct RuntimeMeshComponentStatic_RemoveAllSectionsForLOD final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.SetCollisionMesh
// 0x0058 (0x0058 - 0x0000)
struct RuntimeMeshComponentStatic_SetCollisionMesh final
{
public:
	struct FRuntimeMeshCollisionData              NewCollisionMesh;                                  // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.SetCollisionSettings
// 0x0048 (0x0048 - 0x0000)
struct RuntimeMeshComponentStatic_SetCollisionSettings final
{
public:
	struct FRuntimeMeshCollisionSettings          NewCollisionSettings;                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.SetRenderableLODForCollision
// 0x0004 (0x0004 - 0x0000)
struct RuntimeMeshComponentStatic_SetRenderableLODForCollision final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.SetRenderableSectionAffectsCollision
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshComponentStatic_SetRenderableSectionAffectsCollision final
{
public:
	int32                                         SectionId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCollisionEnabled;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.UpdateSection_Blueprint
// 0x0088 (0x0088 - 0x0000)
struct RuntimeMeshComponentStatic_UpdateSection_Blueprint final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeMeshRenderableMeshData         SectionData;                                       // 0x0008(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.UpdateSectionFromComponents
// 0x0098 (0x0098 - 0x0000)
struct RuntimeMeshComponentStatic_UpdateSectionFromComponents final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Vertices;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 Triangles;                                         // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Normals;                                           // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV0;                                               // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV1;                                               // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV2;                                               // 0x0058(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV3;                                               // 0x0068(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   VertexColors;                                      // 0x0078(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FRuntimeMeshTangent>            Tangents;                                          // 0x0088(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.DoesSectionHaveValidMeshData
// 0x000C (0x000C - 0x0000)
struct RuntimeMeshComponentStatic_DoesSectionHaveValidMeshData final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.GetCollisionMesh
// 0x0058 (0x0058 - 0x0000)
struct RuntimeMeshComponentStatic_GetCollisionMesh final
{
public:
	struct FRuntimeMeshCollisionData              ReturnValue;                                       // 0x0000(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.GetCollisionSettings
// 0x0048 (0x0048 - 0x0000)
struct RuntimeMeshComponentStatic_GetCollisionSettings final
{
public:
	struct FRuntimeMeshCollisionSettings          ReturnValue;                                       // 0x0000(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.GetLastSectionId
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshComponentStatic_GetLastSectionId final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.GetLODForMeshCollision
// 0x0004 (0x0004 - 0x0000)
struct RuntimeMeshComponentStatic_GetLODForMeshCollision final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.GetSectionBounds
// 0x0024 (0x0024 - 0x0000)
struct RuntimeMeshComponentStatic_GetSectionBounds final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                       ReturnValue;                                       // 0x0008(0x001C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.GetSectionIds
// 0x0018 (0x0018 - 0x0000)
struct RuntimeMeshComponentStatic_GetSectionIds final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.GetSectionProperties
// 0x0018 (0x0018 - 0x0000)
struct RuntimeMeshComponentStatic_GetSectionProperties final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeMeshSectionProperties          ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.GetSectionRenderData
// 0x0088 (0x0088 - 0x0000)
struct RuntimeMeshComponentStatic_GetSectionRenderData final
{
public:
	int32                                         LODIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeMeshRenderableMeshData         ReturnValue;                                       // 0x0008(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.GetSectionsForMeshCollision
// 0x0050 (0x0050 - 0x0000)
struct RuntimeMeshComponentStatic_GetSectionsForMeshCollision final
{
public:
	TSet<int32>                                   ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.HasNormalTangentGenerationEnabled
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMeshComponentStatic_HasNormalTangentGenerationEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshComponentStatic.HasTessellationTriangleGenerationEnabled
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMeshComponentStatic_HasTessellationTriangleGenerationEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshActor.GetRuntimeMeshMobility
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMeshActor_GetRuntimeMeshMobility final
{
public:
	ERuntimeMeshMobility                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshActor.SetRuntimeMeshMobility
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMeshActor_SetRuntimeMeshMobility final
{
public:
	ERuntimeMeshMobility                          NewMobility;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshActor.GetRuntimeMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMeshActor_GetRuntimeMeshComponent final
{
public:
	class URuntimeMeshComponent*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddCollisionBox
// 0x00B8 (0x00B8 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddCollisionBox final
{
public:
	struct FRuntimeMeshCollisionSettings          Settings;                                          // 0x0000(0x0048)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshCollisionSettings          OutSettings;                                       // 0x0048(0x0048)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshCollisionBox               NewBox;                                            // 0x0090(0x0024)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddCollisionCapsule
// 0x00B0 (0x00B0 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddCollisionCapsule final
{
public:
	struct FRuntimeMeshCollisionSettings          Settings;                                          // 0x0000(0x0048)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshCollisionSettings          OutSettings;                                       // 0x0048(0x0048)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshCollisionCapsule           NewCapsule;                                        // 0x0090(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddCollisionConvex
// 0x00C0 (0x00C0 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddCollisionConvex final
{
public:
	struct FRuntimeMeshCollisionSettings          Settings;                                          // 0x0000(0x0048)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshCollisionSettings          OutSettings;                                       // 0x0048(0x0048)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshCollisionConvexMesh        NewConvex;                                         // 0x0090(0x0030)(Parm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddCollisionMaterialIndex
// 0x0028 (0x0028 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddCollisionMaterialIndex final
{
public:
	struct FRuntimeMeshCollisionMaterialIndexStream Stream;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshCollisionMaterialIndexStream OutStream;                                         // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         NewIndex;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutIndex;                                          // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddCollisionSphere
// 0x00A0 (0x00A0 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddCollisionSphere final
{
public:
	struct FRuntimeMeshCollisionSettings          Settings;                                          // 0x0000(0x0048)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshCollisionSettings          OutSettings;                                       // 0x0048(0x0048)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshCollisionSphere            NewSphere;                                         // 0x0090(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddCollisionTexCoord
// 0x0040 (0x0040 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddCollisionTexCoord final
{
public:
	struct FRuntimeMeshVertexTexCoordStream       Stream;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexTexCoordStream       OutStream;                                         // 0x0018(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FVector2D                              InTexCoord;                                        // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutIndex;                                          // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddCollisionTriangle
// 0x0030 (0x0030 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddCollisionTriangle final
{
public:
	struct FRuntimeMeshCollisionTriangleStream    Stream;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshCollisionTriangleStream    OutStream;                                         // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         NewIndexA;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewIndexB;                                         // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewIndexC;                                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutTriangleIndex;                                  // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddCollisionVertex
// 0x0030 (0x0030 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddCollisionVertex final
{
public:
	struct FRuntimeMeshCollisionVertexStream      Stream;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshCollisionVertexStream      OutStream;                                         // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FVector                                InVertex;                                          // 0x0020(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutIndex;                                          // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddColor
// 0x0038 (0x0038 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddColor final
{
public:
	struct FRuntimeMeshVertexColorStream          Stream;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexColorStream          OutStream;                                         // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FLinearColor                           InColor;                                           // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutIndex;                                          // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddIndex
// 0x0038 (0x0038 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddIndex final
{
public:
	struct FRuntimeMeshTriangleStream             Stream;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshTriangleStream             OutStream;                                         // 0x0018(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         NewIndex;                                          // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutIndex;                                          // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddNormalAndTangent
// 0x0050 (0x0050 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddNormalAndTangent final
{
public:
	struct FRuntimeMeshVertexTangentStream        Stream;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexTangentStream        OutStream;                                         // 0x0018(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FVector                                InNormal;                                          // 0x0030(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InTangent;                                         // 0x003C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutIndex;                                          // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddPosition
// 0x0030 (0x0030 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddPosition final
{
public:
	struct FRuntimeMeshVertexPositionStream       Stream;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexPositionStream       OutStream;                                         // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FVector                                InPosition;                                        // 0x0020(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutIndex;                                          // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddTangents
// 0x0058 (0x0058 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddTangents final
{
public:
	struct FRuntimeMeshVertexTangentStream        Stream;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexTangentStream        OutStream;                                         // 0x0018(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FVector                                InTangentX;                                        // 0x0030(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InTangentY;                                        // 0x003C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InTangentZ;                                        // 0x0048(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutIndex;                                          // 0x0054(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddTexCoord
// 0x0040 (0x0040 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddTexCoord final
{
public:
	struct FRuntimeMeshVertexTexCoordStream       Stream;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexTexCoordStream       OutStream;                                         // 0x0018(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         OutIndex;                                          // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InTexCoord;                                        // 0x0034(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChannelId;                                         // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AddTriangle
// 0x0040 (0x0040 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AddTriangle final
{
public:
	struct FRuntimeMeshTriangleStream             Stream;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshTriangleStream             OutStream;                                         // 0x0018(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         NewIndexA;                                         // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewIndexB;                                         // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewIndexC;                                         // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AppendColors
// 0x0030 (0x0030 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AppendColors final
{
public:
	struct FRuntimeMeshVertexColorStream          Stream;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexColorStream          OutStream;                                         // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexColorStream          InOther;                                           // 0x0020(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AppendPositions
// 0x0030 (0x0030 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AppendPositions final
{
public:
	struct FRuntimeMeshVertexPositionStream       Stream;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexPositionStream       OutStream;                                         // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexPositionStream       InOther;                                           // 0x0020(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AppendTangents
// 0x0048 (0x0048 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AppendTangents final
{
public:
	struct FRuntimeMeshVertexTangentStream        Stream;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexTangentStream        OutStream;                                         // 0x0018(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexTangentStream        InOther;                                           // 0x0030(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AppendTexCoords
// 0x0048 (0x0048 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AppendTexCoords final
{
public:
	struct FRuntimeMeshVertexTexCoordStream       Stream;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexTexCoordStream       OutStream;                                         // 0x0018(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshVertexTexCoordStream       InOther;                                           // 0x0030(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.AppendTriangles
// 0x0048 (0x0048 - 0x0000)
struct RuntimeMeshBlueprintFunctions_AppendTriangles final
{
public:
	struct FRuntimeMeshTriangleStream             Stream;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshTriangleStream             OutStream;                                         // 0x0018(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FRuntimeMeshTriangleStream             InOther;                                           // 0x0030(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RuntimeMeshComponent.RuntimeMeshBlueprintFunctions.CreateRenderableMeshData
// 0x0088 (0x0088 - 0x0000)
struct RuntimeMeshBlueprintFunctions_CreateRenderableMeshData final
{
public:
	bool                                          bWantsHighPrecisionTangents;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWantsHighPrecisionTexCoords;                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Param_NumTexCoords;                                // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWants32BitIndices;                                // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
