#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: S_CustomSquareGoalFlagsInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_CustomSquareGoalFlagsInfo.S_CustomSquareGoalFlagsInfo
// 0x0068 (0x0068 - 0x0000)
struct FS_CustomSquareGoalFlagsInfo final
{
public:
	float                                         PoleUVScale_2_0919E61E4859FBD300959BB9463502A7;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PoleColor_1_6_AB31BABA4EF80E438617419872844EDC;    // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PoleColor_2_8_775793F64145CB3307EAA4AA550D53D0;    // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FlagColor_10_BDBC6AFB44FFEFC802C097939C1BE2E7;     // 0x0024(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              FlagTexture_13_BD5A032E4042AE64AFBC03B721ADCA4E;   // 0x0038(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         FlagSpeed_16_463B4916436BE948E64B66A95109057F;     // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

