#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: S_CustomMaterials

#include "Basic.hpp"

#include "E_TextureType_structs.hpp"
#include "E_CustomMaterialTypes_structs.hpp"
#include "S_CustomTexture_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_CustomMaterials.S_CustomMaterials
// 0x0180 (0x0180 - 0x0000)
struct FS_CustomMaterials final
{
public:
	TMap<E_TextureType, struct FS_CustomTexture>  TextureValues_44_8E37F5DA4C90D9067FFDCFBA8A0EC33E; // 0x0000(0x0050)(Edit, BlueprintVisible)
	TMap<class FName, float>                      ScalarValues_33_611BFFCE46624C6D14D3FEA84524B983;  // 0x0050(0x0050)(Edit, BlueprintVisible)
	TMap<class FName, struct FLinearColor>        ColorValues_36_60CC1CCB4692E947BB38209B66BD328A;   // 0x00A0(0x0050)(Edit, BlueprintVisible)
	TMap<class FName, struct FVector>             VectorValues_39_1048A5534419A745FEEB73B75CA7D024;  // 0x00F0(0x0050)(Edit, BlueprintVisible)
	class FString                                 PhysicalResponse_17_E119B253455CA5F763A79A8B34EE463B; // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Name_45_FF24CDE348DA7B92FE0E3AB8D3D60CC8;          // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CustomMaterialTypes                         MaterialType_23_2E4A9FF54893E1C418CC41A572276DE7;  // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MaterialInstance_49_65F16C8C46BFC34F6B81DF9B0F6FB685; // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseNewCustomMaterialSave_60_541F68C14F371D04551F13BBBD15B1A4; // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 NewCustomMaterialSaveFile_56_481ADC524823B9F19EE2BBBCE0A6D467; // 0x0170(0x0010)(Edit, BlueprintVisible)
};

}

