#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: S_EditorUISettings

#include "Basic.hpp"

#include "E_EditorSettingsTypes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_EditorUISettings.S_EditorUISettings
// 0x0068 (0x0068 - 0x0000)
struct FS_EditorUISettings final
{
public:
	class FString                                 SettingsName_10_AD3FC59746E445A02B72F3BD1044750E;  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	E_EditorSettingsTypes                         Type_2_134454CA40D4603225E15681DB2E2B4D;           // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         StringData_7_7FFFE2624FE75781BFE957A4A57A0F3D;     // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<float>                                 FloatData_17_50AC89C64C526662CD93C5A0F885E356;     // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<bool>                                  BoolData_18_837AA61048F6628F1B444981F3F0AD72;      // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<struct FLinearColor>                   ColorData_22_F8DA6CD44DFFA2979D19D1A4E4E27327;     // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector>                        VectorData_26_89278EE74D3EED2DEC6B6581022EB258;    // 0x0058(0x0010)(Edit, BlueprintVisible)
};

}

