#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: S_ExponentialHeightFogData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_ExponentialHeightFogData.S_ExponentialHeightFogData
// 0x0098 (0x0098 - 0x0000)
struct FS_ExponentialHeightFogData final
{
public:
	float                                         FogDensity_2_D9EDF33548243B753362349C6CADE0CE;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FogHeightFalloff_4_448A8CD84AC75496BE443C82D8C74C89; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwondFogFogDensity_6_2FEA748A4BC80657AA245DB8E39E434D; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwondFogHeightFalloff_8_A8CADD3640891A055B050B8B729634E8; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TwondFogHeightOffset_10_048783F747DB5FEF7B752CB1F1250CB1; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FogInscatteringColor_14_7DB163824B0B90D28FA826B6D9B2AF78; // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FogMaxOpacity_15_EEBA86F7489B26BFA67AB8BA9CA4B5F2; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartDistance_18_71E98A304D6ED7D3FB9EADAE2BED872D; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FogCutoffDistance_20_FA32DE4049C7BBC08B2593AF7A7072FE; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureCube*                           InscatteringColorCubemap_23_BCF9C28C43E460647B289F958C82CDE8; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InscatteringColorCobemapAngle_29_3A70359C42C194FB89FC4182F9091870; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InscatteringTextureTint_33_DB5ECA5245110057C86ED891FCBC0238; // 0x003C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FullyDirectionalInscatteringColorDistance_34_7ED030AF46DE605DCDB79FA52C22316B; // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NonDirectionalInscatteringColorDistance_37_D267D3C449E9AB5402E2F1AA1DB782C4; // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DirectionalInscatteringExponent_39_451BAD424E9355C141800582F0DE8E35; // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DirectionalInscatteringStartDistance_41_B500ECA74110D8100BBEB1BBA913A8D8; // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DirectionalInscatteringColor_44_CCF3CCE74D6301CC676FC88CD1D17EAA; // 0x005C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VolumentricFog_47_98B9173A4421309FC18060913516BAB5; // 0x006C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScatteromgDistribution_50_2EA9452C4FADEC17CBD9D78AA4ECADAB; // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 Albedo_53_1089E77342DCE249204CE6BC16923ADC;        // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Emissive_56_DC497C294AA67CF3AC6B18B1FF08B640;      // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtinctionScale_59_FDABB3EF4BFEEB141C14669212C70CA3; // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ViewDistance_61_A7D8B5E74455781032501B8CE9D020F7;  // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StaticLightningScatteringIntensity_63_2E4903DB411768C8724B74B8D46E5F11; // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

