#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: S_FullLaneComposition

#include "Basic.hpp"

#include "E_LaneMaterials_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_FullLaneComposition.S_FullLaneComposition
// 0x0010 (0x0010 - 0x0000)
struct FS_FullLaneComposition final
{
public:
	E_LaneMaterials                               Lane_2_83941890478D0E9E05C7A180CDA031E1;           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_LaneMaterials                               Wall_4_D5FAC7DE488EA57A5BD3DE8149811D5E;           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_LaneMaterials                               Pipe_6_7CCE21CC4EF457EC17E81EA5B2897468;           // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LaneID_9_438EC1E14E532421495E68A32BC83A5D;         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WallID_11_3FAB36E14F804E44365B99A8A4949477;        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PipeID_13_22AB2B174AB5B418643375983B5C89EF;        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

