#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: S_ParticleParameter

#include "Basic.hpp"

#include "E_EditorSettingsTypes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_ParticleParameter.S_ParticleParameter
// 0x0034 (0x0034 - 0x0000)
struct FS_ParticleParameter final
{
public:
	class FName                                   ParameterName_2_6F79296D466F8BBFD5AC4E8E0F77BED0;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_EditorSettingsTypes                         ParameterType_23_216C99B0400AC150D8DFF89ADB027835; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScalarValue_10_72404DD9456955261BEB72B7E31C524F;   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VectorValue_13_131A1EE646EA324E24BD93BD37842677;   // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorValue_22_5A9282C74EE3077BA1A7099480CCC985;    // 0x001C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinValue_19_4C4F538446F40B2284D7B38DC6DCC8ED;      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue_21_D4D319E54B7CE8209BF8B8B56BF7551B;      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

