#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: S_RecommendedSettings

#include "Basic.hpp"

#include "S_RecommendedAdditionalSettings_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_RecommendedSettings.S_RecommendedSettings
// 0x0030 (0x0030 - 0x0000)
struct FS_RecommendedSettings final
{
public:
	class FString                                 Name_2_BCCF00E944230C1CE4C37CA57EA9A29C;           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Default_7_4501152C4939ACEFFCE76B83FA544DD3;        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Forcable_8_3235DCB94AE1AEDE3D3A62AE780BE96E;       // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VisibleName_11_1104F3714CE8A4F9E815BC8B4440F781;   // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Forced_15_C4060E0048F6B2D592E5BC883E41C914;        // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FS_RecommendedAdditionalSettings       AdditionalSettings_23_1CF588FD42421D8C7798EFA410240C5D; // 0x0029(0x0002)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

