#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: S_VoxelSaveData

#include "Basic.hpp"

#include "Voxel_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_VoxelSaveData.S_VoxelSaveData
// 0x0030 (0x0030 - 0x0000)
struct FS_VoxelSaveData final
{
public:
	int32                                         WorldSize_2_76812986406C5DADC9887BBCBAB97395;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VoxelSize_4_6C44646240EFB3C6BB9B8392561FB568;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoxelRenderType                              VoxelRenderType_8_B1B59CF948596FE840C302B26DFA67E7; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoxelCompressedWorldSave              WorldSave_11_1F0DB2D84A3179D71FA9B588C75F505C;     // 0x0010(0x0020)(Edit, BlueprintVisible)
};

}

