#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: StaticEventActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_Editor_Themes_structs.hpp"
#include "EventValues_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EventDefaults_structs.hpp"
#include "EditorTransformStruct_structs.hpp"
#include "S_AdditionalObjectInfo_structs.hpp"
#include "EventDefaultValues_structs.hpp"
#include "RotatorStruct_structs.hpp"
#include "EventMaster_structs.hpp"
#include "EventSingle_structs.hpp"
#include "ByteMeshStruct_structs.hpp"
#include "RawByteStruct_structs.hpp"
#include "AudioSoundStruct_structs.hpp"
#include "PostProcess_Struct_structs.hpp"
#include "S_FullLaneComposition_structs.hpp"
#include "S_EditorUISettings_structs.hpp"
#include "GolfIt_structs.hpp"
#include "Enum_EventObjectType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass StaticEventActor.StaticEventActor_C
// 0x0C20 (0x0E40 - 0x0220)
class AStaticEventActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget_Text;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshObjet;                                   // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         UniqueId;                                          // 0x0248(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EventDefaults>                         EventTypeQue;                                      // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FEventValues>                   EventValuesQue;                                    // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentQueIndex;                                   // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPointLightComponent*                   Light;                                             // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventDefaultValues                    Default;                                           // 0x0280(0x0220)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class FString                                 TextValueDefault;                                  // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class AEditorTransformer_C*                   TransformerRef;                                    // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasAttachedActors;                                 // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_Editor_Themes                               AreaCategorie;                                     // 0x04B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BA[0x6];                                      // 0x04BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditorTransformStruct                 TransformSettings;                                 // 0x04C0(0x0090)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class AEventTrigger_C*                        EventRef;                                          // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorValueDefault;                                 // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatValueDefault;                                 // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABoost_C*                               BoostRef;                                          // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IntValueDefault;                                   // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VectorValueDefault;                                // 0x057C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARotator3_C*                            RotatorRef;                                        // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotatorStruct                         RotatorStruct;                                     // 0x0590(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventMaster                           EventMasterDefault;                                // 0x05A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x05F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeUntilDone;                                     // 0x05FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             TransformOrigin;                                   // 0x0600(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             TransformTarget;                                   // 0x0630(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DefaultVisibility;                                 // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DefaultCollision;                                  // 0x0661(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_662[0x6];                                      // 0x0662(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             DefaultMaterials;                                  // 0x0668(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AGolfItBaseGoal*                        GoalRef;                                           // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATeleportEditor_C*                      TeleporterRef;                                     // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolDefault;                                       // 0x0688(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FByteMeshStruct>                DefaultDynamicMesh;                                // 0x0690(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ADynamicMesh_C*                         DynamicMeshRef;                                    // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultLightIntensity;                             // 0x06A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultLightRadius;                                // 0x06AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ParticleDefault;                                   // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystemRef;                                 // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 GravitationalRef;                                  // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_StaticEventActor_C;                           // 0x06C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FRawByteStruct>                 DefaultRawByteStruct;                              // 0x06D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AInstantResetArea_C*                    ResetAreaRef;                                      // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 UniqueName;                                        // 0x06F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Resetted;                                          // 0x0700(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RotationAdded;                                     // 0x0701(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_702[0x2];                                      // 0x0702(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotatorStruct                         AddRotations;                                      // 0x0704(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RotationDelta;                                     // 0x071C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RotationsDone;                                     // 0x0728(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Timeoutcounter;                                    // 0x0734(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAudioEvent_C*                          AudioRef;                                          // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAudioSoundStruct                      AudioStruct;                                       // 0x0740(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          HasChangedThemeViaEvent;                           // 0x0780(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_781[0x7];                                      // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGolfItBaseWater*                       WaterRef;                                          // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       LightSphere;                                       // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    LightError;                                        // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventSingle                           CurrentEvent;                                      // 0x07A0(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 OldName;                                           // 0x07E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class APostProcessVolume_C*                   PP_VolumeRef;                                      // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostProcess_Struct                    PP_Settings;                                       // 0x0800(0x05C0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class AActor*                                 ViewRef;                                           // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URuntimeMeshComponentStatic*            PhysicalComponent;                                 // 0x0DC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cull;                                              // 0x0DD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NormalObject;                                      // 0x0DD4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD5[0x3];                                      // 0x0DD5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGolfItBaseGoal*>                GoalArray;                                         // 0x0DD8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FS_FullLaneComposition                 LaneComposition;                                   // 0x0DE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TextVersion;                                       // 0x0DF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DFC[0x4];                                      // 0x0DFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TempActor;                                         // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_AdditionalObjectInfo>        Additional_Data;                                   // 0x0E08(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          AttachedViaEvents;                                 // 0x0E18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E19[0x7];                                      // 0x0E19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      NiagaraParticleSystemRef;                          // 0x0E20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NiagaraParticleDefault;                            // 0x0E28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_EditorUISettings>            Particle_Data;                                     // 0x0E30(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_StaticEventActor(int32 EntryPoint);
	void DestroyAttachedComponent(class UActorComponent* ComponentToDestroy);
	void MulticastReferenceFromOriginal(class FName Tag);
	void SetPP_Server(const struct FPostProcess_Struct& NewSettings);
	void SetIntegerEventID(int32 Param_UniqueId);
	void ChangeTextVersion();
	void SetPP_Settings(const struct FPostProcess_Struct& NewSettings);
	void DuplicationEvent();
	void SetLaneCompositionMulticast(const struct FS_FullLaneComposition& Param_LaneComposition, E_Editor_Themes Area);
	void SetDrawDistance();
	void CheckAllIds();
	void RetryPPWithSameID();
	void ServerName(const class FString& NewName);
	void StartAddRotation(const struct FRotatorStruct& RotationAdd, float Delay);
	void GenerateName(const class FString& NewName, bool Generate);
	void MulticastName(const class FString& NewName);
	void SetTransformForAll_Multicast(const struct FTransform& Transform);
	void ReceiveBeginPlay();
	void MulticastLoadSavedStates();
	void SetTransfromMulticast(const struct FEditorTransformStruct& NewTransform);
	void SetGravitationalForceMulticast(float Value);
	void MulticastTags(const TArray<class FName>& Param_Tags);
	void MulticastSetDefault(const struct FEventDefaultValues& New_Default);
	void MulticastSetID(int32 NewID);
	void MulticastSetEventMaster(const struct FEventMaster& Master);
	void Multicast_ResetEvent();
	void Server_ResetEvent();
	void RegisterToLoad();
	void SetTeleporterMulticast(int32 ID, bool PrimaryExit);
	void SetGoalMulticast(int32 Hole, const struct FVector& AdditionalInfo);
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);
	void StartDurationTransform(float Param_Duration, const struct FTransform& TargetTransform);
	void SetRotatorMulticast(float Pitch, float Yaw, float Roll, const struct FVector& Offset);
	void SetTextMulticast(const class FString& Text, const struct FLinearColor& Color);
	void SetLightMulticast(float Radius, float Intensity, const struct FLinearColor& Color, bool CastShadow);
	void SetDefaults();
	void ResetToDefault();
	void CategoriesObjectFromRef(class AActor* Actor_Ref, class UStaticMesh* NewStaticMesh);
	void NextEvent();
	void AddEvent(const struct FEventSingle& Event);
	void ContinueEvent();
	void StopDynamicEvent();
	void ReStartDynamicEvent();
	void CheckRefActorAndDestroy(class AActor* RefActor);
	void SetLightFunction(class ASimpleEditorActor_C* Self2);
	void SettingDefaults();
	void GettingAndApplyingDefaults();
	void SetTransformerSettings(class ASimpleEditorActor_C* Ref);
	void OnRep_TransformSettings();
	void SetEventSettings(class ASimpleEditorActor_C* Ref);
	void SetTextSettings(class ASimpleEditorActor_C* Ref);
	void SetBoostSettings(class ASimpleEditorActor_C* Ref);
	void CheckAndSetBoostValue();
	void CheckAndSetLightValue();
	void SetRotatorSettings(class ASimpleEditorActor_C* Ref);
	void StartEventsOnAttachedActors(const struct FEventSingle& InputPin, bool* Failed);
	void LoadSavedSettings();
	void HideAllMaterialsOnEventActor();
	void Defaulting_Rotator();
	void Defaulting_Boost();
	void Defaulting_Transformer();
	void Defaulting_Light();
	void Defaulting_Text();
	void Defaulting_Event();
	void HideEventActorIfGameSession();
	void MF_Set_Light(float LightRadius, float LightIntensity, const struct FLinearColor& LightColor, bool CastShadow);
	void MF_Set_Text(const class FString& Text, const struct FLinearColor& Color);
	void MF_Set_Rotator(float Pitch, float Yaw, float Roll, const struct FVector& Offset);
	void TransformActorInDuration(const struct FTransform& Target, float Tick);
	void SetVisibility(bool NewVis, bool Event);
	void SetCollision(bool NewCollision);
	void SetGoalSettings(class ASimpleEditorActor_C* Ref);
	void MF_Set_Goal(int32 HoleNumber, const struct FVector& AdditionalInfo);
	void DefaultingHole();
	void SetTeleporterSettings(class ASimpleEditorActor_C* Ref);
	void DefaultingTeleporter();
	void MF_Set_Teleporter(int32 ID, bool PrimaryExit);
	void SetDynamicMeshSettings(class ADynamicMesh_C* DynamicMesh);
	void CheckAllDynamic(bool* Valid);
	void SetFXSettings(class ASimpleEditorActor_C* Ref);
	void DefaultingFX();
	void SetAdvancedVisibilty(bool NewVis);
	void DefaultingDynamicMesh();
	void SetAdvancedCollision(bool New_Collision);
	void SetForceFields(class ASimpleEditorActor_C* Ref);
	void Defaulting_ForceFields();
	void MF_Set_Grav(float Value);
	void DefaultingWorldSettings();
	void ApplyingAreaDefault(E_Editor_Themes NewArea, bool UseAsEvent);
	void ChangeTheme(const class FString& Value);
	void SetMaterialsToInterfaces();
	void SetResetSettings(class ASimpleEditorActor_C* Ref);
	void Defaulting_ResetArea();
	void AddRotationInDuration(float Tick);
	void SetSoundSettings(class ASimpleEditorActor_C* Ref);
	void DefaultingSound();
	void SetWaterSettings(class ASimpleEditorActor_C* Ref);
	void AddingLightSphereCollision();
	void FixOldNamesOfEvents();
	void SetPPSettings(class ASimpleEditorActor_C* Ref);
	void DefaultingPPVolume();
	void CheckAllPP(bool* Valid);
	void DeactivateEventObjects();
	void ActivateEventObjects();
	void SetViewSettings(class ASimpleEditorActor_C* Ref);
	void DefaultingView();
	void LaneChange(class UStaticMeshComponent* MeshToChange);
	void WallChange(class UStaticMeshComponent* MeshToChange);
	void PipeChange(class UStaticMeshComponent* MeshToChange);
	void ChangeLaneMaterials(class UStaticMeshComponent* MeshToChange, E_Editor_Themes Area);
	void RevertObjectMaterials();
	void SetCameraSettings(class ASimpleEditorActor_C* Ref);
	void CheckMapLoadCompleted(bool* NeedRetry);
	void SpawnGoals(class FName SocketName);
	void GetAdditionalGoalData();
	void LoadAdditionalGoalData();
	void GetAdditionalWaterData();
	void LoadAdditionalWaterData();
	void UpdateFXParameters(TArray<struct FS_EditorUISettings>& NewData);
	void CheckIfUniqueID(int32 UnqieID, bool* HasID);
	void GetUniqueID(int32* UniqeID);
	void StartEvent(EventDefaults EventDefaults, const struct FEventValues& EventValues, float* Delay);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StaticEventActor_C">();
	}
	static class AStaticEventActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStaticEventActor_C>();
	}
};

}

