#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: SteamVR

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SteamVR_structs.hpp"


namespace SDK::Params
{

// Function SteamVR.SteamVRChaperoneComponent.GetBounds
// 0x0010 (0x0010 - 0x0000)
struct SteamVRChaperoneComponent_GetBounds final
{
public:
	TArray<struct FVector>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SteamVR.SteamVRFunctionLibrary.GetHandPositionAndOrientation
// 0x0024 (0x0024 - 0x0000)
struct SteamVRFunctionLibrary_GetHandPositionAndOrientation final
{
public:
	int32                                         ControllerIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EControllerHand                               Hand;                                              // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutPosition;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OutOrientation;                                    // 0x0014(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SteamVR.SteamVRFunctionLibrary.GetTrackedDevicePositionAndOrientation
// 0x0020 (0x0020 - 0x0000)
struct SteamVRFunctionLibrary_GetTrackedDevicePositionAndOrientation final
{
public:
	int32                                         DeviceID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutPosition;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OutOrientation;                                    // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SteamVR.SteamVRFunctionLibrary.GetValidTrackedDeviceIds
// 0x0018 (0x0018 - 0x0000)
struct SteamVRFunctionLibrary_GetValidTrackedDeviceIds final
{
public:
	ESteamVRTrackedDeviceType                     DeviceType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OutTrackedDeviceIds;                               // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function SteamVR.SteamVRHQStereoLayerShape.SetAntiAlias
// 0x0001 (0x0001 - 0x0000)
struct SteamVRHQStereoLayerShape_SetAntiAlias final
{
public:
	bool                                          InAntiAlias;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SteamVR.SteamVRHQStereoLayerShape.SetAutoCurveMaxDistance
// 0x0004 (0x0004 - 0x0000)
struct SteamVRHQStereoLayerShape_SetAutoCurveMaxDistance final
{
public:
	float                                         InDistance;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SteamVR.SteamVRHQStereoLayerShape.SetAutoCurveMinDistance
// 0x0004 (0x0004 - 0x0000)
struct SteamVRHQStereoLayerShape_SetAutoCurveMinDistance final
{
public:
	float                                         InDistance;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SteamVR.SteamVRHQStereoLayerShape.SetCurved
// 0x0001 (0x0001 - 0x0000)
struct SteamVRHQStereoLayerShape_SetCurved final
{
public:
	bool                                          InCurved;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

