#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: UE_Assimp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProceduralMeshComponent_structs.hpp"
#include "UE_Assimp_structs.hpp"


namespace SDK::Params
{

// Function UE_Assimp.AICamera.GetAspectRatio
// 0x0004 (0x0004 - 0x0000)
struct AICamera_GetAspectRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AICamera.GetCameraFOV
// 0x0004 (0x0004 - 0x0000)
struct AICamera_GetCameraFOV final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AICamera.GetCameraName
// 0x0010 (0x0010 - 0x0000)
struct AICamera_GetCameraName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AICamera.GetClipPlaneFar
// 0x0004 (0x0004 - 0x0000)
struct AICamera_GetClipPlaneFar final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AICamera.GetClipPlaneNear
// 0x0004 (0x0004 - 0x0000)
struct AICamera_GetClipPlaneNear final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AICamera.GetLookAtVector
// 0x000C (0x000C - 0x0000)
struct AICamera_GetLookAtVector final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AICamera.GetPosition
// 0x000C (0x000C - 0x0000)
struct AICamera_GetPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AICamera.GetUpVector
// 0x000C (0x000C - 0x0000)
struct AICamera_GetUpVector final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetAreaLightSize
// 0x0008 (0x0008 - 0x0000)
struct AILight_GetAreaLightSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetAttenuationConstant
// 0x0004 (0x0004 - 0x0000)
struct AILight_GetAttenuationConstant final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetAttenuationLinear
// 0x0004 (0x0004 - 0x0000)
struct AILight_GetAttenuationLinear final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetAttenuationQuadratic
// 0x0004 (0x0004 - 0x0000)
struct AILight_GetAttenuationQuadratic final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetColorAmbient
// 0x0010 (0x0010 - 0x0000)
struct AILight_GetColorAmbient final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetColorDiffuse
// 0x0010 (0x0010 - 0x0000)
struct AILight_GetColorDiffuse final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetColorSpecular
// 0x0010 (0x0010 - 0x0000)
struct AILight_GetColorSpecular final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetConeInnerAngle
// 0x0004 (0x0004 - 0x0000)
struct AILight_GetConeInnerAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetConeOuterAngle
// 0x0004 (0x0004 - 0x0000)
struct AILight_GetConeOuterAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetLightDirection
// 0x000C (0x000C - 0x0000)
struct AILight_GetLightDirection final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetLightName
// 0x0010 (0x0010 - 0x0000)
struct AILight_GetLightName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetLightPosition
// 0x000C (0x000C - 0x0000)
struct AILight_GetLightPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetLightType
// 0x0001 (0x0001 - 0x0000)
struct AILight_GetLightType final
{
public:
	EAssimpLightType                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AILight.GetUpDirection
// 0x000C (0x000C - 0x0000)
struct AILight_GetUpDirection final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIMaterial.GetMaterialTexture
// 0x0028 (0x0028 - 0x0000)
struct AIMaterial_GetMaterialTexture final
{
public:
	EAiTextureType                                Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              UVScale;                                           // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Param_Index;                                       // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Path;                                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAiTextureMapping                             Mapping;                                           // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAssimpReturn                                 ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function UE_Assimp.AIMaterial.GetMaterialBaseColor
// 0x0010 (0x0010 - 0x0000)
struct AIMaterial_GetMaterialBaseColor final
{
public:
	struct FLinearColor                           BaseColor;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIMaterial.GetMaterialName
// 0x0010 (0x0010 - 0x0000)
struct AIMaterial_GetMaterialName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIMaterial.GetMaterialOpacity
// 0x0004 (0x0004 - 0x0000)
struct AIMaterial_GetMaterialOpacity final
{
public:
	float                                         Opacity;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIMesh.GetAllBones
// 0x0010 (0x0010 - 0x0000)
struct AIMesh_GetAllBones final
{
public:
	TArray<struct FAIBone>                        Bones;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIMesh.GetMaterialIndex
// 0x0004 (0x0004 - 0x0000)
struct AIMesh_GetMaterialIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIMesh.GetMeshDataForProceduralMesh
// 0x0050 (0x0050 - 0x0000)
struct AIMesh_GetMeshDataForProceduralMesh final
{
public:
	TArray<struct FVector>                        Vertices;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Triangles;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Normals;                                           // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV0;                                               // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FProcMeshTangent>               Tangents;                                          // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIMesh.GetMeshNormals
// 0x0010 (0x0010 - 0x0000)
struct AIMesh_GetMeshNormals final
{
public:
	TArray<struct FVector>                        Normals;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIMesh.GetMeshVertices
// 0x0010 (0x0010 - 0x0000)
struct AIMesh_GetMeshVertices final
{
public:
	TArray<struct FVector>                        Vertices;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIMesh.GetNumVertices
// 0x0004 (0x0004 - 0x0000)
struct AIMesh_GetNumVertices final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIMesh.GetStaticMesh
// 0x0008 (0x0008 - 0x0000)
struct AIMesh_GetStaticMesh final
{
public:
	class UStaticMesh*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIMesh.GetMeshName
// 0x0010 (0x0010 - 0x0000)
struct AIMesh_GetMeshName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AINode.GetNodeMeshes
// 0x0018 (0x0018 - 0x0000)
struct AINode_GetNodeMeshes final
{
public:
	TArray<class UAIMesh*>                        Meshes;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function UE_Assimp.AINode.GetRootTransform
// 0x0030 (0x0030 - 0x0000)
struct AINode_GetRootTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AINode.GetScene
// 0x0008 (0x0008 - 0x0000)
struct AINode_GetScene final
{
public:
	class UAIScene*                               ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AINode.GetChildNodes
// 0x0010 (0x0010 - 0x0000)
struct AINode_GetChildNodes final
{
public:
	TArray<class UAINode*>                        ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AINode.GetNodeName
// 0x0010 (0x0010 - 0x0000)
struct AINode_GetNodeName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AINode.GetNodeTransform
// 0x0030 (0x0030 - 0x0000)
struct AINode_GetNodeTransform final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AINode.GetParentNode
// 0x0010 (0x0010 - 0x0000)
struct AINode_GetParentNode final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAINode*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIScene.GetEmbeddedTexture
// 0x0020 (0x0020 - 0x0000)
struct AIScene_GetEmbeddedTexture final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsNormalMap;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIScene.GetMeshAtIndex
// 0x0010 (0x0010 - 0x0000)
struct AIScene_GetMeshAtIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIMesh*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIScene.GetRootNode
// 0x0008 (0x0008 - 0x0000)
struct AIScene_GetRootNode final
{
public:
	class UAINode*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIScene.GetSceneScale
// 0x0004 (0x0004 - 0x0000)
struct AIScene_GetSceneScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIScene.GetUnitScaleFactor
// 0x0004 (0x0004 - 0x0000)
struct AIScene_GetUnitScaleFactor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIScene.SpawnAllMeshes
// 0x0050 (0x0050 - 0x0000)
struct AIScene_SpawnAllMeshes final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ClassToSpawn;                                      // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMeshComponent*>                 ReturnValue;                                       // 0x0038(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function UE_Assimp.AIScene.GetAllCameras
// 0x0010 (0x0010 - 0x0000)
struct AIScene_GetAllCameras final
{
public:
	TArray<class UAICamera*>                      ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIScene.GetAllLights
// 0x0010 (0x0010 - 0x0000)
struct AIScene_GetAllLights final
{
public:
	TArray<class UAILight*>                       ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIScene.GetAllMaterials
// 0x0010 (0x0010 - 0x0000)
struct AIScene_GetAllMaterials final
{
public:
	TArray<class UAIMaterial*>                    ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AIScene.GetAllMeshes
// 0x0010 (0x0010 - 0x0000)
struct AIScene_GetAllMeshes final
{
public:
	TArray<class UAIMesh*>                        ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.AiPostProcess_GenNormals
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_AiPostProcess_GenNormals final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.ApplyNormalMapSettingsToTexture
// 0x0008 (0x0008 - 0x0000)
struct AssimpFunctionLibrary_ApplyNormalMapSettingsToTexture final
{
public:
	class UTexture2D*                             In;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.GetBoneName
// 0x0018 (0x0018 - 0x0000)
struct AssimpFunctionLibrary_GetBoneName final
{
public:
	struct FAIBone                                Bone;                                              // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.GetBoneTransform
// 0x0040 (0x0040 - 0x0000)
struct AssimpFunctionLibrary_GetBoneTransform final
{
public:
	struct FAIBone                                Bone;                                              // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.GetBoneWeights
// 0x0018 (0x0018 - 0x0000)
struct AssimpFunctionLibrary_GetBoneWeights final
{
public:
	struct FAIBone                                Bone;                                              // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FAIVertexWeight>                Weights;                                           // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.GetNumOfWeights
// 0x0010 (0x0010 - 0x0000)
struct AssimpFunctionLibrary_GetNumOfWeights final
{
public:
	struct FAIBone                                Bone;                                              // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function UE_Assimp.AssimpFunctionLibrary.ImportScene
// 0x0028 (0x0028 - 0x0000)
struct AssimpFunctionLibrary_ImportScene final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ParentObject;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param_Flags;                                       // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableAutoSpaceChange;                            // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIScene*                               ReturnValue;                                       // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.ImportScenes
// 0x0030 (0x0030 - 0x0000)
struct AssimpFunctionLibrary_ImportScenes final
{
public:
	TArray<class FString>                         InFilenames;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UObject*                                ParentObject;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAIScene*>                       Scenes;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         Param_Flags;                                       // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableAutoSpaceChange;                            // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function UE_Assimp.AssimpFunctionLibrary.OpenFileDialogue
// 0x0060 (0x0060 - 0x0000)
struct AssimpFunctionLibrary_OpenFileDialogue final
{
public:
	class FString                                 DialogTitle;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultPath;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultFile;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FileTypes;                                         // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Param_Flags;                                       // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         OutFilenames;                                      // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          MultiSelect;                                       // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0059(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_CalcTangentSpace
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_CalcTangentSpace final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_Debone
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_Debone final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_DropNormals
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_DropNormals final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_EmbedTextures
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_EmbedTextures final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_FindDegenerates
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_FindDegenerates final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_FindInstances
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_FindInstances final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_FindInvalidData
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_FindInvalidData final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_FixInfacingNormals
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_FixInfacingNormals final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_FlipUVs
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_FlipUVs final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_FlipWindingOrder
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_FlipWindingOrder final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_ForceGenNormals
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_ForceGenNormals final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_GenBoundingBoxes
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_GenBoundingBoxes final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_GenSmoothNormals
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_GenSmoothNormals final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_GenUVCoords
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_GenUVCoords final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_GlobalScale
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_GlobalScale final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_ImproveCacheLocality
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_ImproveCacheLocality final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_JoinIdenticalVertices
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_JoinIdenticalVertices final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_LimitBoneWeights
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_LimitBoneWeights final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_MakeLeftHanded
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_MakeLeftHanded final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_OptimizeGraph
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_OptimizeGraph final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_OptimizeMeshes
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_OptimizeMeshes final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_PopulateArmatureData
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_PopulateArmatureData final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_PreTransformVertices
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_PreTransformVertices final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_RemoveComponent
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_RemoveComponent final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_RemoveRedundantMaterials
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_RemoveRedundantMaterials final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_SortByPType
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_SortByPType final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_SplitByBoneCount
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_SplitByBoneCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_TransformUVCoords
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_TransformUVCoords final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_Triangulate
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_Triangulate final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.PostProcess_ValidateDataStructure
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_PostProcess_ValidateDataStructure final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.Process_ConvertToLeftHanded
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_Process_ConvertToLeftHanded final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.ProcessPreset_TargetRealtime_Fast
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_ProcessPreset_TargetRealtime_Fast final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.ProcessPreset_TargetRealtime_MaxQuality
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_ProcessPreset_TargetRealtime_MaxQuality final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.ProcessPreset_TargetRealtime_Quality
// 0x0004 (0x0004 - 0x0000)
struct AssimpFunctionLibrary_ProcessPreset_TargetRealtime_Quality final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.SetActorNameDebug
// 0x0018 (0x0018 - 0x0000)
struct AssimpFunctionLibrary_SetActorNameDebug final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpFunctionLibrary.ImportScenesAsync
// 0x0040 (0x0040 - 0x0000)
struct AssimpFunctionLibrary_ImportScenesAsync final
{
public:
	TArray<class FString>                         InFilenames;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UObject*                                ParentObject;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param_Flags;                                       // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableAutoSpaceChange;                            // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float NormalPercentage, class UAIScene* ImportedScene)> OnProgressUpdated;                                 // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(TArray<class UAIScene*>& ImportedScenes)> OnImportSceneComplete;                             // 0x0030(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UE_Assimp.AssimpMesh.SetupMesh
// 0x0008 (0x0008 - 0x0000)
struct AssimpMesh_SetupMesh final
{
public:
	class UAIMesh*                                InMeshData;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

