#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: VoxelGraph

#include "Basic.hpp"

#include "Voxel_structs.hpp"
#include "Voxel_classes.hpp"
#include "VoxelGraph_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VoxelGraph.VoxelGraphGeneratorHelper
// 0x0008 (0x0030 - 0x0028)
class UVoxelGraphGeneratorHelper : public UVoxelTransformableGenerator
{
public:
	bool                                          bEnableRangeAnalysis;                              // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelGraphGeneratorHelper">();
	}
	static class UVoxelGraphGeneratorHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelGraphGeneratorHelper>();
	}
};

// Class VoxelGraph.VoxelNode
// 0x0030 (0x0058 - 0x0028)
class UVoxelNode : public UObject
{
public:
	TArray<struct FVoxelPin>                      InputPins;                                         // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVoxelPin>                      OutputPins;                                        // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UVoxelGraphGenerator*                   Graph;                                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InputPinCount;                                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode">();
	}
	static class UVoxelNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode>();
	}
};

// Class VoxelGraph.VoxelNodeHelper
// 0x0040 (0x0098 - 0x0058)
class UVoxelNodeHelper : public UVoxelNode
{
public:
	uint8                                         Pad_58[0x40];                                      // 0x0058(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNodeHelper">();
	}
	static class UVoxelNodeHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNodeHelper>();
	}
};

// Class VoxelGraph.VoxelPureNode
// 0x0000 (0x0098 - 0x0098)
class UVoxelPureNode : public UVoxelNodeHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelPureNode">();
	}
	static class UVoxelPureNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelPureNode>();
	}
};

// Class VoxelGraph.VoxelNode_SmoothStep
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_SmoothStep final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_SmoothStep">();
	}
	static class UVoxelNode_SmoothStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_SmoothStep>();
	}
};

// Class VoxelGraph.VDI_Capsule_Graph
// 0x0008 (0x0038 - 0x0030)
class UVDI_Capsule_Graph final : public UVoxelGraphGeneratorHelper
{
public:
	float                                         Noise_Amplitude;                                   // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seed;                                              // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VDI_Capsule_Graph">();
	}
	static class UVDI_Capsule_Graph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVDI_Capsule_Graph>();
	}
};

// Class VoxelGraph.VDI_Example_Crater_Graph
// 0x0000 (0x0030 - 0x0030)
class UVDI_Example_Crater_Graph final : public UVoxelGraphGeneratorHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VDI_Example_Crater_Graph">();
	}
	static class UVDI_Example_Crater_Graph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVDI_Example_Crater_Graph>();
	}
};

// Class VoxelGraph.VoxelNode_MakeColorInt
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_MakeColorInt final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_MakeColorInt">();
	}
	static class UVoxelNode_MakeColorInt* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_MakeColorInt>();
	}
};

// Class VoxelGraph.VDI_Ravine_Graph
// 0x0000 (0x0030 - 0x0030)
class UVDI_Ravine_Graph final : public UVoxelGraphGeneratorHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VDI_Ravine_Graph">();
	}
	static class UVDI_Ravine_Graph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVDI_Ravine_Graph>();
	}
};

// Class VoxelGraph.VoxelExample_Cave
// 0x0040 (0x0070 - 0x0030)
class UVoxelExample_Cave final : public UVoxelGraphGeneratorHelper
{
public:
	float                                         Bottom_Noise_Frequency;                            // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Bottom_Noise_Scale;                                // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Bottom_Noise_Seed;                                 // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Global_Height_Seed;                                // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Top_Noise_Seed;                                    // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Top_Noise_Frequency;                               // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Top_Noise_Scale;                                   // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Bottom_Top_Merge_Smoothness;                       // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Global_Height_Merge_Smoothness;                    // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Global_Height_Noise_Frequency;                     // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Global_Height_Noise_Scale;                         // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Global_Height_Offset;                              // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cave_Height;                                       // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cave_Radius;                                       // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cave_Walls_Smoothness;                             // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelExample_Cave">();
	}
	static class UVoxelExample_Cave* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelExample_Cave>();
	}
};

// Class VoxelGraph.VDI_Sphere_Graph
// 0x0000 (0x0030 - 0x0030)
class UVDI_Sphere_Graph final : public UVoxelGraphGeneratorHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VDI_Sphere_Graph">();
	}
	static class UVDI_Sphere_Graph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVDI_Sphere_Graph>();
	}
};

// Class VoxelGraph.VoxelNode_BNot
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_BNot final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_BNot">();
	}
	static class UVoxelNode_BNot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_BNot>();
	}
};

// Class VoxelGraph.VG_Example_Craters
// 0x0008 (0x0038 - 0x0030)
class UVG_Example_Craters final : public UVoxelGraphGeneratorHelper
{
public:
	float                                         Radius;                                            // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VG_Example_Craters">();
	}
	static class UVG_Example_Craters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVG_Example_Craters>();
	}
};

// Class VoxelGraph.VG_Example_Dunes
// 0x0018 (0x0048 - 0x0030)
class UVG_Example_Dunes final : public UVoxelGraphGeneratorHelper
{
public:
	float                                         Direction_X;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Direction_Y;                                       // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Dune_Frequency;                                    // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Noise_Frequency;                                   // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VG_Example_Dunes">();
	}
	static class UVG_Example_Dunes* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVG_Example_Dunes>();
	}
};

// Class VoxelGraph.VoxelNode_ILeftBitShift
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_ILeftBitShift final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_ILeftBitShift">();
	}
	static class UVoxelNode_ILeftBitShift* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_ILeftBitShift>();
	}
};

// Class VoxelGraph.VG_Example_Erosion
// 0x0068 (0x0098 - 0x0030)
class UVG_Example_Erosion final : public UVoxelGraphGeneratorHelper
{
public:
	float                                         Erosion_Material_Offset;                           // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Erosion_Material_Strength;                         // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Erosion_Strength;                                  // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      Rocks;                                             // 0x0040(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      Snow;                                              // 0x0068(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Valleys_Height;                                    // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VG_Example_Erosion">();
	}
	static class UVG_Example_Erosion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVG_Example_Erosion>();
	}
};

// Class VoxelGraph.VG_Example_FastCraters
// 0x0000 (0x0030 - 0x0030)
class UVG_Example_FastCraters final : public UVoxelGraphGeneratorHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VG_Example_FastCraters">();
	}
	static class UVG_Example_FastCraters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVG_Example_FastCraters>();
	}
};

// Class VoxelGraph.VoxelNode_1MinusX
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_1MinusX final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_1MinusX">();
	}
	static class UVoxelNode_1MinusX* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_1MinusX>();
	}
};

// Class VoxelGraph.VG_Example_MultiIndex
// 0x00A0 (0x00D0 - 0x0030)
class UVG_Example_MultiIndex final : public UVoxelGraphGeneratorHelper
{
public:
	TSoftObjectPtr<class UMaterialInterface>      Layer_0;                                           // 0x0030(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      Layer_1;                                           // 0x0058(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      Layer_2;                                           // 0x0080(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      Layer_3;                                           // 0x00A8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VG_Example_MultiIndex">();
	}
	static class UVG_Example_MultiIndex* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVG_Example_MultiIndex>();
	}
};

// Class VoxelGraph.VoxelNode_FMax
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_FMax final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_FMax">();
	}
	static class UVoxelNode_FMax* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_FMax>();
	}
};

// Class VoxelGraph.VoxelExposedNode
// 0x00B8 (0x0150 - 0x0098)
class UVoxelExposedNode : public UVoxelNodeHelper
{
public:
	class FString                                 DisplayName;                                       // 0x0098(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UniqueName;                                        // 0x00A8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Category;                                          // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ToolTip;                                           // 0x00C0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UIMin;                                             // 0x00D8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UIMax;                                             // 0x00E8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class FString>              CustomMetaData;                                    // 0x00F8(0x0050)(Edit, NativeAccessSpecifierPublic)
	bool                                          bCanBeRenamed;                                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelExposedNode">();
	}
	static class UVoxelExposedNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelExposedNode>();
	}
};

// Class VoxelGraph.VoxelNodeWithDependencies
// 0x0000 (0x0098 - 0x0098)
class UVoxelNodeWithDependencies : public UVoxelNodeHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNodeWithDependencies">();
	}
	static class UVoxelNodeWithDependencies* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNodeWithDependencies>();
	}
};

// Class VoxelGraph.VoxelNodeWithContext
// 0x0000 (0x0098 - 0x0098)
class UVoxelNodeWithContext : public UVoxelNodeWithDependencies
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNodeWithContext">();
	}
	static class UVoxelNodeWithContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNodeWithContext>();
	}
};

// Class VoxelGraph.VoxelNode_NoiseNode
// 0x0040 (0x00D8 - 0x0098)
class UVoxelNode_NoiseNode : public UVoxelNodeWithContext
{
public:
	float                                         Frequency;                                         // 0x0098(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVoxelNoiseInterpolation                      Interpolation;                                     // 0x009C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        NumberOfSamples;                                   // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Tolerance;                                         // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVoxelRange>                    OutputRanges;                                      // 0x00A8(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x20];                                      // 0x00B8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_NoiseNode">();
	}
	static class UVoxelNode_NoiseNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_NoiseNode>();
	}
};

// Class VoxelGraph.VoxelNode_NoiseNodeFractal
// 0x0060 (0x0138 - 0x00D8)
class UVoxelNode_NoiseNodeFractal : public UVoxelNode_NoiseNode
{
public:
	int32                                         FractalOctaves;                                    // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FractalLacunarity;                                 // 0x00DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FractalGain;                                       // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVoxelNoiseFractalType                        FractalType;                                       // 0x00E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, uint8>                    LODToOctavesMap;                                   // 0x00E8(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_NoiseNodeFractal">();
	}
	static class UVoxelNode_NoiseNodeFractal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_NoiseNodeFractal>();
	}
};

// Class VoxelGraph.VoxelNode_CraterNoiseFractal
// 0x0008 (0x0140 - 0x0138)
class UVoxelNode_CraterNoiseFractal : public UVoxelNode_NoiseNodeFractal
{
public:
	float                                         Jitter;                                            // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FalloffExponent;                                   // 0x013C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_CraterNoiseFractal">();
	}
	static class UVoxelNode_CraterNoiseFractal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_CraterNoiseFractal>();
	}
};

// Class VoxelGraph.VoxelNode_2DCraterNoiseFractal
// 0x0000 (0x0140 - 0x0140)
class UVoxelNode_2DCraterNoiseFractal final : public UVoxelNode_CraterNoiseFractal
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_2DCraterNoiseFractal">();
	}
	static class UVoxelNode_2DCraterNoiseFractal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_2DCraterNoiseFractal>();
	}
};

// Class VoxelGraph.VoxelAssetPickerNode
// 0x0000 (0x0150 - 0x0150)
class UVoxelAssetPickerNode : public UVoxelExposedNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelAssetPickerNode">();
	}
	static class UVoxelAssetPickerNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelAssetPickerNode>();
	}
};

// Class VoxelGraph.VoxelNode_ZI
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_ZI final : public UVoxelNodeHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_ZI">();
	}
	static class UVoxelNode_ZI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_ZI>();
	}
};

// Class VoxelGraph.VoxelNode_BAnd
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_BAnd final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_BAnd">();
	}
	static class UVoxelNode_BAnd* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_BAnd>();
	}
};

// Class VoxelGraph.VoxelNode_FLess
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_FLess final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_FLess">();
	}
	static class UVoxelNode_FLess* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_FLess>();
	}
};

// Class VoxelGraph.VoxelNode_FLessEqual
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_FLessEqual final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_FLessEqual">();
	}
	static class UVoxelNode_FLessEqual* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_FLessEqual>();
	}
};

// Class VoxelGraph.VoxelNode_Sleep
// 0x0008 (0x00A0 - 0x0098)
class UVoxelNode_Sleep final : public UVoxelNodeHelper
{
public:
	int32                                         NumberOfLoops;                                     // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_Sleep">();
	}
	static class UVoxelNode_Sleep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_Sleep>();
	}
};

// Class VoxelGraph.VoxelNode_FGreater
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_FGreater final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_FGreater">();
	}
	static class UVoxelNode_FGreater* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_FGreater>();
	}
};

// Class VoxelGraph.VoxelNode_FGreaterEqual
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_FGreaterEqual final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_FGreaterEqual">();
	}
	static class UVoxelNode_FGreaterEqual* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_FGreaterEqual>();
	}
};

// Class VoxelGraph.VoxelNode_IAdd
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_IAdd final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_IAdd">();
	}
	static class UVoxelNode_IAdd* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_IAdd>();
	}
};

// Class VoxelGraph.VoxelNode_FEqual
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_FEqual final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_FEqual">();
	}
	static class UVoxelNode_FEqual* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_FEqual>();
	}
};

// Class VoxelGraph.VoxelNode_FNotEqual
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_FNotEqual final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_FNotEqual">();
	}
	static class UVoxelNode_FNotEqual* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_FNotEqual>();
	}
};

// Class VoxelGraph.VoxelNode_SmartMin
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_SmartMin final : public UVoxelNodeHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_SmartMin">();
	}
	static class UVoxelNode_SmartMin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_SmartMin>();
	}
};

// Class VoxelGraph.VoxelNode_ILess
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_ILess final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_ILess">();
	}
	static class UVoxelNode_ILess* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_ILess>();
	}
};

// Class VoxelGraph.VoxelNode_ILessEqual
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_ILessEqual final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_ILessEqual">();
	}
	static class UVoxelNode_ILessEqual* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_ILessEqual>();
	}
};

// Class VoxelGraph.VoxelNode_MinusX
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_MinusX final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_MinusX">();
	}
	static class UVoxelNode_MinusX* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_MinusX>();
	}
};

// Class VoxelGraph.VoxelNode_IGreater
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_IGreater final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_IGreater">();
	}
	static class UVoxelNode_IGreater* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_IGreater>();
	}
};

// Class VoxelGraph.VoxelNode_IGreaterEqual
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_IGreaterEqual final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_IGreaterEqual">();
	}
	static class UVoxelNode_IGreaterEqual* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_IGreaterEqual>();
	}
};

// Class VoxelGraph.VoxelNode_ColorParameter
// 0x0010 (0x0160 - 0x0150)
class UVoxelNode_ColorParameter final : public UVoxelExposedNode
{
public:
	struct FLinearColor                           Color;                                             // 0x0150(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_ColorParameter">();
	}
	static class UVoxelNode_ColorParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_ColorParameter>();
	}
};

// Class VoxelGraph.VoxelNode_IEqual
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_IEqual final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_IEqual">();
	}
	static class UVoxelNode_IEqual* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_IEqual>();
	}
};

// Class VoxelGraph.VoxelNode_INotEqual
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_INotEqual final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_INotEqual">();
	}
	static class UVoxelNode_INotEqual* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_INotEqual>();
	}
};

// Class VoxelGraph.VoxelNode_Lerp
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_Lerp final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_Lerp">();
	}
	static class UVoxelNode_Lerp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_Lerp>();
	}
};

// Class VoxelGraph.VoxelNode_BiomeMapSampler
// 0x0020 (0x0170 - 0x0150)
class UVoxelNode_BiomeMapSampler final : public UVoxelExposedNode
{
public:
	class UTexture2D*                             Texture;                                           // 0x0150(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Threshold;                                         // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBiomeMapElement>               Biomes;                                            // 0x0160(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_BiomeMapSampler">();
	}
	static class UVoxelNode_BiomeMapSampler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_BiomeMapSampler>();
	}
};

// Class VoxelGraph.VoxelNode_BiomeMerge
// 0x0018 (0x0070 - 0x0058)
class UVoxelNode_BiomeMerge final : public UVoxelNode
{
public:
	TArray<class FString>                         Biomes;                                            // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Tolerance;                                         // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_BiomeMerge">();
	}
	static class UVoxelNode_BiomeMerge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_BiomeMerge>();
	}
};

// Class VoxelGraph.VoxelNode_Sinh
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_Sinh final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_Sinh">();
	}
	static class UVoxelNode_Sinh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_Sinh>();
	}
};

// Class VoxelGraph.VoxelNode_Floor
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_Floor final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_Floor">();
	}
	static class UVoxelNode_Floor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_Floor>();
	}
};

// Class VoxelGraph.VoxelNode_LOD
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_LOD final : public UVoxelNodeWithContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_LOD">();
	}
	static class UVoxelNode_LOD* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_LOD>();
	}
};

// Class VoxelGraph.VoxelNode_VoxelSize
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_VoxelSize final : public UVoxelNodeHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_VoxelSize">();
	}
	static class UVoxelNode_VoxelSize* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_VoxelSize>();
	}
};

// Class VoxelGraph.VoxelNode_Tan
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_Tan final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_Tan">();
	}
	static class UVoxelNode_Tan* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_Tan>();
	}
};

// Class VoxelGraph.VoxelNode_WorldSize
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_WorldSize final : public UVoxelNodeHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_WorldSize">();
	}
	static class UVoxelNode_WorldSize* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_WorldSize>();
	}
};

// Class VoxelGraph.VoxelNode_CompileTimeConstant
// 0x0060 (0x00F8 - 0x0098)
class UVoxelNode_CompileTimeConstant final : public UVoxelNodeHelper
{
public:
	class FName                                   Name_VoxelNode_CompileTimeConstant;                // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVoxelPinCategory                             Type;                                              // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FString>              Constants;                                         // 0x00A8(0x0050)(Edit, Transient, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_CompileTimeConstant">();
	}
	static class UVoxelNode_CompileTimeConstant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_CompileTimeConstant>();
	}
};

// Class VoxelGraph.VoxelNode_NoiseNodeWithDerivativeFractal
// 0x0008 (0x0140 - 0x0138)
class UVoxelNode_NoiseNodeWithDerivativeFractal : public UVoxelNode_NoiseNodeFractal
{
public:
	bool                                          bComputeDerivative;                                // 0x0138(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_NoiseNodeWithDerivativeFractal">();
	}
	static class UVoxelNode_NoiseNodeWithDerivativeFractal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_NoiseNodeWithDerivativeFractal>();
	}
};

// Class VoxelGraph.VoxelCoordinateNode
// 0x0000 (0x0098 - 0x0098)
class UVoxelCoordinateNode : public UVoxelNodeWithDependencies
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelCoordinateNode">();
	}
	static class UVoxelCoordinateNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelCoordinateNode>();
	}
};

// Class VoxelGraph.VoxelNode_XF
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_XF final : public UVoxelCoordinateNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_XF">();
	}
	static class UVoxelNode_XF* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_XF>();
	}
};

// Class VoxelGraph.VoxelNode_BreakColorInt
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_BreakColorInt final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_BreakColorInt">();
	}
	static class UVoxelNode_BreakColorInt* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_BreakColorInt>();
	}
};

// Class VoxelGraph.VoxelNode_YF
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_YF final : public UVoxelCoordinateNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_YF">();
	}
	static class UVoxelNode_YF* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_YF>();
	}
};

// Class VoxelGraph.VoxelNode_ZF
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_ZF final : public UVoxelCoordinateNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_ZF">();
	}
	static class UVoxelNode_ZF* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_ZF>();
	}
};

// Class VoxelGraph.VoxelNode_Sin
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_Sin final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_Sin">();
	}
	static class UVoxelNode_Sin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_Sin>();
	}
};

// Class VoxelGraph.VoxelNode_GlobalX
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_GlobalX final : public UVoxelCoordinateNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_GlobalX">();
	}
	static class UVoxelNode_GlobalX* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_GlobalX>();
	}
};

// Class VoxelGraph.VoxelNode_GlobalY
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_GlobalY final : public UVoxelCoordinateNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_GlobalY">();
	}
	static class UVoxelNode_GlobalY* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_GlobalY>();
	}
};

// Class VoxelGraph.VoxelNode_RGBToHSV
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_RGBToHSV final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_RGBToHSV">();
	}
	static class UVoxelNode_RGBToHSV* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_RGBToHSV>();
	}
};

// Class VoxelGraph.VoxelNode_GlobalZ
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_GlobalZ final : public UVoxelCoordinateNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_GlobalZ">();
	}
	static class UVoxelNode_GlobalZ* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_GlobalZ>();
	}
};

// Class VoxelGraph.VoxelNode_LocalToGlobal
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_LocalToGlobal final : public UVoxelNodeWithContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_LocalToGlobal">();
	}
	static class UVoxelNode_LocalToGlobal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_LocalToGlobal>();
	}
};

// Class VoxelGraph.VoxelNode_FMod
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_FMod final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_FMod">();
	}
	static class UVoxelNode_FMod* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_FMod>();
	}
};

// Class VoxelGraph.VoxelNode_GlobalToLocal
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_GlobalToLocal final : public UVoxelNodeWithContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_GlobalToLocal">();
	}
	static class UVoxelNode_GlobalToLocal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_GlobalToLocal>();
	}
};

// Class VoxelGraph.VoxelNode_TransformVector
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_TransformVector final : public UVoxelNodeWithContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_TransformVector">();
	}
	static class UVoxelNode_TransformVector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_TransformVector>();
	}
};

// Class VoxelGraph.VoxelNode_PerlinWormDistance
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_PerlinWormDistance final : public UVoxelNodeHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_PerlinWormDistance">();
	}
	static class UVoxelNode_PerlinWormDistance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_PerlinWormDistance>();
	}
};

// Class VoxelGraph.VoxelMaterialNode
// 0x0000 (0x0098 - 0x0098)
class UVoxelMaterialNode : public UVoxelNodeHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelMaterialNode">();
	}
	static class UVoxelMaterialNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelMaterialNode>();
	}
};

// Class VoxelGraph.VoxelNode_GetIndex
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_GetIndex final : public UVoxelMaterialNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_GetIndex">();
	}
	static class UVoxelNode_GetIndex* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_GetIndex>();
	}
};

// Class VoxelGraph.VoxelNode_InverseTransformVector
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_InverseTransformVector final : public UVoxelNodeWithContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_InverseTransformVector">();
	}
	static class UVoxelNode_InverseTransformVector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_InverseTransformVector>();
	}
};

// Class VoxelGraph.VoxelNode_Curve
// 0x0008 (0x0158 - 0x0150)
class UVoxelNode_Curve final : public UVoxelExposedNode
{
public:
	class UCurveFloat*                            Curve;                                             // 0x0150(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_Curve">();
	}
	static class UVoxelNode_Curve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_Curve>();
	}
};

// Class VoxelGraph.VoxelNode_Atan2
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_Atan2 final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_Atan2">();
	}
	static class UVoxelNode_Atan2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_Atan2>();
	}
};

// Class VoxelGraph.VoxelNode_CurveColor
// 0x0008 (0x0158 - 0x0150)
class UVoxelNode_CurveColor final : public UVoxelExposedNode
{
public:
	class UCurveLinearColor*                      Curve;                                             // 0x0150(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_CurveColor">();
	}
	static class UVoxelNode_CurveColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_CurveColor>();
	}
};

// Class VoxelGraph.VoxelNode_DataAssetSampler
// 0x0010 (0x0160 - 0x0150)
class UVoxelNode_DataAssetSampler final : public UVoxelExposedNode
{
public:
	class UVoxelDataAsset*                        Asset;                                             // 0x0150(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBilinearInterpolation;                            // 0x0158(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_DataAssetSampler">();
	}
	static class UVoxelNode_DataAssetSampler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_DataAssetSampler>();
	}
};

// Class VoxelGraph.VoxelNode_IMax
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_IMax final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_IMax">();
	}
	static class UVoxelNode_IMax* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_IMax>();
	}
};

// Class VoxelGraph.VoxelNode_MakeMaterialFromSingleIndex
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_MakeMaterialFromSingleIndex final : public UVoxelMaterialNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_MakeMaterialFromSingleIndex">();
	}
	static class UVoxelNode_MakeMaterialFromSingleIndex* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_MakeMaterialFromSingleIndex>();
	}
};

// Class VoxelGraph.VoxelNode_ISign
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_ISign final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_ISign">();
	}
	static class UVoxelNode_ISign* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_ISign>();
	}
};

// Class VoxelGraph.VoxelNode_GetDoubleIndex
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_GetDoubleIndex final : public UVoxelMaterialNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_GetDoubleIndex">();
	}
	static class UVoxelNode_GetDoubleIndex* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_GetDoubleIndex>();
	}
};

// Class VoxelGraph.VoxelNode_MakeMaterialFromColor
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_MakeMaterialFromColor final : public UVoxelMaterialNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_MakeMaterialFromColor">();
	}
	static class UVoxelNode_MakeMaterialFromColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_MakeMaterialFromColor>();
	}
};

// Class VoxelGraph.VoxelNode_FSubstract
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_FSubstract final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_FSubstract">();
	}
	static class UVoxelNode_FSubstract* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_FSubstract>();
	}
};

// Class VoxelGraph.VoxelNode_MakeMaterialFromDoubleIndex
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_MakeMaterialFromDoubleIndex final : public UVoxelMaterialNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_MakeMaterialFromDoubleIndex">();
	}
	static class UVoxelNode_MakeMaterialFromDoubleIndex* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_MakeMaterialFromDoubleIndex>();
	}
};

// Class VoxelGraph.VoxelNode_CreateDoubleIndexMaterial
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_CreateDoubleIndexMaterial final : public UVoxelMaterialNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_CreateDoubleIndexMaterial">();
	}
	static class UVoxelNode_CreateDoubleIndexMaterial* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_CreateDoubleIndexMaterial>();
	}
};

// Class VoxelGraph.VoxelNode_InverseTransformPositionXZ
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_InverseTransformPositionXZ final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_InverseTransformPositionXZ">();
	}
	static class UVoxelNode_InverseTransformPositionXZ* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_InverseTransformPositionXZ>();
	}
};

// Class VoxelGraph.VoxelSetterNode
// 0x0000 (0x0098 - 0x0098)
class UVoxelSetterNode : public UVoxelNodeHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelSetterNode">();
	}
	static class UVoxelSetterNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelSetterNode>();
	}
};

// Class VoxelGraph.VoxelNode_MaterialSetter
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_MaterialSetter : public UVoxelSetterNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_MaterialSetter">();
	}
	static class UVoxelNode_MaterialSetter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_MaterialSetter>();
	}
};

// Class VoxelGraph.VoxelNode_ISubstract
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_ISubstract final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_ISubstract">();
	}
	static class UVoxelNode_ISubstract* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_ISubstract>();
	}
};

// Class VoxelGraph.VoxelNode_SetDoubleIndex
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_SetDoubleIndex final : public UVoxelNode_MaterialSetter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_SetDoubleIndex">();
	}
	static class UVoxelNode_SetDoubleIndex* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_SetDoubleIndex>();
	}
};

// Class VoxelGraph.VoxelNode_WorldGeneratorSampler
// 0x0078 (0x01C8 - 0x0150)
class UVoxelNode_WorldGeneratorSampler final : public UVoxelExposedNode
{
public:
	struct FVoxelGeneratorPicker                  WorldGenerator;                                    // 0x0150(0x0068)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Seeds;                                             // 0x01B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_WorldGeneratorSampler">();
	}
	static class UVoxelNode_WorldGeneratorSampler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_WorldGeneratorSampler>();
	}
};

// Class VoxelGraph.VoxelNode_Acos
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_Acos final : public UVoxelPureNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_Acos">();
	}
	static class UVoxelNode_Acos* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_Acos>();
	}
};

// Class VoxelGraph.VoxelNode_XI
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_XI final : public UVoxelNodeHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_XI">();
	}
	static class UVoxelNode_XI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_XI>();
	}
};

// Class VoxelGraph.VoxelNode_YI
// 0x0000 (0x0098 - 0x0098)
class UVoxelNode_YI final : public UVoxelNodeHelper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelNode_YI">();
	}
	static class UVoxelNode_YI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelNode_YI>();
	}
};

// Class VoxelGraph.VoxelExample_Cliffs
// 0x0030 (0x0060 - 0x0030)
class UVoxelExample_Cliffs final : public UVoxelGraphGeneratorHelper
{
public:
	float                                         Cliffs_Slope;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Overhangs;                                         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Base_Shape_Frequency;                              // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Base_Shape_Offset;                                 // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Base_Shape_Seed;                                   // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Sides_Noise_Seed;                                  // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Top_Noise_Seed;                                    // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Sides_Noise_Amplitude;                             // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Sides_Noise_Frequency;                             // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Top_Noise_Frequency;                               // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Top_Noise_Scale;                                   // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelExample_Cliffs">();
	}
	static class UVoxelExample_Cliffs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelExample_Cliffs>();
	}
};

// Class VoxelGraph.VoxelExample_FloatingIslandOnion
// 0x0018 (0x0048 - 0x0030)
class UVoxelExample_FloatingIslandOnion final : public UVoxelGraphGeneratorHelper
{
public:
	float                                         Height;                                            // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Perturb_Amplitude;                                 // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Perturb_Frequency;                                 // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seed;                                              // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Top_Noise_Frequency;                               // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Top_Noise_Height;                                  // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelExample_FloatingIslandOnion">();
	}
	static class UVoxelExample_FloatingIslandOnion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelExample_FloatingIslandOnion>();
	}
};

// Class VoxelGraph.VoxelExample_HeightmapComposition
// 0x00B0 (0x00E0 - 0x0030)
class UVoxelExample_HeightmapComposition final : public UVoxelGraphGeneratorHelper
{
public:
	float                                         Depth;                                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Flip_X;                                            // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
