#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WayPointData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct WayPointData.WayPointData
// 0x0080 (0x0080 - 0x0000)
struct FWayPointData final
{
public:
	struct FTransform                             StartTransform_2_50D0025948BEF65B1F7015B9EAE04C15; // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             EndTransform_4_3CD2F2F948F6AC2D526962816E4A58E0;   // 0x0030(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	int32                                         WaypointID_7_E654DAE544C43FBD63BCEDB99A8EE73C;     // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextWaypointID_9_0C90D0C74842D8B03F2097B3FCBFBE6A; // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEasingFunc                                   EaseIn_14_208F53F9474577021E4E85BBF78B5850;        // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEasingFunc                                   EaseOut_16_49E1762D434637FC1C1CB59B828CEAD1;       // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeOnWaypoint_19_7B24F6594EFFF9D6D7E9B2828469D00C; // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaitTimeToNextWaypoint_22_5AE920AC4F92D4BAE800B7926B176ABA; // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Mesh_26_5125C7B54F793138FD1062AEC2718322;          // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

