#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_CompetetiveVisualSorting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GolfIt_structs.hpp"
#include "GolfIt_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_CompetetiveVisualSorting.WB_CompetetiveVisualSorting_C
// 0x00C0 (0x03F8 - 0x0338)
class UWB_CompetetiveVisualSorting_C final : public UGolfItActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             List_Player;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class APlayerState*, class UWB_CompetetiveScore_Row_Player_C*> MultiplayerWidgets;                                // 0x0348(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TMap<int32, class UWB_CompetetiveScore_Row_Player_C*> HotseatWidgets;                                    // 0x0398(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AGolfItLobbyGameState*                  LobbyGameState;                                    // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CompetetiveScore_Row_Player_C*      SingleplayerWidget;                                // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_CompetetiveVisualSorting(int32 EntryPoint);
	void AnimatePlayerList();
	void ManualUpdate();
	void Construct();
	void AddMissingPlayers(class AGolfItLobbyGameState* GameState);
	void RemoveInvalidPlayer();
	void AddPlayerToList(EGolfItGameType Game_Type);
	void SetScoreVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_CompetetiveVisualSorting_C">();
	}
	static class UWB_CompetetiveVisualSorting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_CompetetiveVisualSorting_C>();
	}
};

}

