#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_Challenges_Hub

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "GolfItChallengeSystem_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Challenges_Hub.WB_Challenges_Hub_C
// 0x0070 (0x02F8 - 0x0288)
class UWB_Challenges_Hub_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Box_Challenges;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class UGolfItChallengeBase*, class UCommonUserWidget*> ChallengeWidgets;                                  // 0x0298(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWB_Challenges_ErrorToast_C*            ConnectionErrorWidget;                             // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKarenDown;                                       // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void RemoveToast(class UGolfItChallengeBase* Challenge);
	void Find_or_Add_Toast(class UGolfItChallengeBase* Challenge, class UWB_Challenges_Toast_C** Toast);
	void Construct();
	void OnChallengeProgressed(class UGolfItChallengeBase* Challenge, int32 OldProgress, int32 NewProgress, int32 OldForecast, int32 NewForecast);
	void MOnChallengeUpdatedDelegate_Event_0(class UGolfItChallengeBase* Challenge, EChallengeState OldState, EChallengeState NewState);
	void OnChallengesCreated();
	void OnKarenConnectionError();
	void OnErrorFinished();
	void ExecuteUbergraph_WB_Challenges_Hub(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Challenges_Hub_C">();
	}
	static class UWB_Challenges_Hub_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Challenges_Hub_C>();
	}
};

}

