#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_Lobby_Team

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Lobby_Team.WB_Lobby_Team_C
// 0x0050 (0x02D8 - 0x0288)
class UWB_Lobby_Team_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_Button_Menu_C*                      Button_TeamName;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                Numeric_PlayerCount;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListView*                        PlayerList;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_WB_Lobby_Team_C;                              // 0x02A8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             OnTeamClicked;                                     // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   Team;                                              // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void OnTeamClicked__DelegateSignature(class FName Param_Team);
	void ExecuteUbergraph_WB_Lobby_Team(int32 EntryPoint);
	void ChangePlayerName(class AGolfItLobbyPlayerState* PlayerState, int32 Hotseat_Index);
	void RemovePlayer(class AGolfItLobbyPlayerState* PlayerState, int32 HotSeatIndex);
	void BndEvt__WB_Lobby_Team_Button_TeamName_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void AddPlayer(class AGolfItLobbyPlayerState* PlayerState, int32 HotSeatIndex, bool IsKickable);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void RemovePlayerIfAlreadyExisting(class AGolfItLobbyPlayerState* PlayerState);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Lobby_Team_C">();
	}
	static class UWB_Lobby_Team_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Lobby_Team_C>();
	}
};

}

