#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_LeaderBoard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GolfIt_structs.hpp"
#include "GolfIt_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_LeaderBoard.WB_LeaderBoard_C
// 0x00F0 (0x0428 - 0x0338)
class UWB_LeaderBoard_C final : public UGolfItActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Box_Content;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Box_Error;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListView*                        List_Leaderboard;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MenuButtons;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SimpleTabList_C*                    TabList;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      Throbber_Loading;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Default_C*                   WB_Button_Default;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Title_C*                            WB_Title;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class UWB_Button_Menu_C*, class UGolfItOfficialMapInfo*> ButtonMap;                                         // 0x0380(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         Page;                                              // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumPerPage;                                        // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, EGolfItPlayMode>            Leaderboard_Names;                                 // 0x03D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CreateTabs(const TMap<EGolfItPlayMode, class FName>& Leaderboards, const class FText& CurrentMap);
	void SelectMap(class UGolfItOfficialMapInfo* Map_Info);
	void MOnRequestFailed_972D05B440707253B5F427A5CD0AC853(const TArray<struct FLeaderboardRow>& SortedRows);
	void MOnRequestSucceeded_972D05B440707253B5F427A5CD0AC853(const TArray<struct FLeaderboardRow>& SortedRows);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__WB_LeaderBoard_WB_Button_Default_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ButtonClicked(class UCommonButtonBase* Button);
	void SetSelection(const class UWB_Button_Menu_C*& Button);
	void BP_OnActivated();
	void BndEvt__WB_LeaderBoard_TabList_K2Node_ComponentBoundEvent_1_OnTabSelected__DelegateSignature(class FName TabId);
	void ExecuteUbergraph_WB_LeaderBoard(int32 EntryPoint);
	bool BP_OnHandleBackAction();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_LeaderBoard_C">();
	}
	static class UWB_LeaderBoard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_LeaderBoard_C>();
	}
};

}

