#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_Lobby

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GolfIt_structs.hpp"
#include "GolfIt_classes.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "E_Button_States_structs.hpp"
#include "GolfItUtils_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Lobby.WB_Lobby_C
// 0x01A0 (0x04D8 - 0x0338)
class UWB_Lobby_C final : public UGolfItActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_Button_Menu_C*                      Button_AddFriend;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Menu_C*                      Button_AddHotseat;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Default_C*                   Button_Back;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Default_C*                   Button_ChangeLevel;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Action_C*                    Button_Ready;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Button_C*             Button_ResetSettings;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Default_C*                   Button_ToggleServerOpen;                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Card_Content;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Card_Creator;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Card_Loading;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Card_MapName;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Card_NumHoles;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Card_Par;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Map;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LobbyBox;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_CustomSettings;                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Setting_AimArrow;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Setting_AllowJoinMidRound;                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Setting_AlternativeShooting;                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Setting_AutoMinusScoreboard;                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Dropdown_Text_C*      Setting_Bouncy;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Setting_Collision;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Dropdown_Text_C*      Setting_Friction;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Dropdown_Text_C*      Setting_Gamemode;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Setting_GolfClubs;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Setting_HoleInOneOnly;                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Dropdown_Text_C*      Setting_HotseatPlayOrder;                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Setting_Jumping;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Dropdown_Text_C*      Setting_MidRoundScoring;                           // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Setting_Penalties;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Setting_PracticeHole;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Setting_Reset;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Setting_SimulationMode;                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Setting_Strokes;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Setting_Tickrate;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Setting_Time;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Lobby_Team_C*                       WB_Lobby_Team;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FName, class UWB_Lobby_Team_C*>    Teams;                                             // 0x0470(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AGolfItLobbySettings*                   Lobby_Settings;                                    // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PreviewMaterial;                                   // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ContinuousHotseatNumber;                           // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGolfItActionBindingHandle             InputActionReadyHandle;                            // 0x04D4(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_WB_Lobby(int32 EntryPoint);
	void BndEvt__WB_Lobby_Setting_MidRoundScoring_K2Node_ComponentBoundEvent_3_OnSelectionChanged__DelegateSignature(const class FString& Option);
	void BndEvt__WB_Lobby_Setting_AllowJoinMidRound_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Lobby_Button_ToggleServerOpen_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_Lobby_Setting_HotseatPlayOrder_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature(const class FString& Option);
	void InputAction_NotReady(class FName ActionName);
	void InputAction_Ready(class FName ActionName);
	void InputAction_Start(class FName ActionName);
	void OnChangeLevelRequest();
	void InputAction_ChangeLevel(class FName ActionName);
	void InputAction_LeaveServer(class FName ActionName);
	void OnInputTypeChanged(ECommonInputType NewInputType);
	void PreConstruct(bool IsDesignTime);
	void OnPlayerLeft(class AGolfItBasePlayerState* PlayerState);
	void OnPlayerJoined(class AGolfItBasePlayerState* PlayerState);
	void ChatMessageSent(class UWB_Chat_C* Chat, const class FText& Message);
	void OnMapSelectedForChange(class UGolfItBaseMapInfo* Map_Info);
	void LoadPracticePreview();
	void OnLocalPlayerPlayStateChanged(ELobbyPlayerPlayState PreviousPlayState, ELobbyPlayerPlayState NewPlayState, const class AGolfItLobbyPlayerState* LobbyPlayerState);
	void Load_Preview_Picture(EGolfItPlayMode Play_Mode);
	void OnPlayerNameChanged(const class FString& OldName, const class FString& NewName, const class AGolfItLobbyPlayerState* LobbyPlayerState);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnHotseatPlayerRemoved(class AGolfItLobbyPlayerState* PlayerState, int32 HotSeatIndex);
	void OnPlayerTeamChanged(class FName OldTeam, class FName NewTeam, const class AGolfItLobbyPlayerState* LobbyPlayerState);
	void BindLobbySettingsEvents(class AGolfItLobbySettings* LobbySettings);
	void OnPlayModeChanged(EGolfItPlayMode NewPlayMode);
	void OnCustomSettingsChanged();
	void OnGeneralSettingsChanged();
	void OnPlayerPlayStateChanged(ELobbyPlayerPlayState PreviousPlayState, ELobbyPlayerPlayState NewPlayState, const class AGolfItLobbyPlayerState* LobbyPlayerState);
	void ChangeSettingsWidgets(EGolfItPlayMode PlayMode);
	void BP_OnActivated();
	void OnReadyButtonPressed();
	void BndEvt__WB_Lobby_Button_ResetSettings_K2Node_ComponentBoundEvent_20_OnButtonPressed__DelegateSignature();
	void BndEvt__WB_Lobby_Button_ChangeLevel_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_Lobby_Button_AddFriend_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_Lobby_Button_AddHotseat_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void OnAnswerReceived_ForceStart(bool Answer);
	void BndEvt__WB_MapSelection_Button_OK_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_MapSelection_WB_Button_Default_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_Lobby_Setting_AutoMinusScoreboard_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Lobby_Setting_Bouncy_K2Node_ComponentBoundEvent_17_OnSelectionChanged__DelegateSignature(const class FString& Option);
	void BndEvt__WB_Lobby_Setting_Friction_K2Node_ComponentBoundEvent_16_OnSelectionChanged__DelegateSignature(const class FString& Option);
	void BndEvt__WB_Lobby_Setting_HoleInOneOnly_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Lobby_Setting_GolfClubs_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Lobby_Setting_Reset_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Lobby_Setting_Penalties_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Lobby_Setting_AlternativeShooting_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Lobby_Setting_SimulationMode_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Lobby_Setting_AimArrow_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Lobby_Setting_Jumping_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Lobby_Setting_Collision_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Lobby_Setting_Tickrate_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Lobby_Setting_Time_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Lobby_Setting_PracticeHole_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Lobby_Setting_Strokes_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Lobby_Setting_Gamemode_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature(const class FString& Option);
	void MOnDone_FE6A5E0D4DFCF970667F04B1BE9F87C4(class UObject* Context, class USaveGame* SaveGame);
	void OnLoaded_9B9B5A714F8998987481F5B8DF60A0BC(class UObject* Loaded);
	void MOnDone_49189E364B96BB0BECF5B2B660FFEB6E(class UObject* Context, class UTexture2D* PreviewPicture);
	void CreateTeam(class FName Param_Name, class UWB_Lobby_Team_C** Team_Widget);
	void RemoveTeam(class FName Param_Name);
	void ClearTeams();
	void AddPlayer(class AGolfItLobbyPlayerState* PlayerState, class FName Team, int32 HotSeatIndex, bool IsKickable, bool* Success);
	void RemovePlayer(class AGolfItLobbyPlayerState* PlayerState, class FName Team, int32 HotSeatIndex);
	void ApplyGeneralSettings(class AGolfItLobbySettings* Settings);
	void ApplyCustomSettings(class AGolfItLobbySettings* Settings);
	void TryJoinTeam(class FName Team);
	E_Button_States PlayStateToButtonState(ELobbyPlayerPlayState Param_Index);
	void FindPracticePreview(const class FString& Level, int32 Hole, TSoftObjectPtr<class UTexture2D>* Preview);
	void ApplyRecommendedSettings(class AGolfItLobbySettings* LobbySettings, bool* AppliedSettings);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void ResetHotseatIDs();
	void GetHotseatName(class FText* Param_Name);
	bool BP_OnHandleBackAction();
	class UWidget* CustomNavigationCustomMode(EUINavigation Param_Navigation);
	class UWidget* DoCustomNavigation_0(EUINavigation Param_Navigation);
	class UWidget* CustomNavigationResetButton(EUINavigation Param_Navigation);
	void ResetFrictionAndBounce();
	void MakeSpaceInTextFromUpperCase(const class FString& Input, class FString* Output);

	void GetDefaultTeam(class FName* DefaultTeam) const;
	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Lobby_C">();
	}
	static class UWB_Lobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Lobby_C>();
	}
};

}

