#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_LoadingCustomMap

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_LoadingCustomMap.WB_LoadingCustomMap_C.ChangeLoadingTextAndProgressBar
// 0x0020 (0x0020 - 0x0000)
struct WB_LoadingCustomMap_C_ChangeLoadingTextAndProgressBar final
{
public:
	class FText                                   NewText;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         NewProgressValue;                                  // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_LoadingCustomMap.WB_LoadingCustomMap_C.ExecuteUbergraph_WB_LoadingCustomMap
// 0x0028 (0x0028 - 0x0000)
struct WB_LoadingCustomMap_C_ExecuteUbergraph_WB_LoadingCustomMap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_NewText;                        // 0x0008(0x0018)()
	float                                         K2Node_CustomEvent_NewProgressValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

