#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_MapSelection_View

#include "Basic.hpp"

#include "GolfIt_structs.hpp"
#include "GolfIt_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MapSelection_View.WB_MapSelection_View_C
// 0x0080 (0x03B8 - 0x0338)
class UWB_MapSelection_View_C final : public UGolfItActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             Content_Empty;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGolfItTileView*                        TileView_Maps;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EGolfItMapType                                Type;                                              // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TextFilter;                                        // 0x0358(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Title;                                             // 0x0370(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UWB_Tile_Map_C*                         SelectedItem;                                      // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ChangedSelection;                                  // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             JoinSelection;                                     // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         MapCount;                                          // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideSortingMethod;                             // 0x03B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EGolfItMapSorting                             SortingMethod;                                     // 0x03B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnlyFavorite;                                      // 0x03B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Filter(const class FText& Text);
	void ClearSelections();
	void ClearSortingMethod();
	void SetSortingMethod(EGolfItMapSorting Param_SortingMethod, bool Param_OnlyFavorite);
	bool FilterView(const class UGolfItBaseMapInfo*& GolfItMapInfo, const class FText& Text, EGolfItMapType Param_Type, bool Favorite);
	void FillView();
	void BP_OnActivated();
	void BndEvt__WB_MapSelection_View_TileView_Maps_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__WB_MapSelection_View_TileView_Maps_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void ExecuteUbergraph_WB_MapSelection_View(int32 EntryPoint);
	void JoinSelection__DelegateSignature(class UWB_Tile_Map_C* Selected_Tile);
	void ChangedSelection__DelegateSignature(class UWB_Tile_Map_C* Selected_Tile);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MapSelection_View_C">();
	}
	static class UWB_MapSelection_View_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MapSelection_View_C>();
	}
};

}

