#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_Options_BallSettings

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GolfItSteam_structs.hpp"
#include "GolfItUtils_structs.hpp"
#include "Engine_structs.hpp"
#include "GolfIt_structs.hpp"


namespace SDK::Params
{

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.SellDuplicates
// 0x01A0 (0x01A0 - 0x0000)
struct WB_Options_BallSettings_C_SellDuplicates final
{
public:
	TSet<struct FPrimaryAssetType>                SaleAssetTypes;                                    // 0x0000(0x0050)(Edit, BlueprintVisible)
	TArray<struct FPrimaryAssetId>                DataAssets;                                        // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSteamInventoryItemInstanceHandle> Instances;                                         // 0x0060(0x0010)(Edit, BlueprintVisible)
	class USteamInventorySubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetType>              CallFunc_Set_ToArray_Result;                       // 0x00B0(0x0010)(ReferenceParm)
	struct FPrimaryAssetType                      CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamInventoryItem>            CallFunc_GetInventoryItemsByPrimaryAssetType_OutItems; // 0x00D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamInventoryItem                    CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamInventoryItemInstance            CallFunc_Array_Get_Item_2;                         // 0x0118(0x0018)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FPrimaryAssetType>                K2Node_MakeVariable_MakeVariableOutput;            // 0x0148(0x0050)()
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.GetSelectedType
// 0x0001 (0x0001 - 0x0000)
struct WB_Options_BallSettings_C_GetSelectedType final
{
public:
	ESteamInventoryItemType                       Type;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.OnMouseWheel
// 0x03F8 (0x03F8 - 0x0000)
struct WB_Options_BallSettings_C_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_PointerEvent_GetWheelDelta_ReturnValue;   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0170(0x00B8)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue_1;                  // 0x0230(0x00B8)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AA_GolfBallCustomizer_C*                K2Node_DynamicCast_AsA_Golf_Ball_Customizer;       // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0300(0x00B8)()
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x03B8(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUnderLocation_ReturnValue;              // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.OnMouseMove
// 0x03A8 (0x03A8 - 0x0000)
struct WB_Options_BallSettings_C_OnMouseMove final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0160(0x00B8)()
	struct FVector2D                              CallFunc_PointerEvent_GetCursorDelta_ReturnValue;  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue_1;                  // 0x0220(0x00B8)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AA_GolfBallCustomizer_C*                K2Node_DynamicCast_AsA_Golf_Ball_Customizer;       // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x02F0(0x00B8)()
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.OnMouseButtonUp
// 0x0218 (0x0218 - 0x0000)
struct WB_Options_BallSettings_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.OnMouseButtonDown
// 0x03D8 (0x03D8 - 0x0000)
struct WB_Options_BallSettings_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0170(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0228(0x00B8)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x02E0(0x00B8)()
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0398(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUnderLocation_ReturnValue;              // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.GetDefaultAssetIDs
// 0x0040 (0x0040 - 0x0000)
struct WB_Options_BallSettings_C_GetDefaultAssetIDs final
{
public:
	struct FPrimaryAssetType                      PrimaryAssetType;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                PrimaryAssetIDs;                                   // 0x0008(0x0010)(Parm, OutParm)
	TArray<struct FPrimaryAssetId>                CallFunc_GetDefaultItemAssetIDs_AssetIDs;          // 0x0018(0x0010)(ReferenceParm)
	TArray<struct FPrimaryAssetId>                CallFunc_GetPrimaryAssetIdList_OutPrimaryAssetIdList; // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsEditorBuild_ReturnValue;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.IsItemEquipped
// 0x0070 (0x0070 - 0x0000)
struct WB_Options_BallSettings_C_IsItemEquipped final
{
public:
	struct FPrimaryAssetId                        PrimaryAssetId;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldSelect;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGolfItUserSettings*                    CallFunc_GetGolfItUserSettings_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetBallHatAssetID_ReturnValue;            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetGoalEffectAssetID_ReturnValue;         // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_PrimaryAssetId_ReturnValue;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_PrimaryAssetId_ReturnValue_1;  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        CallFunc_GetBallSkinAssetID_ReturnValue;           // 0x0044(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetBallTrailAssetID_ReturnValue;          // 0x0054(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_PrimaryAssetId_ReturnValue_2;  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_PrimaryAssetId_ReturnValue_3;  // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.SetupTabs
// 0x0006 (0x0006 - 0x0000)
struct WB_Options_BallSettings_C_SetupTabs final
{
public:
	bool                                          CallFunc_RegisterTab_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RegisterTab_ReturnValue_1;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RegisterTab_ReturnValue_2;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RegisterTab_ReturnValue_3;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RegisterTab_ReturnValue_4;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RegisterTab_ReturnValue_5;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.RefreshCoins
// 0x0018 (0x0018 - 0x0000)
struct WB_Options_BallSettings_C_RefreshCoins final
{
public:
	class USteamInventorySubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamInventoryItemDefinitionHandle    CallFunc_GetGolfItCoinDefinitionHandle_ReturnValue; // 0x0008(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalQuantityByItemDefinitionHandle_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.ChangeItemView
// 0x02E8 (0x02E8 - 0x0000)
struct WB_Options_BallSettings_C_ChangeItemView final
{
public:
	ESteamInventoryItemType                       Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamInventoryItem>            InventoryItems;                                    // 0x0008(0x0010)(Edit, BlueprintVisible)
	struct FPrimaryAssetType                      Temp_struct_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_4;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_5;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_6;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESteamInventoryItemType                       Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetType                      Temp_struct_Variable_7;                            // 0x0054(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_8;                            // 0x005C(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_9;                            // 0x0064(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_10;                           // 0x006C(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_11;                           // 0x0074(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_12;                           // 0x007C(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_13;                           // 0x0084(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_14;                           // 0x008C(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_15;                           // 0x0094(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESteamInventoryItemType                       Temp_byte_Variable_1;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetType                      Temp_struct_Variable_16;                           // 0x00A4(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_17;                           // 0x00AC(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_18;                           // 0x00B4(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_19;                           // 0x00BC(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_20;                           // 0x00C4(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_21;                           // 0x00CC(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_22;                           // 0x00D4(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_23;                           // 0x00DC(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_24;                           // 0x00E4(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamInventorySubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USteamInventorySubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasReceivedFullUpdate_ReturnValue;        // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetType                      Temp_struct_Variable_25;                           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      Temp_struct_Variable_26;                           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamInventoryItem                    CallFunc_Array_Get_Item;                           // 0x0148(0x0028)()
	class UWB_Tile_Item_C*                        CallFunc_AddItemWidgetByInventoryItem_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<struct FSteamInventoryItemInstance>      K2Node_MakeSet_Set;                                // 0x0178(0x0050)()
	TSet<struct FSteamInventoryItemInstance>      K2Node_MakeSet_Set_1;                              // 0x01C8(0x0050)()
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0218(0x0010)(ConstParm, ReferenceParm)
	class UObject*                                CallFunc_Array_Get_Item_1;                         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Tile_Item_C*                        K2Node_DynamicCast_AsWB_Tile_Item;                 // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsItemEquipped_ShouldSelect;              // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditorBuild_ReturnValue;                // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FPrimaryAssetType                      K2Node_Select_Default;                             // 0x0244(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                CallFunc_GetPrimaryAssetIdList_OutPrimaryAssetIdList; // 0x0250(0x0010)(ReferenceParm)
	struct FPrimaryAssetId                        CallFunc_Array_Get_Item_2;                         // 0x0260(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWB_Tile_Item_C*                        CallFunc_AddItemWidgetByPrimaryAssetID_ReturnValue; // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      K2Node_Select_Default_1;                           // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamInventoryItem>            CallFunc_GetInventoryItemsByPrimaryAssetType_OutItems; // 0x0288(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESteamInventoryItemType                       Temp_byte_Variable_2;                              // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x2];                                      // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetType                      K2Node_Select_Default_2;                           // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                CallFunc_GetDefaultAssetIDs_PrimaryAssetIDs;       // 0x02B0(0x0010)(ReferenceParm)
	struct FPrimaryAssetId                        CallFunc_Array_Get_Item_3;                         // 0x02C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Tile_Item_C*                        CallFunc_AddItemWidgetByPrimaryAssetID_ReturnValue_1; // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.AddItemWidgetByPrimaryAssetID
// 0x0080 (0x0080 - 0x0000)
struct WB_Options_BallSettings_C_AddItemWidgetByPrimaryAssetID final
{
public:
	struct FPrimaryAssetId                        PrimaryAssetId;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<struct FSteamInventoryItemInstance>      ItemInstances;                                     // 0x0010(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         NumItems;                                          // 0x0060(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Tile_Item_C*                        ReturnValue;                                       // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Tile_Item_C*                        CallFunc_Create_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGenericOperationResult                       CallFunc_GetInventoryItemFlags_Result;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInventoryItemFlags_IsDefaultItem;      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetInventoryItemFlags_IsTestItem;         // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.AddItemWidgetByInventoryItem
// 0x0088 (0x0088 - 0x0000)
struct WB_Options_BallSettings_C_AddItemWidgetByInventoryItem final
{
public:
	struct FSteamInventoryItem                    Item;                                              // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UWB_Tile_Item_C*                        ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<struct FSteamInventoryItemInstance>      ItemInstances;                                     // 0x0030(0x0050)(Edit, BlueprintVisible)
	class UWB_Tile_Item_C*                        CallFunc_AddItemWidgetByPrimaryAssetID_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.OnLoaded_3CB3209849443558EF6F299F64F0FB95
// 0x0008 (0x0008 - 0x0000)
struct WB_Options_BallSettings_C_OnLoaded_3CB3209849443558EF6F299F64F0FB95 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.mOnRequestDone_6742B15F48094DB8BF85C9B0A2FEC884
// 0x0010 (0x0010 - 0x0000)
struct WB_Options_BallSettings_C_MOnRequestDone_6742B15F48094DB8BF85C9B0A2FEC884 final
{
public:
	TArray<struct FSteamInventoryUpdateChange>    ChangeList;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.Completed_061D14B44C354E30BF353A8479919F84
// 0x0008 (0x0008 - 0x0000)
struct WB_Options_BallSettings_C_Completed_061D14B44C354E30BF353A8479919F84 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.SetupCustomizer
// 0x0008 (0x0008 - 0x0000)
struct WB_Options_BallSettings_C_SetupCustomizer final
{
public:
	class AA_GolfBallCustomizer_C*                Param_Customizer;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.BndEvt__WB_Options_BallSettings_Box_Coins_K2Node_ComponentBoundEvent_3_OnItemDropped__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_Options_BallSettings_C_BndEvt__WB_Options_BallSettings_Box_Coins_K2Node_ComponentBoundEvent_3_OnItemDropped__DelegateSignature final
{
public:
	class UWB_Tile_Item_C*                        Tile;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.BndEvt__WB_Options_BallSettings_ColorPicker_K2Node_ComponentBoundEvent_4_OnColorChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WB_Options_BallSettings_C_BndEvt__WB_Options_BallSettings_ColorPicker_K2Node_ComponentBoundEvent_4_OnColorChanged__DelegateSignature final
{
public:
	struct FLinearColor                           ColorHSVA;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorLinear;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.BndEvt__WB_Options_BallSettings_TileView_Items_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_Options_BallSettings_C_BndEvt__WB_Options_BallSettings_TileView_Items_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.BndEvt__WB_Options_BallSettings_TabList_K2Node_ComponentBoundEvent_5_OnTabSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_Options_BallSettings_C_BndEvt__WB_Options_BallSettings_TabList_K2Node_ComponentBoundEvent_5_OnTabSelected__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.SellItem
// 0x0008 (0x0008 - 0x0000)
struct WB_Options_BallSettings_C_SellItem final
{
public:
	class UWB_Tile_Item_C*                        Tile;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.OnSellAction
// 0x0008 (0x0008 - 0x0000)
struct WB_Options_BallSettings_C_OnSellAction final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.BndEvt__WB_Options_BallSettings_TileView_Items_K2Node_ComponentBoundEvent_0_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_Options_BallSettings_C_BndEvt__WB_Options_BallSettings_TileView_Items_K2Node_ComponentBoundEvent_0_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.SellItems
// 0x0020 (0x0020 - 0x0000)
struct WB_Options_BallSettings_C_SellItems final
{
public:
	TArray<struct FPrimaryAssetId>                Assets;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSteamInventoryItemInstanceHandle> Instances;                                         // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.OnMultisaleAnswerReceived
// 0x0001 (0x0001 - 0x0000)
struct WB_Options_BallSettings_C_OnMultisaleAnswerReceived final
{
public:
	bool                                          Answer;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_Options_BallSettings.WB_Options_BallSettings_C.ExecuteUbergraph_WB_Options_BallSettings
// 0x0530 (0x0530 - 0x0000)
struct WB_Options_BallSettings_C_ExecuteUbergraph_WB_Options_BallSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0008(0x0010)(NoDestructor)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FGolfItActionBindingHandle             CallFunc_RegisterBinding_BindingHandle;            // 0x0038(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamInventorySubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USteamInventoryFullUpdateRequest*       CallFunc_RequestFullInventoryUpdate_ReturnValue;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamInventoryUpdateChange>    K2Node_CustomEvent_ChangeList;                     // 0x0078(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(TArray<struct FSteamInventoryUpdateChange>& ChangeList)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FSteamInventoryUpdateChange>    Temp_struct_Variable;                              // 0x0098(0x0010)(ReferenceParm)
	class USteamInventorySubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESteamInventoryItemType                       Temp_byte_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_6;                              // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_7;                              // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_8;                              // 0x0114(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESteamInventoryItemType                       Temp_byte_Variable_1;                              // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Answer)>                  K2Node_CreateDelegate_OutputDelegate_6;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	ESteamInventoryItemType                       Temp_byte_Variable_2;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGolfItUserSettings*                    CallFunc_GetGolfItUserSettings_ReturnValue;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESteamInventoryItemType                       Temp_byte_Variable_3;                              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGolfItUserSettings*                    CallFunc_GetGolfItUserSettings_ReturnValue_1;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AA_GolfBallCustomizer_C*                K2Node_DynamicCast_AsA_Golf_Ball_Customizer;       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetPlayerColor_ReturnValue;               // 0x0164(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        CallFunc_GetBallSkinAssetID_ReturnValue;           // 0x0178(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetBallHatAssetID_ReturnValue;            // 0x0188(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetBallTrailAssetID_ReturnValue;          // 0x0198(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetGoalEffectAssetID_ReturnValue;         // 0x01A8(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetPutterAssetID_ReturnValue;             // 0x01B8(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AA_GolfBallCustomizer_C*                K2Node_CustomEvent_Customizer;                     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Tile_Item_C*                        K2Node_ComponentBoundEvent_Tile;                   // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AA_GolfBallCustomizer_C*                K2Node_DynamicCast_AsA_Golf_Ball_Customizer_1;     // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_ComponentBoundEvent_ColorHSVA;              // 0x01EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_ComponentBoundEvent_ColorLinear;            // 0x01FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Tile_Item_C*                        K2Node_DynamicCast_AsWB_Tile_Item;                 // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x0224(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGolfItUserSettings*                    CallFunc_GetGolfItUserSettings_ReturnValue_2;      // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetPlayerColor_ReturnValue_1;             // 0x0238(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
