#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_Options_General

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GolfIt_structs.hpp"
#include "GolfIt_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Options_General.WB_Options_General_C
// 0x0068 (0x03A0 - 0x0338)
class UWB_Options_General_C final : public UGolfItActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_SettingsEntry_Checkbox_C*           Checkbox_ChatFilter;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Checkbox_HideChallenge;                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Checkbox_HideNotifications;                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Dropdown_Text_C*      Dropbox_GoalVisibility;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Dropdown_Text_C*      Dropbox_PutterVisibility;                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Dropdown_Text_C*      Dropbox_TrailVisibility;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Dropdown_Text_C*      Dropdown_Fullscreen;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Dropdown_Text_C*      Dropdown_Language;                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Dropdown_Text_C*      Dropdown_Resolution;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FIntPoint>                      Resolutions;                                       // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Selected_Resolution;                               // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WB_Options_General_Checkbox_HideNotifications_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Options_General_Dropbox_PutterVisibility_K2Node_ComponentBoundEvent_3_OnSelectionChanged__DelegateSignature(const class FString& Option);
	void BndEvt__WB_Options_General_Dropbox_GoalVisibility_K2Node_ComponentBoundEvent_5_OnSelectionChanged__DelegateSignature(const class FString& Option);
	void ExecuteUbergraph_WB_Options_General(int32 EntryPoint);
	void SetBusVolume(float Volume, TSoftObjectPtr<class UFMODBus> Bus);
	void HideOrShowResolution();
	void SetupResolutions();
	void SortResolutions(TArray<struct FIntPoint>& Input, TArray<struct FIntPoint>* Output);
	void StringToResolution(const class FString& String, struct FIntPoint* Resolution);
	void ResolutionToString(const struct FIntPoint& Resolution, class FString* String);
	void GetResolutions(TArray<struct FIntPoint>* Param_Resolutions, bool* Successful);
	void BP_OnActivated();
	void BndEvt__WB_Options_General_Dropdown_Resolution_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature(const class FString& Option);
	void BndEvt__WB_Options_General_Checkbox_ChatFilter_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Options_Advanced_Dropbox_TrailSettings_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature(const class FString& Option);
	void BndEvt__WB_Options_General_Dropdown_Language_K2Node_ComponentBoundEvent_7_OnSelectionChanged__DelegateSignature(const class FString& Option);
	void BndEvt__WB_Options_General_Dropdown_Fullscreen_K2Node_ComponentBoundEvent_8_OnSelectionChanged__DelegateSignature(const class FString& Option);
	void BndEvt__WB_Options_General_Checkbox_AlwaysShowChallenge_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature(bool Value);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Options_General_C">();
	}
	static class UWB_Options_General_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Options_General_C>();
	}
};

}

