#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_Options_LiveSplit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GolfIt_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GolfItSteam_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Options_LiveSplit.WB_Options_LiveSplit_C
// 0x0030 (0x0368 - 0x0338)
class UWB_Options_LiveSplit_C final : public UGolfItActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_SettingsEntry_Checkbox_C*           Checkbox_MapSplitting;                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Checkbox_ResetOnMapChange;                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Checkbox_C*           Checkbox_WaitForSplit;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Text_C*               Text_Port;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Status;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WB_Options_LiveSplit_Checkbox_MapSplitting_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Options_LiveSplit_Checkbox_ResetOnMapChange_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature(bool Value);
	void BndEvt__WB_Options_LiveSplit_Text_Port_K2Node_ComponentBoundEvent_10_OnTextChanged__DelegateSignature(const class FText& Value, ETextCommit Commit_Method);
	void BP_OnActivated();
	void BndEvt__WB_Options_LiveSplit_Checkbox_WaitForSplit_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature(bool Value);
	void ExecuteUbergraph_WB_Options_LiveSplit(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Options_LiveSplit_C">();
	}
	static class UWB_Options_LiveSplit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Options_LiveSplit_C>();
	}
};

}

