#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_Options_Audio

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GolfIt_structs.hpp"
#include "GolfIt_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Options_Audio.WB_Options_Audio_C
// 0x0090 (0x03C8 - 0x0338)
class UWB_Options_Audio_C final : public UGolfItActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_SettingsEntry_Dropdown_Text_C*      Dropbox_EditorMusic;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Slider_Ambience;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Slider_Ambience_Background;                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Slider_Ambience_Environment;                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Slider_Effects;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Slider_Effects_Collision;                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Slider_Effects_Misc;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Slider_Effects_Movement;                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Slider_Master;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Slider_Music;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Slider_UI;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Slider_UI_Buttons;                                 // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Slider_UI_Notifications;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SettingsEntry_Scalar_C*             Slider_UI_Score;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FIntPoint>                      Resolutions;                                       // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Selected_Resolution;                               // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetBusVolume(float Volume, TSoftObjectPtr<class UFMODBus> Bus);
	void BP_OnActivated();
	void BndEvt__WB_Options_General_Slider_Effects_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Options_General_Slider_Music_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Options_Advanced_Dropbox_EditorMusic_K2Node_ComponentBoundEvent_2_OnSelectionChanged__DelegateSignature(const class FString& Option);
	void BndEvt__WB_Options_General_Slider_Ambience_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Options_General_Slider_Ambience_Background_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Options_General_Slider_Ambience_Environment_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Options_General_Slider_Effects_Ball_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Options_General_Slider_Effects_Effects_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Options_General_Slider_UI_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Options_Audio_Slider_UI_Buttons_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Options_Audio_Slider_UI_Notifications_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Options_Audio_Slider_UI_Score_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Options_Audio_Slider_Effects_Misc_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void BndEvt__WB_Options_Audio_Slider_Master_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature(float Value, float ValueNormalized);
	void ExecuteUbergraph_WB_Options_Audio(int32 EntryPoint);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Options_Audio_C">();
	}
	static class UWB_Options_Audio_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Options_Audio_C>();
	}
};

}

