#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_Popup_YesNo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GolfIt_structs.hpp"


namespace SDK::Params
{

// Function WB_Popup_YesNo.WB_Popup_YesNo_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WB_Popup_YesNo_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function WB_Popup_YesNo.WB_Popup_YesNo_C.BndEvt__WB_Popup_YesNo_Button_Yes_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_Popup_YesNo_C_BndEvt__WB_Popup_YesNo_Button_Yes_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Popup_YesNo.WB_Popup_YesNo_C.BndEvt__WB_Popup_YesNo_Button_No_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_Popup_YesNo_C_BndEvt__WB_Popup_YesNo_Button_No_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Popup_YesNo.WB_Popup_YesNo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_Popup_YesNo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_Popup_YesNo.WB_Popup_YesNo_C.OnInputActionYes
// 0x0008 (0x0008 - 0x0000)
struct WB_Popup_YesNo_C_OnInputActionYes final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Popup_YesNo.WB_Popup_YesNo_C.OnInputActionNo
// 0x0008 (0x0008 - 0x0000)
struct WB_Popup_YesNo_C_OnInputActionNo final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Popup_YesNo.WB_Popup_YesNo_C.ExecuteUbergraph_WB_Popup_YesNo
// 0x0078 (0x0078 - 0x0000)
struct WB_Popup_YesNo_C_ExecuteUbergraph_WB_Popup_YesNo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle_1;            // 0x0020(0x0010)(NoDestructor)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FGolfItActionBindingHandle             CallFunc_RegisterBinding_BindingHandle;            // 0x0040(0x0004)(NoDestructor)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	struct FGolfItActionBindingHandle             CallFunc_RegisterBinding_BindingHandle_1;          // 0x0054(0x0004)(NoDestructor)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ActionName_1;                   // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Popup_YesNo.WB_Popup_YesNo_C.OnAnswerReceived__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_Popup_YesNo_C_OnAnswerReceived__DelegateSignature final
{
public:
	bool                                          Answer;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

