#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_Popup_ItemUnlock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GolfIt_classes.hpp"
#include "GolfItSteam_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Popup_ItemUnlock.WB_Popup_ItemUnlock_C
// 0x0050 (0x0388 - 0x0338)
class UWB_Popup_ItemUnlock_C final : public UGolfItActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Background;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       Image_Item;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Item;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_65;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGolfItInventoryItemDataAsset*          Object;                                            // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TypeText;                                          // 0x0370(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool BP_OnHandleBackAction();
	void SetItem(struct FSteamInventoryItem& Item);
	void Completed_C52ADD7D44571D40589746989D1889D1(class UObject* Loaded);
	void BndEvt__WB_Popup_ItemUnlock_Button_93_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BP_OnActivated();
	void OnInputActionConfirm(class FName ActionName);
	void LoadFromAssetID(const struct FPrimaryAssetId& AssetID);
	void ExecuteUbergraph_WB_Popup_ItemUnlock(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Popup_ItemUnlock_C">();
	}
	static class UWB_Popup_ItemUnlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Popup_ItemUnlock_C>();
	}
};

}

