#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_Scoreboard

#include "Basic.hpp"

#include "GolfItSteam_structs.hpp"
#include "Engine_structs.hpp"
#include "GolfIt_structs.hpp"
#include "GolfIt_classes.hpp"
#include "UMG_structs.hpp"
#include "GolfItUtils_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Scoreboard.WB_Scoreboard_C
// 0x0170 (0x04A8 - 0x0338)
class UWB_Scoreboard_C final : public UGolfItActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          Border_Body;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Header;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Box_Buttons;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Box_Creator;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Box_Votes;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Icon_Only_C*                 Button_Favorite;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Action_C*                    Button_NextLevel;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Default_C*                   Button_Quit;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Icon_Only_C*                 Button_ThumbDown;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Icon_Only_C*                 Button_ThumbUp;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             List_Player;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                Numeric_Par;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Scoreboard_Row_Base_C*              Row_Hole;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Scoreboard_Row_Base_C*              Row_Par;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Buttons;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Quit;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CreatorName;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_GameMode;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Mapname;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Scoreboard_Row_Player_C*            SingleplayerWidget;                                // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class UWB_Scoreboard_Row_Player_C*> HotseatWidgets;                                    // 0x03E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class APlayerState*, class UWB_Scoreboard_Row_Player_C*> MultiplayerWidgets;                                // 0x0430(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          Is_Endcard;                                        // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGolfItLobbyGameState*                  LobbyGameState;                                    // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ScoreboardClosed;                                  // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EUGCItemFavoriteState                         InitialFavoriteState;                              // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGolfItActionBindingHandle             Input_Action_Change_Level_Handle;                  // 0x04A4(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ScoreboardClosed__DelegateSignature();
	void ExecuteUbergraph_WB_Scoreboard(int32 EntryPoint);
	void ManualUpdate();
	void ChooseNextLevel();
	void OnInputActionChangeLevel(class FName ActionName);
	void LoadVotes();
	void OnInputTypeChanged(ECommonInputType NewInputType);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UserScrolled_Horizontal(float ScrollOffset);
	void OnPlayerLeft(class AGolfItBasePlayerState* PlayerState);
	void BndEvt__WB_Scoreboard_Button_Favorite_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_Scoreboard_Button_ThumbDown_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_Scoreboard_Button_ThumbUp_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void OnNextLevelSelected(class UGolfItBaseMapInfo* Map_Info);
	void SetIsEndcard(bool IsEndcard);
	void BndEvt__WB_Scoreboard_WB_Button_Action_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_Scoreboard_WB_Button_Default_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void OnPlayerJoined(class AGolfItBasePlayerState* PlayerState);
	void OnHoleChanged(int32 LastHole, int32 NextHole);
	void Unregister_Events(EGolfItGameType Game_Type);
	void Register_Events(EGolfItGameType Game_Type);
	void BP_OnDeactivated();
	void BP_OnActivated();
	void Construct();
	void MOnRequestSucceeded_9E694EAB453CE4A5DBD14B96FAA0943B(EUGCUserItemVote Vote);
	void MOnRequestFailed_9E694EAB453CE4A5DBD14B96FAA0943B();
	void MOnRequestSucceeded_275E46E74CB2CCD37B5639AAA8D362BF();
	void MOnRequestFailed_275E46E74CB2CCD37B5639AAA8D362BF();
	void MOnRequestSucceeded_FD629465493336ED0A5069A10A938133();
	void MOnRequestFailed_FD629465493336ED0A5069A10A938133();
	void MOnRequestSucceeded_B13B50674CC3795C9641FD95255DA0C9(EUGCUserItemVote Vote);
	void MOnRequestFailed_B13B50674CC3795C9641FD95255DA0C9();
	void MOnRequestSucceeded_2832E9FA4A656113A92394AABCD00820(EUGCUserItemVote Vote);
	void MOnRequestFailed_2832E9FA4A656113A92394AABCD00820();
	void AddPlayerToList(EGolfItGameType Game_Type);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void RemoveInvalidPlayer();
	void AddMissingPlayers(class AGolfItLobbyGameState* GameState);
	void SetFavoriteStyle(EUGCItemFavoriteState State);
	void SetVoteStyle(EUGCUserItemVote Vote);
	void OnContextClosed();
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	bool BP_OnHandleBackAction();
	void ChangeUIVisiblity();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Scoreboard_C">();
	}
	static class UWB_Scoreboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Scoreboard_C>();
	}
};

}

