#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_Scoreboard_Row_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Scoreboard_Row_Base.WB_Scoreboard_Row_Base_C
// 0x0040 (0x02C8 - 0x0288)
class UWB_Scoreboard_Row_Base_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             Footer;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Header;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Footer;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Header;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGolfItTileView*                        TileView_Tiles;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NumValues;                                         // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ESlateVisibility                              ScrollBarVisibility;                               // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Wheel_Scroll_Multiplier;                           // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Set_Colored_Values(TArray<int32>& Values, TArray<struct FLinearColor>& Colors);
	void Set_Colored_Value(int32 Param_Index, int32 Value, const struct FLinearColor& Color);
	void FindOrAddItem(int32 Param_Index, float DefaultValue, const struct FLinearColor& DefaultColor, bool* Added_New_Item, class UWB_Scoreboard_Item_C** Scoreboard_Item);
	void Set_Int_Values(TArray<int32>& Values);
	void Clear_Values();
	void Set_Int_Value(int32 Param_Index, int32 Value);
	void Initialize_Values(int32 Param_NumValues, ESlateVisibility ValueVisibility);
	void SetScrollOffset(const float ScrollOffset);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void ScrollHoleIntoView(int32 HoleIndex);
	void ExecuteUbergraph_WB_Scoreboard_Row_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Scoreboard_Row_Base_C">();
	}
	static class UWB_Scoreboard_Row_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Scoreboard_Row_Base_C>();
	}
};

}

