#pragma once

/*
* SDK generated by Dumper-7 ~ https://github.com/Encryqed/Dumper-7
*
* [Modified by OriginSoftware] ~ https://github.com/Wimberton/OriginPalia
*/

// Package: WB_SettingsEntry_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "WB_SettingsEntry_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_SettingsEntry_Button.WB_SettingsEntry_Button_C
// 0x0170 (0x0488 - 0x0318)
class UWB_SettingsEntry_Button_C final : public UWB_SettingsEntry_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WB_SettingsEntry_Button_C;          // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Background;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_162;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Icon_Only_C*                 WB_Button_Icon_Only;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0340(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSubclassOf<class UCommonTextStyle>           TextStyle;                                         // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	float                                         TextRatio;                                         // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnButtonPressed;                                   // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSlateBrush                            IconBrush;                                         // 0x0378(0x0088)(Edit, BlueprintVisible)
	struct FSlateBrush                            ShadowBrush;                                       // 0x0400(0x0088)(Edit, BlueprintVisible)

public:
	class UWidget* GetPrimaryGamepadFocusWidget();
	void PreConstruct(bool IsDesignTime);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void BndEvt__WB_SettingsEntry_Button_WB_Button_Icon_Only_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WB_SettingsEntry_Button(int32 EntryPoint);
	void OnButtonPressed__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_SettingsEntry_Button_C">();
	}
	static class UWB_SettingsEntry_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_SettingsEntry_Button_C>();
	}
};

}

